<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Android, Stay" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="select * from life">
<meta property="og:type" content="website">
<meta property="og:title" content="Stay's notes">
<meta property="og:url" content="http://notes.stay4it.com/index.html">
<meta property="og:site_name" content="Stay's notes">
<meta property="og:description" content="select * from life">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Stay's notes">
<meta name="twitter:description" content="select * from life">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> Stay's notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left 
   page-home 
 ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">

    

    
    
      
      
        
        
        
      

      
    

    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/02/26/android-optimize-tips/" itemprop="url">
                  那些Android上的性能优化
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-02-26T14:58:32+08:00" content="2016-02-26">
              2016-02-26
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/高效开发/" itemprop="url" rel="index">
                    <span itemprop="name">高效开发</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/02/26/android-optimize-tips/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/02/26/android-optimize-tips/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x6027;&#x80FD;&#x4F18;&#x5316;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x95EE;&#x4F60;&#x5728;Android&#x4E2D;&#x5982;&#x4F55;&#x505A;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#xFF0C;&#x4E5F;&#x8BB8;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x54EA;&#x5F00;&#x59CB;&#x8BF4;&#x8D77;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8981;&#x660E;&#x767D;&#x7684;&#x662F;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7684;App&#x9700;&#x8981;&#x4F18;&#x5316;&#xFF0C;&#x6700;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x65F6;&#x523B;&#xFF1A;&#x7528;&#x6237;say&#xFF0C;&#x4EC0;&#x4E48;&#x72D7;&#x5C4E;&#xFF0C;&#x5237;&#x8FD9;&#x4E48;&#x4E45;&#x90FD;&#x6CA1;&#x53CD;&#x5E94;&#xFF0C;&#x53D6;&#x5173;&#x5378;&#x8F7D;&#x7B97;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x8DDF;&#x4EC0;&#x4E48;&#x6709;&#x5173;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x82CD;&#x767D;&#x7684;&#x53CD;&#x9A73;&#x4E0B;&#xFF0C;&#x5C3C;&#x739B;&#x7528;&#x6237;&#x8BBE;&#x5907;&#x8001;&#x65E7;&#x7F51;&#x53C8;&#x70C2;&#xFF0C;&#x5173;&#x6211;&#x5C41;&#x4E8B;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x7528;&#x4F18;&#x5316;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x8001;&#x677F;&#x62CD;&#x677F;&#x4E86;&#xFF0C;&#x65BD;&#x538B;&#x7ED9;CTO&#xFF0C;&#x7136;&#x540E;CTO&#x53C8;&#x6765;&#x627E;&#x4F60;&#xFF1A;Y&#x7684;&#x4ECA;&#x5929;&#x5FC5;&#x987B;&#x7ED9;&#x6211;&#x60F3;&#x529E;&#x6CD5;&#x4F18;&#x5316;&#x4E86;&#xFF0C;&#x4E0D;&#x7136;&#x4E0D;&#x51C6;&#x56DE;&#x5BB6;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4ECE;UI&#x7684;&#x8868;&#x8C61;&#x4E0A;&#x770B;&#xFF0C;App&#x53C8;&#x5361;&#x53C8;&#x6162;&#x800C;&#x4E14;&#x8FD8;&#x9519;&#x4E71;&#x3002;&#x6211;&#x4EEC;&#x8BD5;&#x7740;&#x6765;&#x5256;&#x6790;&#x4E0B;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x9898;&#x5916;&#x8BDD;&#xFF1A;&#x628A;minSDK&#x6539;&#x5230;4.0&#xFF0B;&#xFF0C;&#x53BB;&#x7279;&#x4E48;&#x7684;low&#x7528;&#x6237;&#xFF0C;&#x8FDE;&#x624B;&#x673A;&#x90FD;&#x4E0D;&#x613F;&#x610F;&#x6362;&#xFF0C;&#x8FD8;&#x80FD;&#x6307;&#x671B;&#x5B83;&#x80FD;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x591A;&#x5C11;&#x8425;&#x6536;&#x4E48;&#xFF0C;&#x76F4;&#x63A5;pass&#x6389;&#x5427;&#x3002;4.0&#x524D;&#x7684;&#x7CFB;&#x7EDF;bug&#x4E0D;&#x5C11;&#xFF0C;&#x4E0D;&#x80FD;&#x4E3A;&#x4E86;&#x5F25;&#x8865;&#x8FD9;&#x4E9B;bug&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x6574;&#x4F53;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x3002;</p>
</blockquote>
<p>&#x597D;&#x4E86;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x4ECE;<strong>UI</strong>&#x8BF4;&#x8D77;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#x8981;&#x660E;&#x767D;&#x7684;&#x662F;UI&#x7684;<strong>&#x7ED8;&#x5236;&#x6D41;&#x7A0B;</strong>&#xFF1A;measure-layout-draw&#xFF0C;measure&#x4E0E;layout&#x90FD;&#x9700;&#x8981;for loop&#x6240;&#x6709;&#x7684;&#x5B50;&#x63A7;&#x4EF6;&#xFF0C;&#x6C47;&#x96C6;&#x8D77;&#x6765;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x7ED8;&#x5236;&#xFF0C;&#x5E03;&#x5C40;&#x3002;&#x6240;&#x4EE5;&#x5B50;&#x63A7;&#x4EF6;&#x8D8A;&#x591A;&#xFF0C;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x957F;(<strong>inflate&#xFF0C;layout_weight&#xFF0C;relative&#xFF0C;&#x591A;&#x5C42;&#x5D4C;&#x5957;</strong>&#x7B49;)&#xFF0C;&#x51CF;&#x5C11;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5B50;&#x63A7;&#x4EF6;&#x6216;&#x5C42;&#x7EA7;&#xFF0C;&#x662F;&#x76F8;&#x5F53;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;merge,viewstub&#x8FD9;&#x4E9B;&#x6807;&#x7B7E;&#x6765;&#x51CF;&#x5C11;&#x5C42;&#x7EA7;&#x5D4C;&#x5957;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7A7A;&#x95F4;&#x89C2;&#x5FF5;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;HierarchyViewer&#x5DE5;&#x5177;&#x6765;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;Listview&#x6216;&#x8005;GridView&#x8FD9;&#x79CD;&#x591A;item&#x7684;&#x7EC4;&#x4EF6;&#x6765;&#x8BF4;&#xFF0C;&#x590D;&#x7528;item&#x53EF;&#x4EE5;&#x51CF;&#x5C11;inflate&#x6B21;&#x6570;&#xFF0C;&#x901A;&#x8FC7;setTag&#xFF0C;getTag&#x7684;ViewHolder&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x590D;&#x7528;&#xFF0C;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;holder&#x4E2D;&#x7684;&#x63A7;&#x4EF6;&#x6700;&#x597D;<strong>reset</strong>&#x540E;&#x518D;&#x8D4B;&#x503C;&#xFF0C;&#x907F;&#x514D;&#x56FE;&#x7247;&#xFF0C;&#x6587;&#x5B57;&#x9519;&#x4E71;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;ViewPager&#x7B2C;&#x4E00;&#x6B21;&#x663E;&#x793A;&#x65F6;&#x5361;&#x987F;&#x4EE5;&#x53CA;&#x5DE6;&#x53F3;&#x6ED1;&#x52A8;&#x5361;&#x987F;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x4F18;&#x5316;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ol>
<li>ViewPager&#x540C;&#x65F6;&#x7F13;&#x5B58;page&#x6570;&#x6700;&#x597D;&#x4E3A;&#x6700;&#x5C0F;&#x503C;3&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x4E00;&#x6B21;&#x663E;&#x793A;&#x65F6;&#xFF0C;ViewPager&#x6240;&#x521D;&#x59CB;&#x5316;&#x7684;pager&#x5C31;&#x4F1A;&#x5F88;&#x591A;&#xFF0C;&#x8FD9;&#x6837;pager&#x7D2F;&#x79EF;&#x6E32;&#x67D3;&#x8017;&#x65F6;&#x5C31;&#x4F1A;&#x589E;&#x591A;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x5361;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;pager&#x5E94;&#x8BE5;&#x53EA;&#x5728;&#x663E;&#x793A;&#x65F6;&#x624D;&#x52A0;&#x8F7D;&#x7F51;&#x7EDC;&#x6216;&#x6570;&#x636E;&#x5E93;(UserVisibleHint=true)&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x9884;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x514D;&#x9020;&#x6210;&#x6D6A;&#x8D39;</li>
</ol>
<p>&#x56FE;&#x7247;&#x663E;&#x793A;&#x4E0D;&#x51FA;&#x6765;&#x6216;&#x8005;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x592A;&#x957F;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5206;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x3002;</p>
<ol>
<li>&#x5BF9;&#x4E8E;&#x4E0B;&#x8F7D;&#xFF0C;&#x8981;&#x63A7;&#x5236;&#x597D;&#x540C;&#x65F6;&#x4E0B;&#x8F7D;&#x7684;&#x6700;&#x5927;&#x4EFB;&#x52A1;&#x6570;(&#x5E73;&#x5747;&#x901F;&#x5EA6;&#x6162;)&#xFF0C;&#x540C;&#x65F6;&#x7ED9;InputStream&#x518D;&#x5305;&#x4E00;&#x5C42;&#x7F13;&#x51B2;&#x6D41;&#x4F1A;&#x66F4;&#x5FEB;(&#x5982;BufferedInputStream)&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x77E5;&#x9053;&#x4E00;&#x70B9;&#xFF0C;&#x867D;&#x7136;&#x4E0B;&#x8F7D;&#x7684;&#x56FE;&#x7247;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x51E0;&#x767E;K&#xFF0C;&#x4F46;&#x662F;decode&#x6210;bitmap&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x662F;&#x6210;&#x500D;&#x7684;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x51CF;&#x5C0F;&#x56FE;&#x7247;size&#x662F;&#x6839;&#x672C;&#x56E0;&#x7D20;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x7AEF;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x56FE;&#x7247;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5185;&#x5B58;&#x603B;&#x6709;&#x8017;&#x5C3D;&#x7684;&#x65F6;&#x523B;&#xFF0C;&#x522B;&#x8001;&#x60F3;&#x7740;&#x5927;&#x5206;&#x8FA8;&#x7387;&#x4F1A;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x5B9E;&#x9645;&#x5C31;&#x53EA;&#x6709;150<em>150&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x975E;&#x7ED9;&#x5F04;&#x5F20;1000</em>1000&#x7684;&#x56FE;&#x7247;&#x662F;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x3002;&#x53E6;&#x5916;&#x8BBA;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#xFF1A;&#x5185;&#x5B58;&gt;&#x786C;&#x76D8;&gt;&#x7F51;&#x7EDC;&#xFF0C;&#x5408;&#x7406;&#x7684;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x4E5F;&#x662F;&#x5173;&#x952E;&#x3002;&#x5047;&#x5982;&#x81EA;&#x5DF1;&#x5199;&#x4E0D;&#x597D;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5F00;&#x6E90;&#x7684;&#x56FE;&#x7247;&#x7F13;&#x5B58;&#x6846;&#x67B6;&#xFF0C;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x64CD;&#x5FC3;&#x3002;</li>
</ol>
<hr>
<p><strong>&#x518D;&#x8BF4;&#x7F13;&#x5B58;</strong></p>
<p>&#x6709;&#x5F88;&#x591A;&#x79CD;&#x7F13;&#x5B58;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x4E0D;&#x7528;Stay&#x5217;&#x4E3E;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BF4;&#x7684;&#x662F;&#x642D;&#x914D;&#x4F7F;&#x7528;&#x3002;</p>
<ol>
<li>&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x7528;&#x5F3A;&#x5F15;&#x7528;&#xFF0C;HashMap&#xFF0C;&#x540E;&#x6765;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5360;&#x5185;&#x5B58;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x8F6F;&#x5F15;&#x7528;&#xFF0C;&#x5F31;&#x5F15;&#x7528;&#x6765;&#x53CA;&#x65F6;&#x56DE;&#x6536;&#xFF0C;&#x518D;&#x540E;&#x6765;&#x56E0;&#x4E3A;&#x56DE;&#x6536;&#x673A;&#x5236;&#x4E0D;&#x53EF;&#x63A7;&#xFF0C;&#x6240;&#x4EE5;&#x53C8;&#x6709;&#x4E86;lrucache&#xFF0C;disklrucache&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x6765;&#x5E73;&#x8861;&#x5185;&#x5B58;&#x4E0E;&#x786C;&#x76D8;&#x7F13;&#x5B58;&#x3002;&#x968F;&#x7740;android&#x7248;&#x672C;&#x7684;&#x63A8;&#x8FDB;&#x4E0E;&#x6F14;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5E94;&#x8BE5;&#x62E5;&#x62B1;&#x53D8;&#x5316;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;App&#x91CC;&#x8FD8;&#x6709;&#x8F6F;&#x5F15;&#x7528;&#xFF0C;&#x5F31;&#x5F15;&#x7528;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x59A8;&#x518D;check&#x4E0B;&#x3002;</li>
<li>&#x6BD4;&#x65B9;&#x8BF4;&#x7F51;&#x7EDC;&#xFF0B;&#x6570;&#x636E;&#x5E93;&#x3002;&#x7F51;&#x7EDC;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x53BB;&#x4E3B;&#x52A8;&#x83B7;&#x53D6;&#xFF0C;&#x800C;&#x975E;&#x88AB;&#x52A8;&#x63A5;&#x53D7;&#x3002;&#x90A3;&#x5982;&#x679C;&#x8BF4;&#x6570;&#x636E;&#x662F;&#x91CD;&#x590D;&#x7684;&#x6216;&#x8005;&#x672A;&#x66F4;&#x6539;&#x7684;&#x5462;&#xFF1F;&#x90A3;&#x6211;&#x4EEC;&#x53BB;&#x53D6;&#x4E00;&#x6B21;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x5462;&#xFF1F;&#x6211;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7ED9;&#x6BCF;&#x4E2A;activity&#x6216;fragment&#x6216;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x8BF7;&#x6C42;&#x95F4;&#x9694;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;listview&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4FDD;&#x5B58;&#x4E00;&#x4EFD;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x8BB0;&#x4E0B;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x5F53;&#x4E0B;&#x6B21;&#x91CD;&#x65B0;&#x521D;&#x59CB;&#x5316;&#x65F6;&#xFF0C;&#x5224;&#x65AD;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x95F4;&#x9694;(&#x5982;5&#x5206;&#x949F;)&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x53EA;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x5E93;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x505A;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x9690;&#x5F0F;&#x7684;http&#x8BF7;&#x6C42;&#x6846;&#x67B6;&#x4F1A;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x4E0D;&#x518D;&#x8BF7;&#x6C42;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;304&#x65F6;&#x5C06;&#x4E4B;&#x524D;&#x7F13;&#x5B58;&#x7684;&#x6570;&#x636E;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x3002;</li>
</ol>
<hr>
<p>&#x53CD;&#x6B63;&#x4E5F;&#x8BF4;&#x5230;<strong>&#x7F51;&#x7EDC;</strong>&#x4E86;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x4E5F;&#x6765;&#x8BF4;&#x8BF4;</p>
<ol>
<li>&#x73B0;&#x5728;&#x6709;&#x5F88;&#x591A;&#x73B0;&#x6210;HTTP&#x6846;&#x67B6;&#x4F9B;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x51E0;&#x4E4E;&#x53EA;&#x7528;&#x5199;&#x914D;&#x7F6E;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x4E00;&#x4E2A;url&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x670D;&#x52A1;&#x7AEF;&#x914D;&#x5408;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;json&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF0C;WebP&#x4EE3;&#x66FF;jpg&#xFF0C;&#x652F;&#x6301;&#x65AD;&#x70B9;&#x7EED;&#x4F20;&#xFF0C;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x505A;&#x91CD;&#x5B9A;&#x5411;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7F13;&#x5B58;&#x4EE5;&#x53CA;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B49;&#x3002;</li>
<li>&#x5BF9;&#x5BA2;&#x6237;&#x7AEF;&#x672C;&#x8EAB;&#xFF0C;&#x9664;&#x4E86;&#x4E0A;&#x8FF0;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5408;&#x7406;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x63A7;&#x5236;&#x6700;&#x5927;&#x8BF7;&#x6C42;&#x5E76;&#x53D1;&#x91CF;&#xFF0C;&#x53CA;&#x65F6;&#x53D6;&#x6D88;&#x5DF2;&#x5931;&#x6548;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x8FC7;&#x6EE4;&#x91CD;&#x590D;&#x8BF7;&#x6C42;&#xFF0C;timeout&#x65F6;&#x95F4;&#x8BBE;&#x7F6E;&#xFF0C;&#x8BF7;&#x6C42;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x7F6E;&#x7B49;&#x3002;</li>
</ol>
<p>&#x4F18;&#x5316;&#x53EF;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x4E8B;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x4F18;&#x5316;&#x91CD;&#x6784;&#xFF0C;&#x90A3;&#x662F;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x3002;&#x9700;&#x8981;&#x591A;&#x65B9;&#x9762;&#x7684;&#x9884;&#x5224;&#x4E0E;&#x8054;&#x8C03;&#x3002;&#x5408;&#x7406;&#x7684;&#x5047;&#x8BBE;&#x4E0E;&#x5B9E;&#x8DF5;&#x662F;&#x4F18;&#x5316;&#x6700;&#x91CD;&#x8981;&#x7684;&#x624B;&#x6BB5;&#x3002;</p>
<hr>
<p>&#x8BF4;&#x5B8C;&#x8FD9;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x8BF4;&#x8BF4;&#x4E00;&#x4E9B;&#x5E38;&#x8BC6;&#xFF0C;&#x6216;&#x8005;&#x79F0;&#x4E4B;&#x4E3A;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x3002;</p>
<ol>
<li>&#x4F60;&#x8981;&#x77E5;&#x9053;for loop&#x4E2D;&#x4E0D;&#x8981;&#x58F0;&#x660E;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#xFF0C;&#x4E0D;&#x5230;&#x4E07;&#x4E0D;&#x5F97;&#x5DF2;&#x4E0D;&#x8981;&#x5728;&#x91CC;&#x9762;&#x5199;try catch&#x3002;</li>
<li>&#x660E;&#x767D;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF0C;&#x907F;&#x514D;&#x9891;&#x7E41;GC&#xFF0C;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;OOM(&#x6709;&#x673A;&#x4F1A;&#x4E13;&#x95E8;&#x8BF4;)</li>
<li>&#x5408;&#x7406;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;StringBuilder&#x4EE3;&#x66FF;String&#xFF0C;(&#x7B14;&#x8BD5;&#x9898;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;str+=&#x201D;str&#x201D;&#x4E2D;&#x6709;&#x51E0;&#x4E2A;&#x5BF9;&#x8C61;) &#xFF0C;&#x5C11;&#x7528;&#x679A;&#x4E3E;enum&#xFF0C;&#x5C11;&#x7528;&#x7236;&#x7C7B;&#x58F0;&#x660E;(List,Map)</li>
<li>&#x5982;&#x679C;&#x4F60;&#x6709;&#x9891;&#x7E41;&#x7684;new&#x7EBF;&#x7A0B;&#xFF0C;&#x90A3;&#x6700;&#x597D;&#x901A;&#x8FC7;&#x7EBF;&#x7A0B;&#x6C60;&#x53BB;execute&#x5B83;&#x4EEC;&#xFF0C;&#x51CF;&#x5C11;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x5F00;&#x9500;&#x3002;</li>
<li>&#x4F60;&#x8981;&#x77E5;&#x9053;&#x5355;&#x4F8B;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x5E76;&#x6B63;&#x786E;&#x7684;&#x4F7F;&#x7528;&#x5B83;&#x3002;</li>
<li>&#x591A;&#x7528;&#x5E38;&#x91CF;&#xFF0C;&#x5C11;&#x7528;&#x663E;&#x5F0F;&#x7684;&#x201D;action_key&#x201D;&#xFF0C;&#x5E76;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x7C7B;&#xFF0C;&#x522B;&#x91CD;&#x590D;&#x58F0;&#x660E;&#x8FD9;&#x4E9B;&#x5E38;&#x91CF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x53EF;&#x4EE5;&#xFF0C;&#x81F3;&#x5C11;&#x8981;&#x5F04;&#x61C2;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#xFF0C;&#x7EC4;&#x5408;&#x6A21;&#x5F0F;&#xFF0C;&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#xFF0C;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x80FD;&#x5E2E;&#x52A9;&#x4F60;&#x5408;&#x7406;&#x7684;&#x89E3;&#x8026;&#xFF0C;&#x5373;&#x4F7F;&#x9700;&#x6C42;&#x9891;&#x7E41;&#x53D8;&#x66F4;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x7528;&#x5BB3;&#x6015;&#x7275;&#x4E00;&#x53D1;&#x800C;&#x52A8;&#x5168;&#x8EAB;&#x3002;&#x9700;&#x6C42;&#x53D8;&#x66F4;&#x4E0D;&#x53EF;&#x6015;&#xFF0C;&#x53EF;&#x6015;&#x7684;&#x662F;&#x6CA1;&#x6709;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x505A;&#x5408;&#x7406;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</li>
</ol>
<p>&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#xFF0C;Stay&#x6240;&#x8BF4;&#x7684;&#x4E5F;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x8F6E;&#x5ED3;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x4E0D;&#x65AD;&#x7684;&#x5C1D;&#x8BD5;&#x3002;&#x4F1A;&#x5F00;&#x53D1;&#x5199;&#x4EE3;&#x7801;&#x8DDF;&#x4F1A;&#x505A;&#x4EA7;&#x54C1;&#x7684;&#x533A;&#x522B;&#x8FD8;&#x662F;&#x86EE;&#x5927;&#x7684;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x6001;&#x5EA6;&#x5C31;&#x80FD;&#x5237;&#x6B7B;80%&#x7684;&#x7801;&#x519C;&#x4E86;&#x3002;&#x5F53;&#x4F60;&#x78B0;&#x5230;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x4F18;&#x5316;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8010;&#x5FC3;&#x7684;&#x53BB;&#x5206;&#x6790;&#xFF0C;&#x65F6;&#x95F4;&#x7684;&#x7D2F;&#x79EF;&#x4F1A;&#x8BA9;&#x4F60;&#x6210;&#x4E3A;&#x771F;&#x6B63;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;</p>
<hr>
<p>&#x53E6;&#x5916;&#x4F18;&#x5316;&#x4E5F;&#x6CA1;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x5B8C;&#x7F8E;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x4F18;&#x5316;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x7684;&#x4E1A;&#x52A1;&#x6765;&#x505A;&#x7684;&#xFF0C;&#x8981;&#x660E;&#x767D;&#x6C9F;&#x901A;&#x662F;&#x6700;&#x597D;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x4E0D;&#x76F2;&#x4ECE;&#xFF0C;&#x4E0D;&#x968F;&#x4FBF;&#xFF0C;&#x4E09;&#x601D;&#x800C;&#x540E;&#x884C;&#x3002;</p>
<p>Android&#x4E0A;&#x5982;&#x4F55;&#x505A;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#xFF1F;&#x5927;&#x6982;&#x5199;&#x4E09;&#x5E74;&#x4EE3;&#x7801;&#x5C31;&#x80FD;&#x5DEE;&#x4E0D;&#x591A;&#x77E5;&#x9053;&#x4E86;&#x3002;</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    

  </section>

  


          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel  sidebar-panel-active ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">5</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"stay4it-note"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  

  
  


</body>
</html>
