<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="android,高效学习," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x5199;&amp;#x7ED9;&amp;#x4E00;&amp;#x4F4D;&amp;#x540C;&amp;#x5B66;&amp;#xFF0C;&amp;#x60F3;&amp;#x5FC5;&amp;#x4E5F;&amp;#x9002;&amp;#x5408;&amp;#x6B63;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x540C;&amp;#x5B66;&amp;#x3002;

&amp;#x679">
<meta property="og:type" content="article">
<meta property="og:title" content="方法论-如何保持较高的学习热情">
<meta property="og:url" content="http://notes.stay4it.com/2016/02/01/how-to-keep-learning-on-new-things/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x5199;&amp;#x7ED9;&amp;#x4E00;&amp;#x4F4D;&amp;#x540C;&amp;#x5B66;&amp;#xFF0C;&amp;#x60F3;&amp;#x5FC5;&amp;#x4E5F;&amp;#x9002;&amp;#x5408;&amp;#x6B63;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x540C;&amp;#x5B66;&amp;#x3002;

&amp;#x679">
<meta property="og:updated_time" content="2016-03-02T02:12:01.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="方法论-如何保持较高的学习热情">
<meta name="twitter:description" content="&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x5199;&amp;#x7ED9;&amp;#x4E00;&amp;#x4F4D;&amp;#x540C;&amp;#x5B66;&amp;#xFF0C;&amp;#x60F3;&amp;#x5FC5;&amp;#x4E5F;&amp;#x9002;&amp;#x5408;&amp;#x6B63;&amp;#x5728;&amp;#x5B66;&amp;#x4E60;&amp;#x7684;&amp;#x540C;&amp;#x5B66;&amp;#x3002;

&amp;#x679">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 方法论-如何保持较高的学习热情 | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                方法论-如何保持较高的学习热情
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-02-01T10:16:36+08:00" content="2016-02-01">
              2016-02-01
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/方法论/" itemprop="url" rel="index">
                    <span itemprop="name">方法论</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/02/01/how-to-keep-learning-on-new-things/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/02/01/how-to-keep-learning-on-new-things/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/02/01/how-to-keep-learning-on-new-things/" class="leancloud_visitors" data-flag-title="方法论-如何保持较高的学习热情">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5199;&#x7ED9;&#x4E00;&#x4F4D;&#x540C;&#x5B66;&#xFF0C;&#x60F3;&#x5FC5;&#x4E5F;&#x9002;&#x5408;&#x6B63;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x540C;&#x5B66;&#x3002;</p>
<blockquote>
<p>&#x6797;&#x540C;&#x5B66;&#x8BF4;&#xFF1A; &#x6211;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x5F88;high&#x7684;&#x5B66;&#x4E60;&#x72B6;&#x6001;&#xFF0C;&#x8001;&#x5927;&#x4F60;&#x4EE5;&#x524D;&#x90A3;&#x6BB5;3&#x4E2A;&#x6708;&#x5B66;&#x4E60;j2e&#xFF0C;&#x7136;&#x540E;&#x8F9E;&#x804C;&#x5B66;&#x5B89;&#x5353;&#x6CA1;&#x51E0;&#x5929;&#x5C31;&#x53BB;&#x4E0A;&#x73ED;&#x662F;&#x600E;&#x4E48;&#x4FDD;&#x6301;&#x5B66;&#x4E60;&#x72B6;&#x6001;&#x7684;&#x597D;&#x597D;&#x5947;&#x3002;&#x3002;&#x3002;&#x3002;</p>
</blockquote>
<p>We..ell, &#x6797;&#x540C;&#x5B66;&#xFF0C;&#x4F60;&#x60F3;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x5728;&#x53D8;&#x5316;&#x7684;&#x4E16;&#x754C;&#x54EA;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x72B6;&#x6001;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x5373;&#x65F6;&#x6709;&#x70DF;&#x763E;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x4F1A;24&#x5C0F;&#x65F6;&#x90FD;&#x5728;&#x62BD;&#x70DF;&#xFF0C;&#x5403;&#x8D27;&#x4E5F;&#x4E0D;&#x80FD;24&#x5C0F;&#x65F6;&#x90FD;&#x5728;&#x5403;&#xFF0C;&#x81F3;&#x5C11;&#x5F97;&#x7559;&#x534A;&#x5C0F;&#x65F6;&#x6E05;&#x5185;&#x5B58;&#x5427;&#x3002;</p>
<p>&#x6211;&#x731C;&#xFF0C;&#x4F60;&#x60F3;&#x95EE;&#x5F97;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x5B66;&#x4E60;&#x633A;&#x67AF;&#x71E5;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x591F;&#x575A;&#x6301;&#x5B66;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6BD4;&#x8F83;&#x597D;&#x56DE;&#x7B54;&#x3002;&#x4F60;&#x4E14;&#x542C;&#x542C;&#xFF1A;</p>
<ol>
<li><p>&#x4F60;&#x5F97;&#x660E;&#x786E;&#xFF0C;&#x5728;&#x5B66;&#x5F97;&#x4E1C;&#x897F;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x5BF9;&#x4F60;&#x672A;&#x6765;&#x6709;&#x83AB;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p>
</li>
<li><p>&#x522B;&#x5C06;&#x5B83;&#x53D8;&#x6210;&#x4F60;&#x7684;&#x654C;&#x4EBA;&#xFF0C;&#x522B;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#x727A;&#x7272;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x653E;&#x5F03;&#x4E86;&#x5F88;&#x591A;&#x3002;</p>
</li>
<li><p>&#x5B66;&#x4E60;&#x672C;&#x8EAB;&#x4E0D;&#x67AF;&#x71E5;&#x7684;&#xFF0C;&#x67AF;&#x71E5;&#x7684;&#x662F;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8BD5;&#x60F3;&#xFF0C;&#x82E5;&#x4E0D;&#x80FD;&#x5B66;&#x4EE5;&#x81F4;&#x7528;&#xFF0C;&#x80FD;&#x575A;&#x6301;&#x591A;&#x4E45;&#xFF1F;&#x82E5;&#x6CA1;&#x6709;&#x4EBA;&#x4E0E;&#x4F60;&#x5206;&#x4EAB;&#x8BA8;&#x8BBA;&#xFF0C;&#x80FD;&#x575A;&#x6301;&#x591A;&#x4E45;&#xFF1F;&#x6050;&#x6015;&#x6700;&#x591A;&#x4E00;&#x5468;&#x5C31;&#x8981;&#x653E;&#x5F03;&#x4E86;&#x3002;</p>
</li>
</ol>
<p>&#x8BF4;&#x4EE5;&#x524D;&#x7684;&#x5386;&#x53F2;&#x6CA1;&#x591A;&#x5927;&#x610F;&#x4E49;&#xFF0C;&#x4EC0;&#x4E48;3&#x4E2A;&#x6708;&#x5B66;j2ee&#xFF0C;7&#x5929;&#x5B66;android&#x5C31;&#x80FD;&#x5DE5;&#x4F5C;&#x3002;&#x90A3;&#x5DF2;&#x7ECF;&#x662F;5&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x5E74;&#x4EE3;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x793E;&#x4F1A;&#x8BA4;&#x53EF;&#x7684;&#x6807;&#x51C6;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x6211;&#x5C31;&#x8BF4;&#x8BF4;&#x6211;&#x76EE;&#x524D;&#x600E;&#x4E48;&#x5B66;PHP&#x7684;&#x5427;&#x3002;</p>
<a id="more"></a>
<p>&#x5148;&#x8BF4;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8981;&#x5B66;PHP&#xFF0C;&#x6211;&#x7684;&#x76EE;&#x6807;&#x5F88;&#x660E;&#x786E;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x7ED9;&#x79FB;&#x52A8;&#x7AEF;&#x63D0;&#x4F9B;API&#x5C31;&#x53EF;&#x4EE5;(&#x5F55;&#x5236;&#x7684;&#x8BFE;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x4E9B;API&#x8BF7;&#x6C42;&#x6D4B;&#x8BD5;)&#xFF0C;&#x6682;&#x65F6;&#x4E0D;&#x7BA1;H5&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4EA4;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x505A;&#xFF1F;&#x53CD;&#x6B63;&#x4E0D;&#x4E0A;&#x73ED;&#xFF0C;&#x5B66;&#x5B66;&#x65B0;&#x4E1C;&#x897F;&#x4E5F;&#x65E0;&#x59A8;&#xFF0C;&#x4E07;&#x4E00;&#x5931;&#x8D25;&#x4E86;&#x8FD8;&#x80FD;&#x5FEB;&#x901F;&#x7684;&#x9002;&#x5E94;&#x65B0;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x591A;&#x96BE;&#x7684;&#x4E8B;&#xFF0C;&#x6211;&#x575A;&#x4FE1;&#x6CA1;&#x6709;&#x505A;&#x4E0D;&#x6210;&#x7684;&#x4E8B;&#xFF0C;&#x53EA;&#x6709;&#x653E;&#x5F03;&#x7684;&#x4EBA;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x5FC3;&#x4E4B;&#x4EBA;&#x6210;&#x65E0;&#x4E8B;&#xFF0C;&#x65E0;&#x5FC3;&#x4E4B;&#x4EBA;&#x4E8B;&#x65E0;&#x6210;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x6709;&#x4E00;&#x5957;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x5230;&#x6211;&#x8FD9;&#x5468;&#x5B66;&#x7684;PHP&#xFF1A;<br>&#x4E0A;&#x5468;&#x65E5;&#xFF1A;&#x8BED;&#x8A00;&#x9009;&#x62E9;&#xFF08;PHP&#xFF0C;python&#xFF0C;scala&#xFF0C;j2ee&#xFF09; &#x522B;&#x8BF4;&#x4F60;&#x6CA1;&#x7EA0;&#x7ED3;&#x8FC7;&#xFF5E;<br>&#x5468;&#x4E00;&#xFF1A;w3c&#x4E0A;&#x5B66;&#x4E60;PHP&#x7684;&#x57FA;&#x672C;&#x8BED;&#x6CD5;&#xFF0C;&#x4E0B;IDE&#x3002;<br>&#x5468;&#x4E8C;&#xFF1A;&#x5DE9;&#x56FA;&#x8BED;&#x6CD5;&#xFF0B;&#x5B9E;&#x8DF5;&#x3002;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5F00;&#x53D1;&#xFF0C;&#x4E70;&#x4E2A;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x73A9;&#x73A9;&#x86EE;&#x597D;&#x7684;(199/&#x5E74;)&#xFF0C;api.stay4it.com&#xFF0C;&#x4EE5;&#x540E;&#x5C31;&#x7528;&#x5B83;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x8BFE;&#x7A0B;&#x5185;&#x7684;API&#x8BF7;&#x6C42;&#x4E86;&#x3002;<br>&#x5468;&#x4E09;&#xFF1A;&#x81EA;&#x5DF1;&#x8BA1;&#x5212;&#x4E00;&#x4E2A;&#x5C0F;&#x529F;&#x80FD;&#xFF0C;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x9009;&#x7684;&#x6CE8;&#x518C;&#xFF0C;&#x767B;&#x5F55;&#x4EE5;&#x53CA;token&#x8BA4;&#x8BC1;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x79FB;&#x52A8;&#x7AEF;&#x767B;&#x5F55;&#x540E;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x90FD;&#x4E0D;&#x7528;&#x518D;&#x767B;&#x5F55;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3002;<br>&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x9700;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x62FF;&#x5230;&#x79FB;&#x52A8;&#x7AEF;&#x8BF7;&#x6C42;&#x7684;params&#xFF0C;&#x5982;&#x4F55;&#x4FDD;&#x5B58;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;&#x4F55;&#x9A8C;&#x8BC1;account&#x662F;&#x5426;&#x5DF2;&#x6CE8;&#x518C;&#xFF0C;&#x767B;&#x5F55;&#x751F;&#x6210;token&#xFF0C;token&#x52A0;&#x89E3;&#x5BC6;&#xFF0C;token&#x5931;&#x6548;&#x5224;&#x65AD;&#xFF0C;token&#x66F4;&#x65B0;&#x3002;&#x3002;&#x3002;&#x62C6;&#x89E3;&#x8FD9;&#x4E9B;&#x9700;&#x6C42;&#x540E;&#x6392;&#x597D;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x53BB;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x5728;&#x6211;&#x5199;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6CE8;&#x518C;&#x767B;&#x5F55;&#x8FC7;&#x7A0B;&#xFF0C;&#x671F;&#x95F4;&#x5F53;&#x7136;bug&#x6EE1;&#x5929;&#x98DE;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;java&#xFF0C;&#x6162;&#x6162;&#x5199;&#x987A;&#x4E86;&#x5C31;&#x86EE;&#x597D;&#x7684;&#x4E86;&#x3002;&#x540E;&#x9762;&#x518D;&#x5F04;&#x4E2A;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x529F;&#x80FD;&#xFF0C;&#x8C8C;&#x4F3C;&#x5C31;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x4EC5;&#x9650;&#x4E8E;&#x7ED9;&#x8BFE;&#x7A0B;&#x505A;API&#x7528;&#x3002;&#x540E;&#x671F;&#x4F1A;&#x8003;&#x8651;&#x518D;&#x5199;&#x5957;&#x804A;&#x5929;&#x7684;&#x670D;&#x52A1;&#x5668;API&#x51FA;&#x6765;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x60F3;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x6C42;&#x5C31;&#x5B9E;&#x73B0;&#x4EC0;&#x4E48;API&#xFF0C;&#x591A;&#x5F00;&#x68EE;&#x3002;</p>
<p>&#x8FD9;&#x4E09;&#x5929;&#x9664;&#x4E86;&#x5403;&#x996D;&#xFF0C;&#x5176;&#x4ED6;&#x65F6;&#x95F4;&#x5C31;&#x6CA1;&#x51FA;&#x95E8;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x5B66;&#x4E60;&#xFF0C;&#x518D;&#x5C31;&#x662F;&#x51C6;&#x5907;&#x6587;&#x6848;&#xFF0C;PPT&#xFF0C;P&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x56FE;&#x3002;&#x79BB;&#x804C;&#x8FD9;&#x5927;&#x534A;&#x5E74;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x8981;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#xFF0C;&#x6162;&#x6162;&#x4E5F;&#x5C31;&#x517B;&#x6210;&#x4E60;&#x60EF;&#x4E86;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x81EA;&#x6211;&#x611F;&#x89C9;&#x826F;&#x597D;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5982;&#x4F55;<strong>&#x6301;&#x7EED;</strong>&#xFF1F;&#x5F53;&#x7136;&#x4E0D;&#x53EF;&#x80FD;&#x6301;&#x7EED;&#xFF0C;&#x518D;&#x597D;&#x5403;&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x76F4;&#x5403;&#x4E5F;&#x4F1A;&#x538C;&#xFF0C;&#x611F;&#x89C9;&#x5165;&#x95E8;&#x4E86;&#x53EF;&#x4EE5;&#x7F29;&#x77ED;&#x4E0B;&#x5B66;&#x4E60;&#x65F6;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x4E0D;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x522B;&#x505C;&#x6B62;&#x601D;&#x8003;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x529F;&#x80FD;&#x70B9;&#xFF0C;&#x4E0E;&#x4EBA;&#x8BA8;&#x8BBA;&#xFF0C;&#x603B;&#x7ED3;&#x3002;&#x8FD9;&#x4E9B;&#x53EA;&#x9700;&#x8981;&#x52A8;&#x8111;&#xFF0C;&#x4E5F;&#x4E0D;&#x5360;&#x7528;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x653E;&#x5FC3;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x53BB;&#x505A;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x4F60;&#x7684;&#x6F5C;&#x610F;&#x8BC6;&#x4E5F;&#x4F1A;&#x5E2E;&#x4F60;&#x5206;&#x6790;&#x597D;&#xFF0C;&#x7B49;&#x4F60;&#x6709;&#x65F6;&#x95F4;&#x7684;&#x65F6;&#x5019;&#x5448;&#x4E0A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7ED9;&#x4F60;&#x3002;&#x5C31;&#x50CF;&#x4F60;&#x52A0;&#x73ED;&#x5230;&#x6DF1;&#x591C;&#x90FD;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x7684;bug&#xFF0C;&#x7761;&#x4E00;&#x89C9;&#x4E5F;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x3002;</p>
<p>&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x6709;&#x6CA1;&#x53D1;&#x73B0;&#x8FC7;&#xFF0C;&#x5F53;&#x4F60;&#x5927;&#x5B66;&#x6570;&#x5B66;&#x5B66;&#x5230;&#x4E00;&#x534A;&#x65F6;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#x521D;&#x9AD8;&#x4E2D;&#x6570;&#x5B66;&#x771F;&#x7684;&#x662F;&#x592A;&#x7B80;&#x5355;&#x4E86;&#xFF0C;why&#xFF1F;&#x4F60;&#x8FD8;&#x662F;&#x4F60;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x4E00;&#x4F1A;&#x7684;&#x529F;&#x592B;&#xFF0C;&#x4EE5;&#x524D;&#x89C9;&#x5F97;&#x56F0;&#x96BE;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x53D8;&#x5F97;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x3002;&#x4E00;&#x662F;&#x65F6;&#x95F4;&#xFF0C;&#x4E8C;&#x662F;&#x4F60;&#x660E;&#x767D;&#x4E86;&#x539F;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x521D;&#x9AD8;&#x4E2D;&#x5B66;&#x7684;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x90FD;&#x662F;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#xFF0C;&#x6CA1;&#x6709;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x5B66;&#x6570;&#x5B66;&#x91CC;&#x5B66;&#x7684;&#x662F;&#x5982;&#x4F55;&#x63A8;&#x5BFC;&#xFF0C;&#x5F53;&#x4F60;&#x660E;&#x767D;&#x539F;&#x7406;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x7B80;&#x5355;&#x4E86;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6280;&#x672F;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x63A5;&#x89E6;&#x8BED;&#x6CD5;&#xFF0C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5FC5;&#x7136;&#x89C9;&#x5F97;&#x96BE;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x53C8;&#x4E0D;&#x80FD;&#x8D8A;&#x7EA7;&#x53BB;&#x770B;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#xFF0C;&#x6CA1;&#x6709;&#x57FA;&#x7840;&#x770B;&#x4E86;&#x4E5F;&#x767D;&#x770B;&#x3002;&#x5BF9;&#x4E0D;&#x3002;&#x4F60;&#x8981;&#x575A;&#x4FE1;&#xFF0C;&#x6280;&#x672F;&#x4E0D;&#x96BE;&#xFF0C;&#x53EA;&#x8981;&#x7ED9;&#x4F60;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x6C89;&#x6DC0;&#x4E0E;&#x79EF;&#x7D2F;&#xFF0C;&#x518D;&#x5230;&#x4F60;&#x62E8;&#x5F00;&#x8FF7;&#x96FE;&#x770B;&#x539F;&#x7406;&#x3002;&#x4F60;&#x81EA;&#x7136;&#x5C31;&#x6210;&#x5927;&#x795E;&#x4E86;&#x554A;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x3002;&#x522B;&#x7070;&#x5FC3;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#xFF0C;&#x5E94;&#x5F97;&#x7684;&#x81EA;&#x7136;&#x4F1A;&#x5F97;&#x5230;&#x3002;</p>
<p>&#x6269;&#x5C55;&#x9605;&#x8BFB;&#xFF1A;<a href="../how-to-keep-conscious-learning">&#x65B9;&#x6CD5;&#x8BBA;-&#x6709;&#x610F;&#x8BC6;&#x7684;&#x5B66;&#x4E60;</a></p>
<blockquote>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/android/" rel="tag">#android</a>
          
            <a href="/tags/高效学习/" rel="tag">#高效学习</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/01/how-to-keep-conscious-learning/" rel="next" title="方法论-有意识的学习">
                <i class="fa fa-chevron-left"></i> 方法论-有意识的学习
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/02/01/what-worth-to-learn/" rel="prev" title="方法论-什么值得学">
                方法论-什么值得学 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2016/02/01/how-to-keep-learning-on-new-things/"
     data-title="方法论-如何保持较高的学习热情"
     data-content=""
     data-url="http://notes.stay4it.com/2016/02/01/how-to-keep-learning-on-new-things/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/02/01/how-to-keep-learning-on-new-things/"
           data-title="方法论-如何保持较高的学习热情" data-url="http://notes.stay4it.com/2016/02/01/how-to-keep-learning-on-new-things/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">29</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">9</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">51</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/6e4c6553a7f9" target="_blank">
                  
                    <i class="fa fa-globe"></i> 简书
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/stay4it" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"stay4it-note"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  

  
  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("zG8P4e1cBLLy6DhoVe68NJqR-gzGzoHsz", "8DKIsCr0wID4auEWBv3xNV9x");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>




</body>
</html>
