<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="方法论," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x5185;&amp;#x5BB9;&amp;#x662F;Stay&amp;#x4E2A;&amp;#x4EBA;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x89C2;&amp;#x70B9;&amp;#x4E0E;&amp;#x89C1;&amp;#x89E3;&amp;#xFF0C;&amp;#x6709;&amp;#x65F6;&amp;#x5019;&amp;#x8DF3;&amp;#x51FA;&amp;#x6280;&amp;#x672F;&amp;#x6216;&amp;#x8">
<meta property="og:type" content="article">
<meta property="og:title" content="方法论-如何学习一门语言">
<meta property="og:url" content="http://notes.stay4it.com/2016/10/25/how-to-learn-a-new-language/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x5185;&amp;#x5BB9;&amp;#x662F;Stay&amp;#x4E2A;&amp;#x4EBA;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x89C2;&amp;#x70B9;&amp;#x4E0E;&amp;#x89C1;&amp;#x89E3;&amp;#xFF0C;&amp;#x6709;&amp;#x65F6;&amp;#x5019;&amp;#x8DF3;&amp;#x51FA;&amp;#x6280;&amp;#x672F;&amp;#x6216;&amp;#x8">
<meta property="og:updated_time" content="2017-03-11T12:49:42.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="方法论-如何学习一门语言">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x7BC7;&amp;#x5185;&amp;#x5BB9;&amp;#x662F;Stay&amp;#x4E2A;&amp;#x4EBA;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x89C2;&amp;#x70B9;&amp;#x4E0E;&amp;#x89C1;&amp;#x89E3;&amp;#xFF0C;&amp;#x6709;&amp;#x65F6;&amp;#x5019;&amp;#x8DF3;&amp;#x51FA;&amp;#x6280;&amp;#x672F;&amp;#x6216;&amp;#x8">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 方法论-如何学习一门语言 | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                方法论-如何学习一门语言
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-25T20:48:40+08:00" content="2016-10-25">
              2016-10-25
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/方法论/" itemprop="url" rel="index">
                    <span itemprop="name">方法论</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/10/25/how-to-learn-a-new-language/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count disqus-comment-count" data-disqus-identifier="2016/10/25/how-to-learn-a-new-language/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x672C;&#x7BC7;&#x5185;&#x5BB9;&#x662F;Stay&#x4E2A;&#x4EBA;&#x7684;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#x4E0E;&#x89C1;&#x89E3;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8DF3;&#x51FA;&#x6280;&#x672F;&#x6216;&#x8005;&#x5BFB;&#x627E;&#x5176;&#x4ED6;&#x7684;&#x89D2;&#x5EA6;&#x4F1A;&#x8BA9;&#x4EBA;&#x91CD;&#x65B0;&#x8BA4;&#x8BC6;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x3002;&#x5E0C;&#x671B;&#x80FD;&#x629B;&#x51FA;&#x4E00;&#x4E9B;&#x89D2;&#x5EA6;&#xFF0C;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x63A2;&#x8BA8;&#xFF0C;&#x7531;&#x6B64;&#x4E30;&#x5BCC;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x3002;</p>
<h3 id="&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;"><a href="#&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;" class="headerlink" title="&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;"></a>&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;</h3><p>&#x5148;&#x629B;&#x5F00;&#x6280;&#x672F;&#x8BED;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x81F3;&#x5C11;&#x4F1A;&#x4E24;&#x95E8;&#x8BED;&#x8A00;&#xFF1A;&#x2019;&#x6C49;&#x8BED;&#x2019;, &#x2018;&#x82F1;&#x8BED;&#x2019;&#x3002;<br>&#x5982;&#x4F55;&#x5FEB;&#x901F;&#x7684;&#x638C;&#x63E1;&#x8BED;&#x8A00;&#xFF1F;</p>
<p>&#x65E0;&#x75DB;&#x5B66;&#x4E60;&#x7684;&#x4E09;&#x4E2A;&#x8282;&#x70B9;&#xFF1A; <code>&#x73AF;&#x5883;</code>, <code>&#x8BCD;&#x6C47;</code>, <code>&#x5B9E;&#x8DF5;</code></p>
<p><strong>&#x73AF;&#x5883;</strong>: &#x6211;&#x60F3;&#x4E0D;&#x7528;&#x518D;&#x591A;&#x8BF4;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x770B;&#x4ECE;&#x5C0F;&#x5C31;&#x4F1A;&#x8BF4;&#x65B9;&#x8A00;&#xFF0C;&#x90A3;&#x662F;&#x5927;&#x73AF;&#x5883;&#x6240;&#x81F4;<br><strong>&#x8BCD;&#x6C47;</strong>: &#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8BCD;&#x6C47;&#x91CF;&#x662F;&#x5F88;&#x96BE;&#x9AD8;&#x6548;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x56FE;&#x3002;&#x4F46;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x662F;&#x6709;&#x610F;&#x800C;&#x4E3A;&#x4E4B;&#xFF0C;&#x80AF;&#x5B9A;&#x591A;&#x5C11;&#x6709;&#x4E9B;&#x89C4;&#x5F8B;&#x3002;&#x6C49;&#x5B57;&#x6709;&#x8C61;&#x5F62;&#xFF0C;&#x6709;&#x504F;&#x65C1;&#x90E8;&#x9996;&#x3002;&#x82F1;&#x8BED;&#x6709;&#x8BCD;&#x6839;&#xFF0C;&#x524D;&#x7F00;&#xFF0C;&#x540E;&#x7F00;&#x3002;&#x79CD;&#x79CD;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x5355;&#x5B57;&#x5355;&#x8BCD;&#x3002;&#x5047;&#x5982;&#x4F60;&#x6CA1;&#x80CC;&#x8FC7;&#x8FD9;&#x4E9B;&#xFF0C;&#x4E00;&#x76F4;&#x4EE5;&#x4E00;&#x4E2A;&#x987A;&#x5E8F;&#x53BB;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#xFF0C;&#x90A3;&#x662F;&#x76F8;&#x5F53;&#x7B28;&#x62D9;&#x7684;&#x65B9;&#x5F0F;&#x3002;<br><strong>&#x5B9E;&#x8DF5;</strong>: &#x5B9E;&#x8DF5;&#x4E5F;&#x5C31;&#x662F;&#x5229;&#x7528;&#x8BED;&#x8A00;&#x53BB;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x884C;&#x4E3A;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x957F;&#x671F;&#x81EA;&#x95ED;&#x80AF;&#x5B9A;&#x4F1A;&#x5FD8;&#x4E86;&#x5982;&#x4F55;&#x8BF4;&#x8BDD;&#x3002;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x80FD;&#x8BF4;&#x4F1A;&#x9053;&#xFF0C;&#x5199;&#x6587;&#x5F62;&#x5982;&#x6D41;&#x6C34;&#x3002;&#x6700;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x591A;&#x8BF4;&#x591A;&#x5199;&#x3002;</p>
<p>&#x5199;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x7ACB;&#x9A6C;&#x4F1A;&#x6709;<strong>&#x8D8B;&#x5229;&#x907F;&#x5BB3;</strong>&#x7684;&#x6F5C;&#x610F;&#x8BC6;&#x4EA7;&#x751F;</p>
<blockquote>
<p>&#x9053;&#x7406;&#x8C01;&#x90FD;&#x61C2;&#xFF0C;&#x8BF4;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x505A;&#x8D77;&#x6765;&#x96BE;&#x554A;&#x3002;&#x8981;&#x662F;&#x4E00;&#x4E2A;&#x6708;&#x80FD;&#x641E;&#x5B9A;&#xFF0C;&#x62FC;&#x4E86;&#x547D;&#x6211;&#x90FD;&#x4F1A;&#x53BB;&#x5B66;&#x7684;&#x3002;&#x8981;&#x4E0D;&#x4F60;&#x5148;&#x8BD5;&#x8BD5;&#x770B;&#xFF1F;</p>
</blockquote>
<p>&#x518D;&#x6765;&#x770B;&#x8FD9;&#x4E2A;&#x6897;</p>
<blockquote>
<p>&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x521D;&#x4E2D;&#x5230;&#x5927;&#x5B66;&#x5B66;&#x4E86;10&#x591A;&#x5E74;&#x7684;&#x82F1;&#x8BED;&#x90FD;&#x8FD8;&#x6709;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x5B66;&#x4E0D;&#x597D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4EBA;&#x4F1A;&#x76F8;&#x4FE1;&#x901A;&#x8FC7;&#x57F9;&#x8BAD;&#x73ED;&#x80FD;&#x591F;&#x8BA9;&#x4F60;&#x5728;&#x77ED;&#x671F;&#x5185;&#x7CBE;&#x901A;&#x4E00;&#x95E8;&#x6280;&#x672F;&#x8BED;&#x8A00;&#x5462;&#xFF1F;</p>
</blockquote>
<h3 id="&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x673A;&#x5668;&#x8BED;&#x8A00;"><a href="#&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x673A;&#x5668;&#x8BED;&#x8A00;" class="headerlink" title="&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x673A;&#x5668;&#x8BED;&#x8A00;"></a>&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x673A;&#x5668;&#x8BED;&#x8A00;</h3><p>&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#x80FD;&#x5957;&#x5230;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x4E0A;&#x5417;&#xFF1F;&#x8BD5;&#x8BD5;&#x770B;</p>
<p>&#x65E0;&#x75DB;&#x5B66;&#x4E60;&#x7684;&#x4E09;&#x4E2A;&#x8282;&#x70B9;&#xFF1A; <code>&#x7CFB;&#x7EDF;</code>(&#x73AF;&#x5883;), <code>&#x8BED;&#x6CD5;&#x4E0E;API</code>(&#x8BCD;&#x6C47;), <code>&#x7F16;&#x7801;</code>(&#x5B9E;&#x8DF5;)</p>
<p><strong>&#x7CFB;&#x7EDF;</strong>: &#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x5927;&#x53EF;&#x5C0F;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x6700;&#x5C0F;&#x4F9D;&#x8D56;&#x73AF;&#x5883;&#xFF0C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x67B6;&#x6784;&#xFF0C;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x7B49;&#x3002;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x6240;&#x4F9D;&#x6258;&#x7684;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x3002;&#x5728;&#x4EC0;&#x4E48;&#x73AF;&#x5883;&#x5199;&#x4EC0;&#x4E48;&#x4EE3;&#x7801;&#x3002;<br><strong>&#x8BED;&#x6CD5;&#x4E0E;API</strong>: &#x8BED;&#x6CD5;&#x662F;&#x6784;&#x6210;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x521D;&#x59CB;&#x5355;&#x5143;&#xFF0C;API&#x662F;&#x4E0E;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x6A21;&#x5757;&#x7B49;&#x6C9F;&#x901A;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x6CA1;&#x6709;&#x5B83;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x5B83;&#x80FD;&#x63D0;&#x4F9B;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x80FD;&#x901A;&#x8FC7;&#x5B83;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;&#x5982;&#x4F55;&#x53BB;&#x7EC4;&#x5408;&#xFF0C;&#x9020;&#x53E5;&#xFF0C;&#x901A;&#x8FC7;API&#x518D;&#x5F62;&#x6210;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;<br><strong>&#x5B9E;&#x8DF5;</strong>: &#x901A;&#x8FC7;API&#x8C03;&#x7528;&#x7EC4;&#x5408;&#x6210;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x518D;&#x5C06;&#x4EE3;&#x7801;&#x5757;&#x7EC4;&#x5408;&#x6210;&#x72EC;&#x7ACB;&#x6A21;&#x5757;&#xFF0C;&#x518D;&#x5C06;&#x529F;&#x80FD;&#x5408;&#x5E76;&#x6210;app&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x7B97;&#x5B9E;&#x8DF5;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x8BED;&#x8A00;&#x662F;&#x76F8;&#x901A;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x8BED;&#x6CD5;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5176;wrapper&#x51FA;&#x6765;&#x7684;API&#x662F;&#x5927;&#x4F53;&#x76F8;&#x4F3C;&#x7684;&#x3002;&#x5982;&#x4F55;&#x83B7;&#x5F97;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#xFF0C;&#x5982;&#x4F55;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x5982;&#x4F55;access&#x6570;&#x636E;&#x5E93;&#x7B49;&#x3002;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x533A;&#x522B;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EA;&#x8981;&#x4F60;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x5FEB;&#x901F;&#x5207;&#x6362;&#x5230;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x719F;&#x6089;&#x8BED;&#x6CD5;&#x540E;&#xFF0C;&#x76F4;&#x63A5;&#x53BB;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E0D;&#x4F1A;&#x7684;&#x518D;&#x73B0;&#x67E5;&#x3002;(&#x5C31;&#x50CF;&#x5B66;&#x4F1A;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x540C;&#x8BED;&#x7CFB;&#x7684;&#x8BED;&#x8A00;&#x5B66;&#x8D77;&#x6765;&#x4E5F;&#x633A;&#x8F7B;&#x677E;)</p>
<p>&#x4F46;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x6709;&#x6548;&#x5417;&#xFF1F;&#x5728;&#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x4E0A;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E94;&#x8BD5;&#x65B9;&#x5F0F;&#x6765;&#x586B;&#x9E2D;&#x3002;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x53EF;&#x5C31;&#x672A;&#x5FC5;&#x3002;</p>
<h3 id="&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x7684;&#x5B66;&#x4E60;&#x591F;&#x4E0D;&#x591F;"><a href="#&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x7684;&#x5B66;&#x4E60;&#x591F;&#x4E0D;&#x591F;" class="headerlink" title="&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x7684;&#x5B66;&#x4E60;&#x591F;&#x4E0D;&#x591F;"></a>&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x7684;&#x5B66;&#x4E60;&#x591F;&#x4E0D;&#x591F;</h3><p>&#x8BBE;&#x60F3;&#x4E00;&#x4E0B;&#x7528;&#x5E94;&#x8BD5;&#x6559;&#x80B2;&#x90A3;&#x4E00;&#x5957;&#x5B66;&#x4E60;Java&#x3002;<br>&#x80CC;&#x5355;&#x8BCD;(API)&#xFF0C; &#x8BB0;&#x8BCD;&#x6839;(&#x8BED;&#x6CD5;)&#xFF0C; &#x505A;&#x5377;&#x5B50;(&#x5199;&#x4EE3;&#x7801;)</p>
<p>&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5E94;&#x5BF9;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x5417;&#xFF1F;&#x663E;&#x7136;&#x4E0D;&#x80FD;&#x3002;</p>
<p>&#x5199;&#x4EE3;&#x7801;&#x4E0D;&#x662F;&#x505A;&#x9009;&#x62E9;&#x9898;&#xFF0C;&#x586B;&#x7A7A;&#x9898;&#x3002;&#x5373;&#x4F7F;&#x53EA;&#x7528;&#x5199;&#x4E00;&#x4E9B;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x8C03;&#x7528;API&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x5F53;&#x524D;&#x7684;context&#x4E0A;&#x4E0B;&#x6587;&#x91CC;&#x5904;&#x7406;&#x4E8B;&#x60C5;&#x3002;&#x8981;&#x6BD4;&#x5B66;&#x82F1;&#x8BED;&#x590D;&#x6742;&#x7684;&#x591A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7528;&#x7B28;&#x65B9;&#x6CD5;&#x6B7B;&#x8BB0;&#x786C;&#x80CC;&#x8FD8;&#x80FD;&#x8003;&#x4E2A;&#x597D;&#x6210;&#x7EE9;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5B66;&#x673A;&#x5668;&#x8BED;&#x8A00;&#xFF0C;&#x6CA1;&#x51E0;&#x5929;&#x5C31;&#x575A;&#x6301;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;(&#x6C49;&#x8BED;, &#x82F1;&#x8BED;&#x2026;)&#x548C;&#x673A;&#x5668;&#x8BED;&#x8A00;(Java, C&#x2026;)&#x533A;&#x522B;&#x8FD8;&#x662F;&#x5F88;&#x5927;&#x7684;&#x3002;</p>
<ol>
<li>&#x8BF4;&#x9519;&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x53EA;&#x8981;&#x5927;&#x610F;&#x4F20;&#x8FBE;&#x5230;&#xFF0C;&#x5BF9;&#x65B9;&#x5C31;&#x80FD;&#x505A;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x56DE;&#x5E94;&#x3002;&#x4F46;&#x673A;&#x5668;&#x8981;&#x6C42;&#x4E25;&#x82DB;&#xFF0C;&#x975E;0&#x5373;1&#x3002;&#x9519;&#x4E86;&#x5C31;&#x662F;bug&#x3002;</li>
<li>&#x8BED;&#x8A00;&#x518D;&#x600E;&#x4E48;&#x62D3;&#x5C55;&#x4E5F;&#x6709;&#x9650;&#x3002;&#x7D2F;&#x611F;&#x4E0D;&#x7231;&#xFF0C;&#x56E0;&#x5D14;&#x65AF;&#x6C40;&#xFF0C;asap&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x7F29;&#x5199;&#xFF0C;&#x54EA;&#x6709;&#x65B9;&#x6CD5;&#x6216;&#x5C01;&#x88C5;&#x7C7B;&#x5C4C;&#x3002;</li>
<li>&#x673A;&#x5668;&#x8BED;&#x8A00;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#xFF0C;input&#x8FDB;&#x53BB;&#xFF0C;output&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x7BA1;&#x6267;&#x884C;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x4F46;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x5343;&#x4E2A;&#x4EBA;&#x773C;&#x4E2D;&#x6709;&#x4E00;&#x5343;&#x4E2A;&#x54C8;&#x59C6;&#x96F7;&#x7279;&#x3002;</li>
<li>&#x673A;&#x5668;&#x8BED;&#x8A00;&#x4E0D;&#x4EC5;&#x5F97;&#x4F1A;&#x8C03;&#x7528;&#xFF0C;&#x8FD8;&#x5F97;&#x5206;&#x6790;&#xFF0C;&#x7814;&#x7A76;&#x5176;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x3002;&#x800C;&#x8BED;&#x8A00;&#x4EC5;&#x4EC5;&#x662F;&#x8C03;&#x7528;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</li>
</ol>
<p>&#x6309;&#x674E;&#x7B11;&#x6765;&#x8001;&#x5E08;&#x8BF4;&#x7684;&#xFF0C;&#x4E00;&#x5E74;&#x5373;&#x53EF;&#x5168;&#x6808;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x4FE1;&#x7684;&#x3002;&#x9664;&#x975E;-&gt; js&#x4E00;&#x7EDF;&#x5929;&#x4E0B;: )</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#x3002;&#x7A76;&#x7ADF;&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x624D;&#x662F;&#x9AD8;&#x6548;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x662F;&#x600E;&#x4E48;&#x8BA4;&#x4E3A;&#x7684;&#xFF1F;&#x4E0D;&#x59A8;&#x4E5F;&#x8BF4;&#x8BF4;&#x5427;&#xFF5E;</p>
<p>&#x672C;&#x6587;&#x4E3A;&#x5F15;&#x8A00;&#xFF0C;&#x4F1A;&#x9646;&#x7EED;&#x51FA;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x6765;&#x5C55;&#x5F00;Stay&#x7684;&#x89C2;&#x70B9;&#x3002;&#x5E0C;&#x671B;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#xFF0C;&#x5BFB;&#x627E;&#x6700;&#x4F73;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x6269;&#x5C55;&#x9605;&#x8BFB;&#xFF1A;<br><a href="http://www.jianshu.com/p/b81542987e4b" target="_blank" rel="external">&#x8FD8;&#x9700;&#x8981;&#x518D;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5417;&#xFF1F;</a><br><a href="http://www.jianshu.com/p/e6aec31e681f" target="_blank" rel="external">&#x65B9;&#x6CD5;&#x8BBA;-&#x6700;&#x5C0F;&#x53EF;&#x884C;&#x4F53;&#x7CFB;</a></p>
<blockquote>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/方法论/" rel="tag">#方法论</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/10/23/should-we-learn-another-language/" rel="next" title="还需要再学一门语言吗？">
                <i class="fa fa-chevron-left"></i> 还需要再学一门语言吗？
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/10/26/learn-a-new-language-with-minimum-essence/" rel="prev" title="方法论-最小可行体系">
                方法论-最小可行体系 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div id="disqus_thread">
        <noscript>
          Please enable JavaScript to view the
          <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a>
        </noscript>
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">37</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">10</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">54</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/6e4c6553a7f9" target="_blank">
                  
                    <i class="fa fa-globe"></i> 简书
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/stay4it" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#学习一门语言的最佳方式"><span class="nav-number">1.</span> <span class="nav-text">学习一门语言的最佳方式</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#如何学习一门机器语言"><span class="nav-number">2.</span> <span class="nav-text">如何学习一门机器语言</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#按部就班的学习够不够"><span class="nav-number">3.</span> <span class="nav-text">按部就班的学习够不够</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2016 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  

    <script type="text/javascript">
      var disqus_shortname = 'stay4it';
      var disqus_identifier = '2016/10/25/how-to-learn-a-new-language/';
      var disqus_title = '方法论-如何学习一门语言';
      var disqus_url = 'http://notes.stay4it.com/2016/10/25/how-to-learn-a-new-language/';

      function run_disqus_script(disqus_script){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/' + disqus_script;
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
      }

      run_disqus_script('count.js');
      
        run_disqus_script('embed.js');
      
    </script>
  



  
  

  
  


</body>
</html>
