<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Android, Stay" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x8FC7;&amp;#x53BB;&amp;#x4E60;&amp;#x5F97;&amp;#x7684;&amp;#x7ECF;&amp;#x9A8C;&amp;#x662F;&amp;#x73B0;&amp;#x5728;&amp;#x884C;&amp;#x4E3A;&amp;#xFF0C;&amp;#x601D;&amp;#x60F3;&amp;#x548C;&amp;#x52A8;&amp;#x673A;&amp;#x7684;&amp;#x6839;&amp;#x6E90;&amp;#x3002;

2010.9 - 2011.4&amp;#x5728">
<meta property="og:type" content="website">
<meta property="og:title" content="about">
<meta property="og:url" content="http://notes.stay4it.com/about/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x8FC7;&amp;#x53BB;&amp;#x4E60;&amp;#x5F97;&amp;#x7684;&amp;#x7ECF;&amp;#x9A8C;&amp;#x662F;&amp;#x73B0;&amp;#x5728;&amp;#x884C;&amp;#x4E3A;&amp;#xFF0C;&amp;#x601D;&amp;#x60F3;&amp;#x548C;&amp;#x52A8;&amp;#x673A;&amp;#x7684;&amp;#x6839;&amp;#x6E90;&amp;#x3002;

2010.9 - 2011.4&amp;#x5728">
<meta property="og:updated_time" content="2016-03-31T08:51:00.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="about">
<meta name="twitter:description" content="&amp;#x8FC7;&amp;#x53BB;&amp;#x4E60;&amp;#x5F97;&amp;#x7684;&amp;#x7ECF;&amp;#x9A8C;&amp;#x662F;&amp;#x73B0;&amp;#x5728;&amp;#x884C;&amp;#x4E3A;&amp;#xFF0C;&amp;#x601D;&amp;#x60F3;&amp;#x548C;&amp;#x52A8;&amp;#x673A;&amp;#x7684;&amp;#x6839;&amp;#x6E90;&amp;#x3002;

2010.9 - 2011.4&amp;#x5728">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title>
  

  
    about | Stay's Notes
  
</title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left  ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    
    
      <blockquote>
<p>&#x8FC7;&#x53BB;&#x4E60;&#x5F97;&#x7684;&#x7ECF;&#x9A8C;&#x662F;&#x73B0;&#x5728;&#x884C;&#x4E3A;&#xFF0C;&#x601D;&#x60F3;&#x548C;&#x52A8;&#x673A;&#x7684;&#x6839;&#x6E90;&#x3002;</p>
</blockquote>
<h3 id="2010-9-2011-4"><a href="#2010-9-2011-4" class="headerlink" title="2010.9 - 2011.4"></a>2010.9 - 2011.4</h3><p>&#x5728;&#x4E00;&#x5BB6;&#x4E3B;&#x505A;MTK&#x624B;&#x673A;App&#x516C;&#x53F8;&#x505A;Android&#xFF0C;&#x516C;&#x53F8;&#x4E5F;&#x662F;&#x63A2;&#x7D22;Android&#x65B9;&#x5411;&#xFF0C;&#x6240;&#x4EE5;&#x7ED9;&#x4E86;&#x6211;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x81EA;&#x5DF1;&#x8C03;&#x7814;&#x3002;&#x505A;&#x4E86;&#x4E00;&#x6B3E;&#x97F3;&#x4E50;&#x64AD;&#x653E;&#x5668;&#xFF0C;&#x4E00;&#x6B3E;&#x5C71;&#x5BE8;&#x7684;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x3002;</p>
<h3 id="2011-4-2012-8"><a href="#2011-4-2012-8" class="headerlink" title="2011.4 - 2012.8"></a>2011.4 - 2012.8</h3><p>&#x5728;&#x4E00;&#x5BB6;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x75AF;&#x72C2;9126&#x6253;&#x9E21;&#x8840;&#xFF0C;&#x505A;&#x793E;&#x4EA4;App&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EE5;&#x524D;&#x7528;&#x8FC7;&#x2019;&#x7B80;&#x7B80;&#x5355;&#x5355;&#x2019;, &#x2018;&#x725B;&#x6392;&#x2019;, &#x2018;&#x7F8E;&#x4E3D;&#x7EA6;&#x2019;, &#x90A3;&#x91CC;&#x9762;&#x5C31;&#x6709;&#x6211;&#x7684;&#x5FC3;&#x8840;&#x3002;&#x53EF;&#x60DC;&#x81A8;&#x80C0;&#x7684;&#x592A;&#x5FEB;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x6A21;&#x5757;&#x90FD;&#x5F80;&#x91CC;&#x9762;&#x6254;&#xFF0C;&#x6700;&#x75AF;&#x72C2;&#x7684;&#x65F6;&#x5019;1&#x4E2A;App&#x914D;8&#x4E2A;Android8&#x4E2A;iOS&#x3002;&#x540E;&#x6765;&#x4EBA;&#x5C31;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x8D70;&#x4E86;&#x3002;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x867D;&#x7136;&#x96BE;&#x71AC;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x5728;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x8BA9;&#x4EBA;&#x6210;&#x957F;&#x3002;&#x4E0D;&#x8BBA;&#x662F;&#x6280;&#x672F;&#x7684;&#x79EF;&#x7D2F;&#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x5BF9;&#x4EA7;&#x54C1;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x504F;&#x6267;&#x4E0A;&#xFF0C;&#x90FD;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x89C1;&#x89E3;&#x3002;</p>
<p>&#x6280;&#x672F;&#x4E00;&#x5B9A;&#x8981;&#x624E;&#x6839;&#x4E8E;&#x4E1A;&#x52A1;&#xFF0C;&#x8131;&#x79BB;&#x4E1A;&#x52A1;&#x8131;&#x79BB;&#x4EA7;&#x54C1;&#x7406;&#x5FF5;&#x8C08;&#x91CD;&#x6784;&#x662F;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x4ED6;&#x4F1A;&#x591A;&#x5C11;API&#xFF0C;&#x7528;&#x8FC7;&#x591A;&#x5C11;&#x5F00;&#x6E90;library&#x3002;&#x800C;&#x662F;&#x4ED6;&#x6709;&#x4E00;&#x79CD;&#x5224;&#x65AD;&#x529B;&#xFF0C;&#x61C2;&#x5F97;&#x53D6;&#x820D;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7684;google&#xFF0C;&#x5B9E;&#x8DF5;&#xFF0C;&#x627E;&#x5230;&#x6700;&#x4F73;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h3 id="2012-8-2014-8"><a href="#2012-8-2014-8" class="headerlink" title="2012.8 - 2014.8"></a>2012.8 - 2014.8</h3><p>&#x8FDB;&#x5916;&#x4F01;&#xFF0C;&#x603B;&#x90E8;&#x5728;&#x745E;&#x58EB;&#xFF0C;&#x505A;SAP&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x671F;&#x95F4;&#x6709;&#x5E78;&#x80FD;&#x53BB;&#x745E;&#x58EB;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x867D;&#x7136;&#x8FD8;&#x8BF7;&#x5047;&#x5230;&#x5904;&#x53BB;&#x73A9;&#x3002;&#x5916;&#x4F01;&#x8BA9;&#x6211;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x9AD8;&#x6548;&#x5F00;&#x53D1;&#x7684;&#x7A8D;&#x95E8;&#x3002;jira+splunk+confluence&#xFF0C;&#x4E00;&#x5957;&#x654F;&#x6377;&#x5DE5;&#x5177;&#x7701;&#x4E86;&#x5F88;&#x591A;&#x6C9F;&#x901A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x52A0;&#x4E0A;&#x53EA;&#x6709;Android&#x56E2;&#x961F;&#x5728;&#x4E0A;&#x6D77;&#xFF0C;&#x56E0;&#x4E3A;&#x65F6;&#x5DEE;&#x6BCF;&#x5929;&#x8981;&#x4E0B;&#x5348;4&#x70B9;&#x624D;&#x5F00;daily meeting&#x3002;&#x6240;&#x4EE5;&#x5F97;&#x63D0;&#x524D;&#x5EFA;&#x597D;ticket assign&#x7ED9;&#x76F8;&#x5173;&#x4EBA;&#x5458;&#xFF0C;&#x63CF;&#x8FF0;&#x6E05;&#x695A;issue&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x8868;&#x8FF0;&#x80FD;&#x529B;&#x660E;&#x663E;&#x5F3A;&#x591A;&#x4E86;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6709;&#x4E2A;&#x8BED;&#x901F;&#x98DE;&#x5FEB;&#x7684;&#x6CE2;&#x5170;&#x4E0A;&#x53F8;&#x5929;&#x5929;&#x8DDF;&#x4F60;&#x63CF;&#x8FF0;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x6280;&#x672F;&#x4E0A;&#x653B;&#x514B;&#x4E86;&#x4E0D;&#x5C11;&#x96BE;&#x5173;&#x3002;</p>
<ol>
<li>SAP&#x6709;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5C06;&#x90E8;&#x5206;&#x6570;&#x636E;cache&#x5728;&#x672C;&#x5730;&#xFF0C;&#x51E0;&#x767E;M&#x751A;&#x81F3;1G&#x7684;&#x6570;&#x636E;&#x653E;sqlite&#xFF0C;&#x4E00;&#x5171;76&#x5F20;&#x4E3B;&#x8868;&#xFF0C;&#x90A3;&#x4E9B;ormapping&#x6846;&#x67B6;&#x6839;&#x672C;&#x641E;&#x4E0D;&#x5B9A;&#xFF0C;&#x53EA;&#x597D;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x5957;&#x3002;</li>
<li>&#x672C;&#x5730;&#x6570;&#x636E;&#x9700;&#x8981;&#x652F;&#x6301;&#x641C;&#x7D22;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x5F20;100w&#x6570;&#x636E;&#x8868;&#xFF0C;&#x7528;sql like&#x80AF;&#x5B9A;&#x662F;&#x8981;&#x7B49;&#x5F85;&#x5F88;&#x4E45;&#x7684;&#x3002;&#x540E;&#x6765;&#x52A0;&#x4E0A;lucene&#xFF0C;&#x8FD8;&#x5F97;&#x652F;&#x6301;&#x6240;&#x6709;&#x8BED;&#x8A00;&#x641C;&#x7D22;&#xFF0C;&#x9700;&#x8981;&#x624B;&#x52A8;&#x5206;&#x8BCD;&#x3002;</li>
<li>&#x672C;&#x5730;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x6570;&#x636E;&#x540C;&#x6B65;&#xFF0C;&#x8DDF;git&#x7684;merge&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x8FD8;&#x9700;&#x8981;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x3002;</li>
<li>&#x8FD8;&#x6709;&#x5F88;&#x591A;http&#x6846;&#x67B6;&#xFF0C;UI&#x590D;&#x7528;&#x7B49;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x80FD;&#x8BA9;&#x5F00;&#x53D1;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x7684;&#x8F6E;&#x5B50;</li>
</ol>
<p>&#x90A3;&#x65F6;&#x5019;&#x8FD8;&#x6CA1;&#x6709;retrofit&#xFF0C;okhttp&#xFF0C;volley&#xFF0C;&#x6CA1;&#x6709;realm&#xFF0C;&#x6CA1;&#x6709;leakcanary&#x3002;&#x4E07;&#x4E8B;&#x90FD;&#x8981;&#x9760;&#x81EA;&#x5DF1;&#x3002;&#x4E00;&#x70B9;&#x70B9;google&#xFF0C;&#x4E00;&#x70B9;&#x70B9;&#x78E8;&#x51FA;&#x6765;&#x3002;&#x6CA1;&#x6709;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x6B64;&#x5FC5;&#x987B;&#x6DF1;&#x4FE1;&#x4E0D;&#x7591;&#x3002;&#x5047;&#x5982;&#x505A;&#x4E0D;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x90FD;&#x559C;&#x6B22;&#x63A8;&#x5378;&#x8D23;&#x4EFB;&#xFF0C;&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#x627E;&#x7406;&#x7531;&#xFF0C;&#x4EBA;&#x5C31;&#x53D8;&#x5F97;&#x6025;&#x8E81;&#xFF0C;&#x654F;&#x611F;&#xFF0C;&#x8D8A;&#x53D1;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x5019;&#x5B66;&#x4F1A;&#x4E86;&#x514B;&#x5236;&#xFF0C;&#x4E0D;&#x76F2;&#x76EE;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x5929;&#x53EA;&#x5199;3&#x5C0F;&#x65F6;&#xFF0C;&#x6700;&#x591A;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;1000&#x884C;&#x3002;&#x5199;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x50CF;&#x5199;&#x8BD7;&#xFF0C;&#x60F3;&#x597D;&#x518D;&#x5199;&#xFF0C;&#x7CBE;&#x70BC;&#xFF0C;&#x7B80;&#x77ED;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x5019;&#x5B66;&#x4F1A;&#x4E86;&#x89C4;&#x5212;&#xFF0C;&#x5199;&#x4EE3;&#x7801;&#x5C31;&#x50CF;&#x88C5;&#x4FEE;&#x6BDB;&#x576F;&#x623F;&#xFF0C;&#x5148;&#x8981;&#x719F;&#x6089;&#x623F;&#x578B;(&#x7406;&#x89E3;&#x9700;&#x6C42;)&#xFF0C;&#x8BBE;&#x8BA1;&#xFF0C;&#x6C34;&#x7535;&#x6539;&#x9020;(&#x9700;&#x6C42;&#x5206;&#x6790;&#xFF0C;&#x62C6;&#x89E3;&#xFF0C;&#x5EFA;&#x6A21;)&#xFF0C;&#x6253;&#x5B54;&#x8D70;&#x7EBF;(&#x4F2A;&#x4EE3;&#x7801;&#x4E32;&#x8D77;&#x6574;&#x4E2A;&#x903B;&#x8F91;)&#xFF0C;&#x7C89;&#x5899;(&#x6784;&#x5EFA;UI)&#xFF0C;&#x5185;&#x9970;&#x5BB6;&#x5177;(&#x5177;&#x4F53;&#x5B9E;&#x73B0;)&#x3002;&#x786E;&#x4FDD;&#x6BCF;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#x4E0D;&#x51FA;&#x7EB0;&#x6F0F;&#xFF0C;&#x5E76;&#x7559;&#x597D;&#x63A5;&#x53E3;&#xFF0C;&#x5199;&#x5B8C;&#x5C31;&#x662F;&#x6210;&#x54C1;&#xFF0C;&#x8FD8;&#x80FD;&#x4FDD;&#x8BC1;&#x4EE5;&#x540E;&#x7684;&#x9700;&#x6C42;&#x6269;&#x5C55;&#x3002;</p>
<h3 id="2014-3-&#x81F3;&#x4ECA;"><a href="#2014-3-&#x81F3;&#x4ECA;" class="headerlink" title="2014.3 - &#x81F3;&#x4ECA;"></a>2014.3 - &#x81F3;&#x4ECA;</h3><p>&#x6211;&#x5199;&#x535A;&#x5BA2;&#x7684;&#x539F;&#x5219;&#x662F;&#xFF0C;&#x53EA;&#x5265;&#x8327;&#x62BD;&#x4E1D;&#xFF0C;&#x63D0;&#x4F9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E0D;&#x7559;&#x8FC7;&#x591A;&#x4EE3;&#x7801;&#x3002;&#x4EE3;&#x7801;&#x662F;&#x6709;&#x65F6;&#x6548;&#x6027;&#x7684;&#xFF0C;&#x5728;&#x5F53;&#x65F6;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x8FC7;&#x4E00;&#x4E24;&#x5E74;&#x5C31;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6848;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E0D;&#x8FD9;&#x4E48;&#x60F3;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x4E9B;&#x6025;&#x71E5;&#xFF0C;&#x603B;&#x4EE5;&#x81EA;&#x5DF1;&#x641E;&#x4E0D;&#x5B9A;&#xFF0C;&#x52A0;&#x73ED;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x4E0D;&#x4F1A;google&#xFF0C;&#x4E0D;&#x4F1A;&#x8FFD;&#x672C;&#x6EAF;&#x6E90;&#x3002;&#x7528;&#x8FD9;&#x4E9B;&#x501F;&#x53E3;&#x4E0D;&#x81EA;&#x89C9;&#x7684;&#x65BD;&#x538B;&#x5728;&#x5176;&#x4ED6;&#x4EBA;&#x8EAB;&#x4E0A;&#xFF0C;&#x4F01;&#x56FE;&#x522B;&#x4EBA;&#x80FD;&#x591F;&#x65E0;&#x79C1;&#x7684;&#x5E2E;&#x4F60;&#x586B;&#x4E0A;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x806A;&#x660E;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x79C1;&#x4EE5;&#x4E3A;&#xFF0C;&#x6BD4;&#x8D77;&#x6280;&#x672F;&#xFF0C;&#x4E1A;&#x52A1;&#x66F4;&#x91CD;&#x8981;&#x3002;&#x6211;&#x4EEC;&#x5C11;&#x6709;&#x521B;&#x65B0;&#xFF0C;&#x5927;&#x591A;&#x7B97;&#x66F4;&#x65B0;&#xFF0C;&#x6240;&#x4EE5;&#x6240;&#x6709;&#x7684;&#x9700;&#x6C42;&#x90FD;&#x6709;&#x539F;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x5EF6;&#x4F38;&#x7684;&#x96CF;&#x5F62;&#xFF0C;&#x627E;&#x5230;&#x5B83;&#xFF0C;&#x8BD5;&#x56FE;&#x7406;&#x89E3;&#x5B83;&#x80CC;&#x540E;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8003;&#x8651;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x52A0;&#x73ED;&#xFF0C;&#x9891;&#x7E41;&#x5806;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x6CE8;&#x91CA;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x6EE1;&#x8DB3;&#x4E86;KPI&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x4E00;&#x70B9;&#x63D0;&#x5347;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x4EEC;&#x5F97;&#x7AD9;&#x7684;&#x66F4;&#x9AD8;&#x4E00;&#x4E9B;&#xFF0C;&#x601D;&#x8003;&#x4EA7;&#x54C1;&#x80CC;&#x540E;&#x7684;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#xFF0C;&#x5F53;&#x524D;&#x9700;&#x6C42;&#x7684;&#x7528;&#x610F;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x4F53;&#x73B0;&#x5B83;&#xFF0C;&#x4EE5;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x6269;&#x5C55;&#x3002;&#x7B49;&#x60F3;&#x6E05;&#x695A;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x5199;&#x4EE3;&#x7801;&#x5C31;&#x4F1A;&#x8F7B;&#x677E;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x80FD;&#x5F88;&#x5FEB;&#x8BA4;&#x8BC6;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4EBA;&#x5DE5;&#x4F5C;&#x4E09;&#x5E74;&#x8FD8;&#x662F;&#x8DDF;&#x4E00;&#x5E74;&#x4E00;&#x6837;&#x3002;&#x6240;&#x4EE5;Stay&#x51B3;&#x5B9A;&#x8DF3;&#x51FA;&#x6765;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x80FD;&#x4ECE;&#x5751;&#x91CC;&#x8DF3;&#x51FA;&#x6765;&#x3002;</p>
<p><strong><a href="http://stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;</a>&#xFF0C;&#x6709;&#x5FC3;&#x4E4B;&#x4EBA;&#x6210;&#x65E0;&#x4E8B;&#xFF0C;&#x65E0;&#x5FC3;&#x4E4B;&#x4EBA;&#x4E8B;&#x65E0;&#x6210;&#x3002;</strong></p>
<p>&#x6280;&#x672F;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x53EF;&#x8BB2;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6280;&#x672F;&#x4E5F;&#x4F1A;&#x9646;&#x7EED;&#x88AB;&#x6DD8;&#x6C70;&#x3002;&#x4EC0;&#x4E48;&#x80FD;&#x6210;&#x4E3A;&#x7ECF;&#x5178;&#xFF1F;&#x6211;&#x60F3;&#x5E94;&#x8BE5;&#x662F;&#x90A3;&#x6280;&#x672F;&#x4E4B;&#x4E0A;&#x7684;WWHW&#x3002;</p>
<blockquote>
<p>WHAT WHEN WHY HOW</p>
<p>&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x5728;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#x4E0B;&#x53D1;&#x751F;&#xFF1F;&#x5B83;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#xFF1F;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x7684;&#xFF1F;</p>
</blockquote>
<p>&#x5047;&#x5982;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x8BFE;&#x7A0B;&#x5E94;&#x8BE5;&#x662F;&#x5C06;&#x5927;&#x5BB6;&#x5E26;&#x5165;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x9700;&#x6C42;&#x5206;&#x6790;&#xFF0C;&#x539F;&#x7406;&#x89E3;&#x5256;&#xFF0C;&#x6846;&#x67B6;&#x8BBE;&#x8BA1;&#xFF0C;&#x9010;&#x6B65;&#x4F18;&#x5316;&#xFF0C;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x89E3;&#x9898;&#x8FC7;&#x7A0B;&#x6765;&#x5F3A;&#x5316;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x5C3D;&#x91CF;&#x4E0D;&#x53BB;&#x8BB2;&#x90A3;&#x4E9B;&#x7B80;&#x5355;&#x7684;API&#x8C03;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x8BB2;&#x8FC7;&#x53BB;&#x81EA;&#x5DF1;&#x601D;&#x8003;&#x7684;&#x7ECF;&#x9A8C;&#x5FC3;&#x5F97;&#x3002;HTTP&#x6846;&#x67B6;&#xFF0C;DB&#x6846;&#x67B6;&#xFF0C;&#x5FEB;&#x901F;&#x642D;&#x5EFA;&#x9879;&#x76EE;&#xFF0C;&#x591A;&#x4EFB;&#x52A1;&#x4E0B;&#x8F7D;&#x6846;&#x67B6;&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;View&#x3002;&#x8BB2;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x73B0;&#x6210;&#x7684;&#x6846;&#x67B6;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x662F;&#x4F20;&#x9012;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x57F9;&#x8BAD;&#x505A;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;&#x4E24;&#x5E74;&#x4E86;&#xFF0C;&#x4E24;&#x5E74;&#x65F6;&#x95F4;&#x53EA;&#x505A;&#x4E86;&#x4E03;&#x4E2A;&#x8BFE;&#x7A0B;&#xFF0C;&#x6211;&#x8FD9;&#x4EBA;&#x6709;&#x4E2A;&#x6BDB;&#x75C5;&#xFF0C;&#x8001;&#x7231;&#x91CD;&#x6784;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BFE;&#x7A0B;&#x90FD;&#x88AB;&#x6211;&#x91CD;&#x5F55;&#x4E86;&#x4E24;&#x904D;&#xFF0C;&#x751A;&#x81F3;&#x4E09;&#x904D;&#x3002;&#x4EE5;&#x540E;&#x8FD8;&#x53EF;&#x80FD;&#x56DB;&#x904D;&#xFF0C;&#x4E94;&#x904D;&#x3002;&#x6BCF;&#x4E00;&#x6B21;&#x91CD;&#x6784;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x611F;&#x609F;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x611F;&#x609F;&#x4E5F;&#x80FD;&#x987A;&#x5229;&#x7684;&#x4F20;&#x9012;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x8BFE;&#x7A0B;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x7ACB;&#x9A6C;&#x5347;&#x804C;&#x52A0;&#x85AA;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x5F3A;&#x5316;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x7ED9;&#x4E88;&#x4F60;&#x60CA;&#x559C;&#x3002;&#x4F60;&#x4E0D;&#x4F1A;&#x4EC5;&#x4EC5;&#x6EE1;&#x8DB3;&#x4E8E;&#x4F1A;android&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4EC5;&#x4EC5;&#x6EE1;&#x8DB3;&#x4E8E;&#x505A;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x5148;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x7F29;&#x77ED;&#x67AF;&#x71E5;&#x7F16;&#x7801;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x7CBE;&#x5F69;&#x7684;&#x672A;&#x6765;&#x624D;&#x662F;&#x6700;&#x503C;&#x5F97;&#x671F;&#x5F85;&#x7684;&#x3002;</p>
<h3 id="2015-10-&#x81F3;&#x4ECA;"><a href="#2015-10-&#x81F3;&#x4ECA;" class="headerlink" title="2015.10 - &#x81F3;&#x4ECA;"></a>2015.10 - &#x81F3;&#x4ECA;</h3><p>&#x4E00;&#x5207;&#x53C8;&#x8981;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x591A;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#xFF0C;&#x4E00;&#x5E74;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x5C1D;&#x8BD5;&#x5168;&#x804C;&#x505A;<em>&#x6709;&#x5FC3;&#x8BFE;&#x5802;</em>&#xFF0C;&#x4F46;&#x7ED3;&#x679C;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7406;&#x60F3;&#xFF0C;&#x800C;&#x6211;&#x4E2A;&#x4EBA;&#x53C8;&#x4E0D;&#x4F1A;&#x63A8;&#x5E7F;&#xFF0C;&#x603B;&#x89C9;&#x5F97;&#x8BFE;&#x7A0B;&#x505A;&#x7684;&#x8FD8;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x8FD8;&#x8FBE;&#x4E0D;&#x5230;&#x63A8;&#x5E7F;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#xFF0C;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x4E5F;&#x5FEB;&#x6CA1;&#x4FE1;&#x5FC3;&#x4E86;&#xFF0C;&#x5728;&#x8D44;&#x91D1;&#x65B9;&#x9762;&#x4E5F;&#x65E0;&#x4EE5;&#x4E3A;&#x7EE7;&#x3002;&#x53EA;&#x597D;&#x518D;&#x91CD;&#x65B0;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x5FC3;&#x8BFE;&#x5802;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x653E;&#x5F03;&#xFF0C;&#x6211;&#x662F;&#x5C1D;&#x8BD5;&#x8FC7;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#x53BB;&#x517B;&#x6D3B;&#x5B83;&#xFF0C;&#x90A3;&#x4E00;&#x5E74;&#x505A;&#x8FC7;&#x4F01;&#x4E1A;&#x57F9;&#x8BAD;&#xFF0C;&#x5C1D;&#x8BD5;&#x8FC7;&#x7EBF;&#x4E0B;&#x57F9;&#x8BAD;&#xFF0C;&#x6363;&#x9F13;&#x8FC7;&#x4F17;&#x7B79;&#x3002;&#x4F46;&#x603B;&#x662F;&#x8BA9;&#x81EA;&#x5DF1;&#x9677;&#x5165;&#x7EA0;&#x7ED3;&#x7684;&#x81EA;&#x6211;&#x62C9;&#x626F;&#x4E2D;&#x3002;2&#x5E74;&#x65F6;&#x95F4;&#xFF0C;200&#x4F4D;&#x4ED8;&#x8D39;&#x7528;&#x6237;&#xFF0C;&#x603B;&#x8425;&#x6536;15w&#xFF0C;&#x6210;&#x672C;&#x5F00;&#x652F;5w&#xFF0C;&#x4EBA;&#x529B;&#x6210;&#x672C;&#x4E0D;&#x8BA1;&#xFF0C;&#x8FB9;&#x9645;&#x6210;&#x672C;&#x4E0D;&#x8BA1;&#x3002;&#x8FD9;&#x6570;&#x636E;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x770B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x6084;&#x6084;&#x7684;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x76EE;&#x524D;&#x5728;&#x4E0A;&#x6D77;&#x4E00;&#x5BB6;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x505A;UBI&#x8F66;&#x9669;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x5206;&#x6790;&#x8F66;&#x4E3B;&#x7684;&#x9A7E;&#x9A76;&#x4E60;&#x60EF;&#xFF0C;&#x9884;&#x5224;&#x4E0B;&#x4E00;&#x5E74;&#x51FA;&#x9669;&#x6B21;&#x6570;&#xFF0C;&#x5BF9;&#x597D;&#x8F66;&#x4E3B;&#x51CF;&#x8FD4;&#x4E00;&#x90E8;&#x5206;&#x8F66;&#x9669;&#x8D39;&#x7528;&#x3002;&#x91CD;&#x65B0;&#x6295;&#x5165;&#x5230;&#x5DE5;&#x4F5C;&#xFF0C;&#x52A0;&#x5165;&#x5230;&#x56E2;&#x961F;&#xFF0C;&#x6DF1;&#x523B;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x8BE5;&#x90A3;&#x4E48;&#x6267;&#x610F;&#x7684;&#x53BB;&#x5B64;&#x519B;&#x594B;&#x6218;&#x3002;&#x6CA1;&#x4EBA;&#x548C;&#x4F60;&#x627F;&#x62C5;&#x82E6;&#x96BE;&#xFF0C;&#x6CA1;&#x4EBA;&#x548C;&#x4F60;&#x5206;&#x4EAB;&#x559C;&#x60A6;&#x3002;&#x90A3;&#x662F;&#x591A;&#x60B2;&#x54C0;&#x7684;&#x4E8B;&#x3002;</p>
<h3 id="2016&#xFF0C;&#x4E00;&#x5207;&#x7167;&#x65E7;&#x3002;"><a href="#2016&#xFF0C;&#x4E00;&#x5207;&#x7167;&#x65E7;&#x3002;" class="headerlink" title="2016&#xFF0C;&#x4E00;&#x5207;&#x7167;&#x65E7;&#x3002;"></a>2016&#xFF0C;&#x4E00;&#x5207;&#x7167;&#x65E7;&#x3002;</h3><p>&#x6709;&#x5FC3;&#x8BFE;&#x5802;&#xFF0C;&#x5728;&#x6211;&#x6CA1;&#x627E;&#x5230;&#x66F4;&#x597D;&#x7684;&#x76EE;&#x6807;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4F1A;&#x6301;&#x7EED;&#x7684;&#x53BB;&#x505A;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4E0D;&#x8D5A;&#x94B1;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x5F71;&#x54CD;&#x7684;&#x4EBA;&#x6709;&#x9650;&#x3002;&#x6211;&#x6DF1;&#x4FE1;&#x5B83;&#x4F20;&#x9012;&#x7ED9;&#x5927;&#x5BB6;&#x7684;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#x3002;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#x3002;</p>

    
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="about/index.html"
           data-title="about" data-url="http://notes.stay4it.com/about/index.html">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel  sidebar-panel-active ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">20</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">8</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">38</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"stay4it-note"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  

  
  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("zG8P4e1cBLLy6DhoVe68NJqR-gzGzoHsz", "8DKIsCr0wID4auEWBv3xNV9x");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>




</body>
</html>
