<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Android,程序猿,创业," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x9AD8;&amp;#x85AA;&amp;#x7684;android&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x6211;&amp;#x5728;2015&amp;#x5E74;&amp;#x4E8F;&amp;#x4E86;30w&amp;#x3002;&amp;#x4E0D;&amp;#x7BA1;&amp;#x4F60;&amp;#x4FE1;&amp;#x4E0D;&amp;#x4FE1;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="作为一个程序员，我是如何一年亏掉30w的">
<meta property="og:url" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x9AD8;&amp;#x85AA;&amp;#x7684;android&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x6211;&amp;#x5728;2015&amp;#x5E74;&amp;#x4E8F;&amp;#x4E86;30w&amp;#x3002;&amp;#x4E0D;&amp;#x7BA1;&amp;#x4F60;&amp;#x4FE1;&amp;#x4E0D;&amp;#x4FE1;&amp;#">
<meta property="og:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure01.png">
<meta property="og:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure00.png">
<meta property="og:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure02.png">
<meta property="og:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure03.png">
<meta property="og:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure04.png">
<meta property="og:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure05.png">
<meta property="og:updated_time" content="2016-05-01T04:20:24.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="作为一个程序员，我是如何一年亏掉30w的">
<meta name="twitter:description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;&amp;#x9AD8;&amp;#x85AA;&amp;#x7684;android&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x6211;&amp;#x5728;2015&amp;#x5E74;&amp;#x4E8F;&amp;#x4E86;30w&amp;#x3002;&amp;#x4E0D;&amp;#x7BA1;&amp;#x4F60;&amp;#x4FE1;&amp;#x4E0D;&amp;#x4FE1;&amp;#">
<meta name="twitter:image" content="http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/failure01.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 作为一个程序员，我是如何一年亏掉30w的 | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                作为一个程序员，我是如何一年亏掉30w的
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-04-17T19:50:12+08:00" content="2016-04-17">
              2016-04-17
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经验之谈/" itemprop="url" rel="index">
                    <span itemprop="name">经验之谈</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/04/17/how-i-lose-300000-in-one-year/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count disqus-comment-count" data-disqus-identifier="2016/04/17/how-i-lose-300000-in-one-year/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9AD8;&#x85AA;&#x7684;android&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6211;&#x5728;2015&#x5E74;&#x4E8F;&#x4E86;30w&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x4FE1;&#x4E0D;&#x4FE1;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x771F;&#x4E8B;&#x513F;&#x3002;&#x6211;&#x4E5F;&#x6253;&#x7B97;&#x548C;&#x4F60;&#x8BF4;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x4E8F;&#x7684;&#x5212;&#x4E0D;&#x5212;&#x5F97;&#x7740;&#x3002;</p>
<h3 id="&#x4E00;&#x53F6;&#x969C;&#x76EE;&#xFF0C;&#x8BEF;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x4E86;G&#x70B9;"><a href="#&#x4E00;&#x53F6;&#x969C;&#x76EE;&#xFF0C;&#x8BEF;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x4E86;G&#x70B9;" class="headerlink" title="&#x4E00;&#x53F6;&#x969C;&#x76EE;&#xFF0C;&#x8BEF;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x4E86;G&#x70B9;"></a>&#x4E00;&#x53F6;&#x969C;&#x76EE;&#xFF0C;&#x8BEF;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x4E86;G&#x70B9;</h3><p>&#x4E8B;&#x60C5;&#x8FD8;&#x8981;&#x56DE;&#x5230;2&#x5E74;&#x524D;&#xFF0C;&#x4ECE;&#x6211;&#x5728;&#x4F20;&#x8BFE;&#x4E0A;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x5B66;&#x6821;&#x90A3;&#x4E00;&#x5929;&#x7B97;&#x8D77;&#x3002;</p>
<a id="more"></a>
<img src="/2016/04/17/how-i-lose-300000-in-one-year/failure01.png" alt="failure01.png" title="">
<p>&#x5F53;&#x65F6;&#x6211;&#x8FD8;&#x5728;&#x5916;&#x4F01;<a href="https://www.linkedin.com/in/stayzhang" target="_blank" rel="external">coresystems</a>&#xFF0C;&#x4E00;&#x5BB6;&#x505A;SAP&#x7684;&#x745E;&#x58EB;&#x516C;&#x53F8;&#xFF0C;&#x4E0A;&#x6D77;&#x53EA;&#x6709;sales&#x548C;android&#x90E8;&#x95E8;&#x3002;&#x751F;&#x6D3B;&#x4E0D;&#x8981;&#x592A;&#x6ECB;&#x6DA6;&#xFF0C;&#x4E24;&#x5E74;&#x65F6;&#x95F4;&#x6CA1;&#x52A0;&#x8FC7;&#x73ED;&#xFF0C;20&#x5929;&#x5E74;&#x5047;&#xFF0C;&#x8FD8;&#x514D;&#x8D39;&#x6765;&#x4E86;&#x4E00;&#x8D9F;&#x6B27;&#x6D32;&#x6E38;&#x3002;&#x4F46;&#x6211;&#x662F;&#x4E2A;&#x7231;&#x6298;&#x817E;&#x7684;&#x4EBA;&#x554A;&#xFF0C;&#x8FD9;&#x4E48;&#x88AB;&#x4E07;&#x6076;&#x7684;&#x8D44;&#x672C;&#x4E3B;&#x4E49;&#x5236;&#x5EA6;&#x4E0B;&#x7684;&#x516C;&#x53F8;&#x8150;&#x8680;&#xFF0C;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x666E;&#x904D;developer&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x7684;&#x8DEF;&#x3002;&#x505A;&#x57F9;&#x8BAD;&#x3002;</p>
<p>&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x7EBF;&#x4E0A;&#x6559;&#x80B2;&#x6B63;&#x706B;&#xFF0C;&#x6781;&#x5BA2;&#x5B66;&#x9662;&#xFF0C;&#x6155;&#x8BFE;&#x624D;&#x521A;&#x521A;&#x8FD0;&#x4F5C;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x81EA;&#x5DF1;&#x505A;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8BE5;&#x6362;&#x4E2A;&#x89D2;&#x5EA6;&#x5207;&#x5165;&#x5462;&#xFF1F;&#x5F53;&#x65F6;&#x6211;&#x7684;<a href="cnblogs.com/stay">&#x535A;&#x5BA2;</a>pv&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x5BFC;&#x4E86;&#x4E0D;&#x5C11;QQ&#x6D41;&#x91CF;&#x3002;&#x6211;&#x53D1;&#x73B0;&#x5927;&#x90E8;&#x5206;&#x6280;&#x672F;&#x4E0D;&#x597D;&#x7684;&#x4EBA;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x901A;&#x75C5;&#x3002;&#x95EE;&#x95EE;&#x9898;&#x7684;&#x59FF;&#x52BF;&#x4E0D;&#x5BF9;&#xFF0C;&#x4E0D;&#x4F1A;&#x641C;&#x7D22;&#xFF0C;<strong>&#x6700;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x3002;</strong>&#x4E8E;&#x662F;&#x6211;&#x601D;&#x5982;&#x6CC9;&#x6D8C;&#x822C;&#x7684;&#x5F00;&#x59CB;&#x7B56;&#x5212;&#x6587;&#x6848;&#xFF0C;&#x5907;&#x8BFE;&#xFF0C;&#x5F55;&#x89C6;&#x9891;&#x3002;&#x5E76;&#x4E14;&#x5728;&#x6211;&#x4E2A;&#x4EBA;&#x7EF4;&#x62A4;&#x7684;QQ&#x7FA4;&#x91CC;&#x63A8;&#x4E86;&#x4E00;&#x628A;&#x3002;&#x771F;&#x6709;&#x4EBA;&#x4E70;&#x3002;&#x4E00;&#x5468;&#x5356;&#x6389;100&#x4EFD;&#x3002;&#x90A3;&#x65F6;&#x4FE1;&#x5FC3;&#x7206;&#x68DA;&#xFF0C;&#x771F;&#x4EE5;&#x4E3A;&#x80FD;&#x4E0A;&#x5929;&#x4E86;&#x3002;</p>
<img src="/2016/04/17/how-i-lose-300000-in-one-year/failure00.png" alt="failure00.png" title="">
<p>&#x90A3;&#x65F6;&#x5019;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#x7684;&#x9879;&#x76EE;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x5C0F;&#x578B;CRM&#xFF0C;&#x6709;&#x591A;&#x8FBE;500M&#x7684;&#x6570;&#x636E;&#xFF0C;76&#x5F20;&#x4E3B;&#x8868;&#xFF0C;&#x8D3C;&#x591A;&#x5173;&#x8054;&#x5173;&#x7CFB;&#x3002;&#x90A3;&#x4E9B;&#x5F00;&#x6E90;&#x6570;&#x636E;&#x5E93;&#x6846;&#x67B6;&#x7528;&#x4E0D;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x652F;&#x6301;&#x6A21;&#x7CCA;&#x641C;&#x7D22;&#x3002;&#x6240;&#x4EE5;&#x90A3;&#x65F6;&#x5019;&#x81EA;&#x5DF1;&#x5199;&#x4E86;&#x5F88;&#x591A;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x7684;&#x6846;&#x67B6;&#x8BFE;&#x7A0B;&#x57FA;&#x672C;&#x90FD;&#x51FA;&#x81EA;&#x8FD9;&#x91CC;&#x3002;&#x6BD4;&#x5982;&#x6570;&#x636E;&#x5E93;&#x6846;&#x67B6;(&#x53CD;&#x5C04;+aspectj+lucene)&#xFF0C;http&#x6846;&#x67B6;&#xFF0C;&#x591A;&#x4EFB;&#x52A1;&#x4E0B;&#x8F7D;&#x6846;&#x67B6;&#x3002;&#x5F53;&#x65F6;&#x501F;&#x9274;&#x4E86;&#x5F88;&#x591A;&#x56FD;&#x5185;&#x5916;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5F00;&#x6E90;libs&#xFF0C;&#x4EE5;&#x53CA;&#x8001;&#x5916;&#x4E0A;&#x53F8;&#x7684;&#x6307;&#x5BFC;&#xFF0C;&#x8BA9;&#x6211;&#x8FDB;&#x6B65;&#x7684;&#x5F88;&#x5FEB;&#x3002;&#x8FD8;&#x6709;&#x4EE5;&#x524D;&#x516C;&#x53F8;&#x540C;&#x4E8B;&#x521B;&#x4E1A;&#xFF0C;&#x8BA9;&#x6211;&#x517C;&#x4E86;&#x6BB5;&#x65F6;&#x95F4;&#x6280;&#x672F;&#x987E;&#x95EE;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x7684;&#x6C89;&#x6DC0;&#x4E5F;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x60F3;&#x8981;&#x6210;&#x957F;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8C03;&#x7528;API&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x601D;&#x8003;&#xFF0C;&#x8FD8;&#x9700;&#x5B66;&#x4F1A;&#x5199;API&#x4F9B;&#x5176;&#x4ED6;&#x4EBA;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x60F3;&#xFF0C;&#x66F4;&#x52A0;&#x89C9;&#x5F97;&#xFF0C;&#x505A;&#x8FDB;&#x9636;&#x8BFE;&#x7A0B;&#xFF0C;&#x6559;&#x4EBA;&#x4EE5;&#x6E14;&#x6709;&#x610F;&#x4E49;&#x7684;&#x591A;&#x3002;</p>
<h3 id="&#x6700;&#x53EF;&#x6015;&#x7684;&#x81EA;high"><a href="#&#x6700;&#x53EF;&#x6015;&#x7684;&#x81EA;high" class="headerlink" title="&#x6700;&#x53EF;&#x6015;&#x7684;&#x81EA;high"></a>&#x6700;&#x53EF;&#x6015;&#x7684;&#x81EA;high</h3><p>&#x5927;&#x6982;&#x534A;&#x5E74;&#x65F6;&#x95F4;&#xFF0C;&#x9646;&#x7EED;&#x51FA;&#x4E86;5&#xFF0C;6&#x4E2A;&#x8BFE;&#x7A0B;&#x3002;&#x5728;2014&#x5E74;&#xFF0C;&#x4E0D;&#x5938;&#x5F20;&#x7684;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x627E;&#x4E0D;&#x5230;&#x6BD4;&#x6211;&#x7684;&#x8BFE;&#x7A0B;&#x5185;&#x5BB9;&#x8FD8;&#x725B;&#x903C;&#x7684;&#x4E86;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6CA1;&#x6709;rxjava&#xFF0C;retrofit&#xFF0C;realm&#xFF0C;databinding&#x3002;&#x53EF;&#x60DC;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7684;&#x5B9A;&#x4EF7;&#x7B56;&#x7565;&#x4EE5;&#x53CA;&#x514D;&#x8D39;&#x8BFE;&#x7A0B;&#x7684;&#x51B2;&#x51FB;&#xFF0C;&#x8FD8;&#x6709;&#x6211;&#x5BF9;&#x5E02;&#x573A;&#x53D7;&#x4F17;&#x7684;&#x8BEF;&#x5224;&#x3002;&#x5BFC;&#x81F4;&#x6211;&#x7684;&#x8BFE;&#x7A0B;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x88AB;&#x5927;&#x8303;&#x56F4;&#x4F20;&#x9605;&#x3002;&#x5355;&#x7EAF;&#x7684;&#x6211;&#x8FD8;&#x6DF1;&#x4FE1;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x6211;&#x7684;&#x8BFE;&#x7A0B;&#x505A;&#x7684;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x4E0D;&#x7136;&#x5B83;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x88AB;&#x5927;&#x5BB6;&#x8BA4;&#x53EF;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x5BB6;&#x90FD;&#x4F1A;&#x5E2E;&#x6211;&#x5206;&#x4EAB;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x5728;2014&#x5E74;8&#x6708;&#xFF0C;&#x6211;&#x505A;&#x4E86;<strong>&#x7B2C;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x51B3;&#x5B9A;</strong>&#xFF0C;&#x63D0;&#x51FA;&#x8981;&#x79BB;&#x804C;&#x5168;&#x804C;&#x505A;&#x7EBF;&#x4E0A;&#x6559;&#x80B2;&#x3002;</p>
<img src="/2016/04/17/how-i-lose-300000-in-one-year/failure02.png" alt="failure02.png" title="">
<p>&#x5F53;&#x521D;&#x8981;&#x79BB;&#x804C;&#xFF0C;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x592A;&#x628A;&#x7EBF;&#x4E0A;&#x6559;&#x80B2;&#x5F53;&#x56DE;&#x4E8B;&#xFF0C;&#x89C9;&#x5F97;&#x5373;&#x4F7F;&#x505A;&#x4E0D;&#x6210;&#xFF0C;&#x8FD8;&#x80FD;&#x5F71;&#x54CD;&#x4E00;&#x4E9B;&#x4EBA;&#xFF0C;&#x5E2E;&#x52A9;&#x4E00;&#x4E9B;&#x4EBA;&#x554A;&#x3002;&#x800C;&#x4E14;&#x4EBA;&#x751F;&#x603B;&#x8981;&#x7ECF;&#x5386;&#x8FD9;&#x4E48;&#x4E00;&#x6B21;&#x5427;&#xFF0C;&#x65E9;&#x4E00;&#x70B9;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#x5417;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x8FD9;&#x4E48;&#x4E00;&#x672C;&#x6B63;&#x7ECF;&#x7684;&#x8F9E;&#x804C;&#x4E86;&#x3002;</p>
<h3 id="&#x575A;&#x6301;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x56DE;&#x62A5;&#x5417;"><a href="#&#x575A;&#x6301;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x56DE;&#x62A5;&#x5417;" class="headerlink" title="&#x575A;&#x6301;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x56DE;&#x62A5;&#x5417;"></a>&#x575A;&#x6301;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x56DE;&#x62A5;&#x5417;</h3><p>&#x6CA1;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x6536;&#x5165;&#x6765;&#x6E90;&#xFF0C;&#x4EBA;&#x5C31;&#x4F1A;&#x6CA1;&#x6709;&#x5B89;&#x5168;&#x611F;&#x3002;&#x6211;&#x771F;&#x5B9E;&#x7684;&#x4F53;&#x4F1A;&#x5230;&#x4E86;&#x3002;&#x63A5;&#x4E0B;&#x6765;<strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x9519;&#x8BEF;&#x51B3;&#x5B9A;</strong>&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x4E0B;&#x529F;&#x592B;&#x53BB;&#x505A;&#x63A8;&#x5E7F;&#xFF0C;&#x4E00;&#x95E8;&#x5FC3;&#x601D;&#x7684;&#x60F3;&#x628A;&#x8BFE;&#x7A0B;&#x505A;&#x597D;&#x3002;&#x5927;&#x5BB6;&#x73B0;&#x5728;&#x770B;&#x5230;&#x7684;<a href="http://stay4it/com" target="_blank" rel="external">&#x6211;&#x7684;&#x8BFE;&#x7A0B;</a>&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x6211;&#x6574;&#x4F53;&#x91CD;&#x5F55;&#x4E86;2&#x6B21;&#xFF0C;&#x751A;&#x81F3;3&#x6B21;&#x7684;&#x3002;&#x6211;&#x82B1;&#x4E86;&#x592A;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x5728;&#x91CD;&#x6784;&#x4E0A;&#xFF0C;&#x5FFD;&#x7565;&#x4E86;&#x65B0;&#x6280;&#x672F;&#x7684;&#x8DDF;&#x8FDB;&#x3002;</p>
<p>&#x671F;&#x95F4;&#x9664;&#x4E86;&#x6CA1;&#x63A8;&#x5E7F;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x53D8;&#x73B0;&#x65B9;&#x5F0F;&#x90FD;&#x7B80;&#x5355;&#x7684;&#x5C1D;&#x8BD5;&#x4E86;&#x3002;&#x53BB;&#x5317;&#x4EAC;&#x505A;&#x8FC7;&#x7EBF;&#x4E0B;&#x4F01;&#x4E1A;&#x57F9;&#x8BAD;&#x3002;&#x50BB;&#x4E4E;&#x4E4E;&#x7684;&#x542C;&#x4FE1;&#x4E86;&#x670B;&#x53CB;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x8DD1;&#x5230;&#x6606;&#x660E;&#x5927;&#x5B66;&#x57CE;&#x5F04;&#x7EBF;&#x4E0B;&#x57F9;&#x8BAD;&#x3002;&#x9879;&#x76EE;&#x8BFE;&#x7A0B;&#x4F17;&#x7B79;&#x5148;&#x4ED8;&#x6B3E;&#x540E;&#x5F55;&#x8BFE;&#x3002;&#x505A;&#x8FDC;&#x7A0B;&#x6280;&#x672F;&#x987E;&#x95EE;&#x3002;&#x90FD;&#x6D45;&#x5C1D;&#x8F84;&#x6B62;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x7ED9;&#x81EA;&#x5DF1;&#x4E0D;&#x63A8;&#x5E7F;&#x7684;&#x7406;&#x7531;&#x662F;&#x8BFE;&#x7A0B;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x592A;&#x8FC7;&#x5185;&#x655B;&#xFF0C;&#x592A;&#x8981;&#x9762;&#x5B50;&#x3002;&#x9664;&#x4E86;&#x78B0;&#x5230;&#x5B66;&#x751F;&#x4F1A;&#x4F18;&#x60E0;&#xFF0C;&#x57FA;&#x672C;&#x6CA1;&#x505A;&#x6253;&#x6298;&#x4F18;&#x60E0;&#x3002;&#x9664;&#x4E86;&#x4F17;&#x7B79;&#x9879;&#x76EE;&#x8BFE;&#x7A0B;&#x65F6;&#x4E00;&#x4E2A;&#x6708;&#x6536;&#x5165;3w&#x4EE5;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x65F6;&#x95F4;&#x90FD;&#x662F;2000&#x5230;3000.</p>
<p>&#x8D8A;&#x662F;&#x4E0D;&#x505A;&#x63A8;&#x5E7F;&#xFF0C;&#x8D8A;&#x662F;&#x6CA1;&#x6709;&#x8F6C;&#x5316;&#x7387;&#xFF0C;&#x6CA1;&#x6709;&#x6536;&#x5165;&#xFF0C;&#x4EBA;&#x7684;&#x4FE1;&#x5FC3;&#x4E5F;&#x5728;&#x88AB;&#x73B0;&#x5B9E;&#x4E00;&#x70B9;&#x70B9;&#x541E;&#x566C;&#x3002;&#x4E0D;&#x65AD;&#x7684;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD9;&#x6837;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x5230;&#x5E95;&#x5BF9;&#x4E0D;&#x5BF9;&#xFF0C;&#x5168;&#x804C;&#x505A;&#x4E86;&#x4E00;&#x5E74;&#xFF0C;&#x6CA1;&#x6709;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x8FC7;&#x5047;&#xFF0C;&#x6BCF;&#x5929;&#x5C31;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x623F;&#x95F4;&#x4E00;&#x904D;&#x904D;&#x7684;&#x7EC3;&#x4E60;&#x8BB2;&#x8BFE;&#x65B9;&#x5F0F;&#xFF0C;&#x5907;&#x8BFE;&#xFF0C;&#x526A;&#x8F91;&#xFF0C;&#x4E00;&#x8282;15&#x5206;&#x949F;&#x5DE6;&#x53F3;&#x7684;&#x8BFE;&#xFF0C;&#x6210;&#x672C;&#x5927;&#x6982;&#x5728;4&#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x8FD9;&#x6BD4;&#x5199;&#x6587;&#x7AE0;&#x8981;&#x96BE;&#x7684;&#x591A;&#xFF0C;&#x4E5F;&#x6BD4;&#x90A3;&#x4E9B;API&#x89C6;&#x9891;&#x8BFE;&#x7A0B;&#x8981;&#x96BE;&#x7684;&#x591A;&#x3002;&#x6709;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5C01;&#x88C5;&#x601D;&#x60F3;&#x5F88;&#x96BE;&#x53BB;&#x63CF;&#x8FF0;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x73B0;&#x5B9E;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x53BB;&#x5206;&#x6790;&#xFF0C;&#x53BB;&#x627E;&#x5230;&#x80CC;&#x540E;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x53BB;&#x89E3;&#x91CA;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;API&#x89C6;&#x9891;&#x8BFE;&#x7A0B;&#x53EA;&#x6559;&#x4F60;&#x5982;&#x679C;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;API&#xFF0C;&#x800C;&#x6211;&#x7684;&#x8BFE;&#x7A0B;&#x60F3;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x5982;&#x4F55;&#x5206;&#x6790;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x4F55;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x53BB;&#x505A;&#x5C01;&#x88C5;&#xFF0C;&#x89E3;&#x8026;&#x3002;&#x8FD8;&#x8981;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x4E3E;&#x4E00;&#x53CD;&#x4E09;&#x3002;&#x8FD9;&#x4E9B;&#x592A;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x7CBE;&#x529B;&#x7422;&#x78E8;&#x3002;</p>
<p>&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5927;&#x6982;&#x7422;&#x78E8;&#x51FA;&#x4E00;&#x5957;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x8BB2;&#x8BFE;&#x65B9;&#x5F0F;&#x3002;what-how-why &#x5BF9;&#x5E94; api-implementation-architecture</p>
<img src="/2016/04/17/how-i-lose-300000-in-one-year/failure03.png" alt="failure03.png" title="">
<p>&#x628A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5C01;&#x88C5;&#x601D;&#x60F3;&#x878D;&#x5165;&#x5230;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x4E2D;&#x7684;what how why&#x4E2D;&#x53BB;&#xFF0C;&#x4E0D;&#x5177;&#x4F53;&#x7684;&#x8BB2;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x7528;&#x591A;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x6765;&#x6BD4;&#x5BF9;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x76F8;&#x4E92;&#x5370;&#x8BC1;&#xFF0C;&#x901A;&#x8FC7;&#x6846;&#x67B6;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#xFF0C;&#x4ECE;&#x5355;&#x4E00;&#x5230;&#x4E30;&#x5BCC;&#xFF0C;&#x4ECE;&#x7B80;&#x5355;&#x6A21;&#x578B;&#x5230;&#x590D;&#x6742;&#x5B9E;&#x73B0;&#x3002;&#x4E00;&#x6B65;&#x6B65;&#x7684;&#x7ED9;&#x5927;&#x5BB6;&#x5C55;&#x73B0;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x5F00;&#x6E90;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x5168;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x6211;&#x7684;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x6700;&#x91CD;&#x4F1A;&#x6389;&#x4EF7;&#x4F1A;&#x6DD8;&#x6C70;&#xFF0C;&#x4F46;&#x6211;&#x76F8;&#x4FE1;&#x90A3;&#x4E9B;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x8FD8;&#x662F;&#x6709;&#x5B58;&#x5728;&#x4EF7;&#x503C;&#x7684;&#x3002;&#x7279;&#x522B;&#x662F;&#x4E60;&#x60EF;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x800C;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x90A3;&#x51E0;&#x628A;&#x5237;&#x5B50;&#x7684;&#x4EBA;&#x3002;&#x5728;android developer&#x8D8A;&#x6765;&#x8D8A;&#x9971;&#x548C;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x4EBA;&#x8981;&#x51FA;&#x5C40;&#x3002;</p>
<p>&#x575A;&#x6301;&#x4E86;&#x4E00;&#x5E74;&#x591A;&#xFF0C;&#x4ECE;&#x5DE5;&#x4F5C;&#x65F6;&#x7684;&#x5E74;&#x6536;&#x5165;30w&#x5230;&#x9760;&#x4EBA;&#x5403;&#x996D;&#x7684;10w&#xFF0C;&#x518D;&#x629B;&#x5F00;&#x81EA;&#x5DF1;&#x7F51;&#x7AD9;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7EF4;&#x62A4;&#xFF0C;&#x89C6;&#x9891;&#x5B58;&#x50A8;&#x7B49;&#x8D39;&#x7528;&#x3002;&#x771F;&#x6B63;&#x7684;&#x6536;&#x5165;&#x53EA;&#x6709;8w&#x4E0D;&#x5230;&#x3002;&#x5929;&#x554A;&#xFF0C;&#x6211;&#x4ECE;&#x4E00;&#x4E2A;5&#x5E74;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF0C;&#x5728;&#x5916;&#x4F01;&#x65E0;&#x52A0;&#x73ED;&#xFF0C;20&#x5929;&#x5E74;&#x5047;&#xFF0C;&#x6BCF;&#x5929;&#x53EA;&#x5199;2&#x5C0F;&#x65F6;&#x4EE3;&#x7801;&#x7684;lead&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8FDE;&#x6BD5;&#x4E1A;&#x751F;&#x90FD;&#x4E0D;&#x5982;&#x7684;loser&#x3002;&#x4ECE;&#x4E00;&#x4E2A;&#x5F88;&#x4E50;&#x4E8E;&#x52A9;&#x4EBA;&#xFF0C;&#x5F88;&#x70ED;&#x5FC3;&#x7684;&#x9017;&#x6BD4;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x4E0D;&#x7231;&#x8BF4;&#x8BDD;&#xFF0C;&#x6613;&#x6012;&#x66B4;&#x8E81;&#x7684;loser&#x3002;&#x552F;&#x4E00;&#x8FD8;&#x80FD;&#x575A;&#x6301;&#x7684;&#xFF0C;&#x5C31;&#x53EA;&#x5269;&#x4E0B;&#x76F2;&#x76EE;&#x7684;&#x91CD;&#x6784;&#x89C6;&#x9891;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x79BB;&#x804C;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6CA1;&#x6709;&#x5168;&#x804C;&#x505A;&#x7EBF;&#x4E0A;&#x6559;&#x80B2;&#x3002;&#x6211;&#x5C31;&#x4E0D;&#x4F1A;&#x4E8F;&#x8FD9;30w&#x4E86;&#x5427;&#x3002;&#x4ECE;&#x6BD5;&#x4E1A;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x4ECE;&#x5927;&#x5B66;&#x7269;&#x7406;&#x8F6C;&#x5230;&#x5B66;&#x4E60;IT&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x81EA;&#x5DF1;&#x628A;&#x81EA;&#x5DF1;&#x5751;&#x4E86;&#x3002;&#x8FD8;&#x5751;&#x7684;&#x8FD9;&#x4E48;&#x7406;&#x76F4;&#x6C14;&#x58EE;&#x3002;</p>
<h3 id="&#x5355;&#x6253;&#x72EC;&#x6597;&#x7684;&#x65F6;&#x4EE3;&#x4E5F;&#x8FC7;&#x53BB;&#x4E86;"><a href="#&#x5355;&#x6253;&#x72EC;&#x6597;&#x7684;&#x65F6;&#x4EE3;&#x4E5F;&#x8FC7;&#x53BB;&#x4E86;" class="headerlink" title="&#x5355;&#x6253;&#x72EC;&#x6597;&#x7684;&#x65F6;&#x4EE3;&#x4E5F;&#x8FC7;&#x53BB;&#x4E86;"></a>&#x5355;&#x6253;&#x72EC;&#x6597;&#x7684;&#x65F6;&#x4EE3;&#x4E5F;&#x8FC7;&#x53BB;&#x4E86;</h3><p><strong>&#x7B2C;&#x4E09;&#x4E2A;&#x9519;&#x8BEF;&#x51B3;&#x5B9A;</strong>&#x5C31;&#x662F;&#x628A;&#x81EA;&#x5DF1;&#x4E0E;&#x5176;&#x4ED6;&#x4EBA;&#x9694;&#x79BB;&#x5F00;&#xFF0C;&#x79BB;&#x804C;&#x8FD9;&#x4EF6;&#x4E8B;&#x6CA1;&#x544A;&#x8BC9;&#x5BB6;&#x91CC;&#x4EBA;&#xFF0C;&#x56DE;&#x6B66;&#x6C49;&#x4E00;&#x5E74;&#x4E5F;&#x6CA1;&#x89C1;&#x8FC7;&#x5176;&#x4ED6;&#x540C;&#x5B66;&#x670B;&#x53CB;&#xFF0C;&#x751A;&#x81F3;&#x8DDF;&#x4ED8;&#x8D39;&#x7528;&#x6237;&#x90FD;&#x6CA1;&#x6709;&#x8FC7;&#x591A;&#x4E92;&#x52A8;&#x3002;&#x6211;&#x592A;&#x8FC7;&#x4F4E;&#x4F30;&#x7FA4;&#x4F17;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x592A;&#x8FC7;&#x6DF1;&#x4FE1;&#x90A3;&#x53E5;&#x201D;&#x9152;&#x9999;&#x4E0D;&#x6015;&#x5DF7;&#x5B50;&#x6DF1;&#x201D;&#x7684;&#x8001;&#x8BDD;&#x3002;&#x800C;&#x6B63;&#x662F;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x597D;&#x591A;&#x5927;V&#x901A;&#x8FC7;&#x62E5;&#x62B1;&#x5F00;&#x6E90;&#x83B7;&#x5F97;&#x4E86;&#x5927;&#x91CF;&#x7C89;&#x4E1D;&#x3002;&#x6211;&#x5374;&#x53EA;&#x6709;&#x90A3;&#x4ED8;&#x8D39;&#x7684;200&#x4F4D;&#x7528;&#x6237;&#x3002;&#x6211;&#x8F93;&#x4E86;&#x3002;&#x8F93;&#x7684;&#x5FC3;&#x670D;&#x53E3;&#x670D;&#x3002;</p>
<p>&#x5F53;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x5931;&#x8D25;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x548C;&#x65B0;&#x6280;&#x672F;&#x6709;&#x4E86;&#x65AD;&#x5C42;&#x3002;&#x6211;&#x51B3;&#x5B9A;&#x56DE;&#x5230;&#x5DE5;&#x4F5C;&#x4E2D;&#x53BB;&#xFF0C;&#x80FD;&#x7CFB;&#x7EDF;&#x8BB2;&#x7684;&#x4E1C;&#x897F;&#x57FA;&#x672C;&#x90FD;&#x5F55;&#x6210;&#x89C6;&#x9891;&#x4E86;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x7684;&#x4E86;&#x3002;&#x90A3;&#x5C31;&#x56DE;&#x5230;&#x5DE5;&#x4F5C;&#x4E2D;&#x53BB;&#xFF0C;&#x91CD;&#x65B0;&#x7D2F;&#x79EF;&#x3002;&#x4E0D;&#x5C31;&#x662F;&#x91CD;&#x5934;&#x518D;&#x6765;&#x4E48;&#x3002;&#x6211;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x56DE;&#x5230;&#x4E0A;&#x6D77;&#x91CD;&#x65B0;&#x627E;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x6211;&#x624D;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x5904;&#x5883;&#x591A;&#x4E48;&#x7684;&#x5C34;&#x5C2C;&#x3002;&#x4E00;&#x4E2A;&#x841D;&#x535C;&#x4E00;&#x4E2A;&#x5751;&#xFF0C;&#x5927;&#x5382;&#x7684;&#x5751;&#x90FD;&#x6EE1;&#x4E86;&#xFF0C;&#x4E2D;&#x5382;&#x505A;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x81EA;&#x5DF1;&#x53C8;&#x4E0D;&#x4E50;&#x610F;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x524D;&#x671F;&#x7684;&#x9700;&#x6C42;&#x5206;&#x6790;&#xFF0C;&#x9879;&#x76EE;&#x57FA;&#x7840;&#x6846;&#x67B6;&#xFF0C;&#x4EE5;&#x53CA;&#x540E;&#x671F;&#x7684;debug&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x8BA9;&#x6211;&#x505A;&#x67D0;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x753B;&#x753B;UI&#xFF0C;&#x6211;&#x4F1A;&#x5F88;&#x96BE;&#x53D7;&#x7684;&#x3002;&#x540E;&#x6765;&#x9646;&#x7EED;&#x5230;&#x9762;&#x4E86;&#x51E0;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x672C;&#x6765;&#x90FD;&#x6253;&#x7B97;&#x653E;&#x5F03;&#xFF0C;&#x7EE7;&#x7EED;&#x5F55;&#x89C6;&#x9891;&#xFF0C;&#x7B49;16&#x5E74;&#x8FC7;&#x5B8C;&#x5E74;&#x518D;&#x627E;&#x7684;&#x3002;&#x7EC8;&#x4E8E;&#x5728;&#x670B;&#x53CB;&#x7684;&#x4ECB;&#x7ECD;&#x4E0B;&#x53BB;&#x4E86;&#x4E00;&#x5BB6;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x3002;&#x505A;UBI&#x8F66;&#x9669;&#xFF0C;@&#x5F00;&#x5F00;&#x4FDD;&#xFF0C;&#x521A;&#x8D77;&#x6B65;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x600E;&#x4E48;&#x8C08;&#x85AA;&#x8D44;&#xFF0C;&#x6309;14&#x5E74;&#x79BB;&#x804C;&#x7684;&#x85AA;&#x6C34;&#x53BB;&#x7684;&#x3002;&#x4E5F;&#x6CA1;&#x8981;&#x6C42;&#x4EC0;&#x4E48;title&#xFF0C;&#x5148;&#x505A;&#xFF0C;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x6211;&#xFF0C;&#x6211;&#x5C31;&#x586B;&#x54EA;&#x4E2A;&#x5751;&#x3002;&#x7B49;&#x5145;&#x5206;&#x5C55;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x8C08;&#x8981;&#x6C42;&#x4E5F;&#x4E0D;&#x8FDF;&#x3002;</p>
<p>16&#x5E74;&#x8FC7;&#x5E74;&#x56DE;&#x5BB6;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x6CA1;&#x5DE5;&#x4F5C;&#x5403;&#x8001;&#x672C;&#x7684;&#x4E8B;&#x60C5;&#x8DDF;&#x7236;&#x6BCD;&#x6C9F;&#x901A;&#x4E86;&#xFF0C;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x662F;28&#x5C81;&#x7684;&#x4EBA;&#x4E86;&#xFF0C;&#x8138;&#x4E0A;&#x7684;&#x76B1;&#x7EB9;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x518D;&#x50B2;&#x5A07;&#x81EA;&#x5DF1;&#x6C38;&#x8FDC;18&#x5C81;&#x4E86;&#x3002;&#x6CA1;&#x623F;&#x6CA1;&#x8F66;&#x6CA1;&#x5AB3;&#x5987;&#x3002;&#x518D;&#x52A0;&#x4E0A;&#x7236;&#x6BCD;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x539F;&#x56E0;&#x548C;&#x6211;&#x7684;&#x4E0D;&#x4F5C;&#x4E3A;&#xFF0C;&#x88AB;&#x9A97;&#x4E86;20w(&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x7ED9;&#x7236;&#x6BCD;&#x7684;)&#x3002;&#x4EBA;&#x751F;&#xFF0C;&#x96BE;&#x9053;&#x975E;&#x8981;&#x5728;&#x4F60;&#x60E8;&#x7684;&#x65F6;&#x5019;&#x8BA9;&#x4F60;&#x66F4;&#x60E8;&#x5417;&#x3002;&#x88AB;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6211;&#x90FD;&#x6CA1;&#x6CD5;&#x62B1;&#x6028;&#xFF0C;&#x53EA;&#x80FD;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x5728;&#x6211;&#x6CA1;&#x521B;&#x4E1A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x8FD8;&#x5206;&#x6790;&#x8FC7;&#x81EA;&#x5DF1;&#x4E0D;&#x9002;&#x5408;&#x521B;&#x4E1A;&#xFF0C;&#x53EA;&#x9002;&#x5408;&#x505A;&#x5E2E;&#x624B;&#xFF0C;&#x4E0D;&#x80FD;&#x81EA;&#x5DF1;&#x64CD;&#x76D8;&#xFF0C;&#x8FD8;&#x5199;&#x4E86;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x8868;&#x660E;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#x3002;<a href="http://notes.stay4it.com/2014/05/27/startup-before-know-yourself-clearly/">&#x521B;&#x4E1A;&#x524D;&#x5148;&#x8BA4;&#x6E05;&#x81EA;&#x5DF1;</a>&#x3002;&#x53EF;&#x60DC;&#xFF0C;&#x6211;&#x6CA1;&#x542C;&#x81EA;&#x5DF1;&#x7684;&#x529D;&#x3002;</p>
<h3 id="&#x65E2;&#x7136;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x5C31;&#x7528;&#x73A9;&#x7684;&#x5FC3;&#x6001;&#x5427;"><a href="#&#x65E2;&#x7136;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x5C31;&#x7528;&#x73A9;&#x7684;&#x5FC3;&#x6001;&#x5427;" class="headerlink" title="&#x65E2;&#x7136;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x5C31;&#x7528;&#x73A9;&#x7684;&#x5FC3;&#x6001;&#x5427;"></a>&#x65E2;&#x7136;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x5C31;&#x7528;&#x73A9;&#x7684;&#x5FC3;&#x6001;&#x5427;</h3><p>&#x6709;&#x56FA;&#x5B9A;&#x6536;&#x5165;&#x7684;&#x611F;&#x89C9;&#x771F;&#x771F;&#x771F;&#x771F;&#x597D;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E24;&#x4E2A;&#x6708;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x627E;&#x56DE;&#x4EE5;&#x524D;&#x7684;&#x81EA;&#x4FE1;&#x3002;&#x7A0D;&#x5FAE;&#x53D8;&#x7684;&#x5F00;&#x6717;&#x4E86;&#xFF0C;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x5458;&#x7FA4;&#x91CC;&#x4E5F;&#x80FD;&#x7ECF;&#x5E38;&#x4E92;&#x52A8;&#x4E86;&#x3002;&#x81EA;&#x5DF1;&#x4E5F;&#x65F6;&#x5E38;&#x5728;&#x53CD;&#x7701;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5931;&#x8D25;&#xFF0C;&#x5982;&#x4F55;&#x6539;&#x8FDB;&#xFF0C;&#x5982;&#x4F55;&#x633D;&#x56DE;&#x3002;&#x4E4B;&#x524D;&#x505A;&#x7684;&#x4E00;&#x4E9B;&#x90FD;&#x662F;&#x89C6;&#x9891;&#xFF0C;&#x4F20;&#x9605;&#x5EA6;&#x4E0D;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x9646;&#x9646;&#x7EED;&#x7EED;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x4E9B;&#x6587;&#x7AE0;&#xFF0C;&#x628A;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x601D;&#x8DEF;&#x548C;&#x5C01;&#x88C5;&#x65B9;&#x5F0F;&#x901A;&#x8FC7;&#x535A;&#x5BA2;&#x5206;&#x4EAB;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x5728;github&#x4E0A;&#x5F00;&#x6E90;&#x3002;&#x76EE;&#x524D;&#x5728;&#x7B80;&#x4E66;&#x4E0A;&#x7684;&#x6548;&#x679C;&#x4E0D;&#x9519;&#x3002;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#xFF0C;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x3002;</p>
<img src="/2016/04/17/how-i-lose-300000-in-one-year/failure04.png" alt="failure04.png" title="">
<img src="/2016/04/17/how-i-lose-300000-in-one-year/failure05.png" alt="failure05.png" title="">
<p>&#x7B80;&#x4E66;&#x53EF;&#x4EE5;&#x6295;&#x7A3F;&#xFF0C;&#x82B1;&#x4E86;2&#x5468;&#x65F6;&#x95F4;&#x5C31;&#x6709;&#x4E86;&#x4E0D;&#x9519;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x4F46;&#x6211;&#x8FD9;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x5E73;&#x65F6;&#x4E0D;&#x7231;&#x6253;&#x7406;&#xFF0C;&#x4E24;&#x5E74;&#x4E86;&#x5C31;&#x53EA;&#x6709;866&#x4F4D;&#x7528;&#x6237;&#x3002;&#x6211;&#x771F;&#x662F;&#x628A;&#x7528;&#x6237;&#x60F3;&#x7684;&#x592A;&#x7B80;&#x5355;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x5E74;&#x7684;&#x8BD5;&#x9519;&#x65F6;&#x95F4;&#xFF0C;&#x8BA9;&#x6211;&#x8FD9;&#x4E2A;&#x5355;&#x7EAF;&#x5185;&#x655B;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x6E05;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x8BA4;&#x8BC6;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#x3002;&#x6211;&#x60F3;&#x8FD8;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x8FD8;&#x6709;&#x91CD;&#x6765;&#x4E00;&#x6B21;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x8BA9;&#x6211;&#x80FD;&#x597D;&#x597D;&#x7684;&#x5411;&#x5927;&#x5BB6;&#x4ECB;&#x7ECD;&#x6211;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x6211;&#x53EB;Stay&#xFF0C;&#x6211;&#x505A;&#x4E86;&#x4E00;&#x4E2A;android&#x5B66;&#x4E60;&#x5E73;&#x53F0;&#x53EB;<a href="http://stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;</a>&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;slogan&#xFF1A;<strong>&#x6709;&#x5FC3;&#x8BFE;&#x5802;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#x3002;</strong></p>
<p>###&#x63A8;&#x8350;&#x9605;&#x8BFB;</p>
<blockquote>
<p><a href="http://notes.stay4it.com/about/">Stay&#x662F;&#x8C01;</a><br><a href="http://notes.stay4it.com/2016/04/30/why-not-try-stay4it-to-level-up/">&#x6709;&#x5FC3;&#x8BFE;&#x5802;&#x4F20;&#x9012;&#x7684;&#x662F;&#x4EC0;&#x4E48;</a></p>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Android/" rel="tag">#Android</a>
          
            <a href="/tags/程序猿/" rel="tag">#程序猿</a>
          
            <a href="/tags/创业/" rel="tag">#创业</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/04/05/read-the-fcking-code-of-retrofit/" rel="next" title="Retrofit分析-漂亮的解耦套路">
                <i class="fa fa-chevron-left"></i> Retrofit分析-漂亮的解耦套路
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/04/30/why-not-try-stay4it-to-level-up/" rel="prev" title="有心课堂传递的是什么">
                有心课堂传递的是什么 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div id="disqus_thread">
        <noscript>
          Please enable JavaScript to view the
          <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a>
        </noscript>
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">37</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">10</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">54</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/6e4c6553a7f9" target="_blank">
                  
                    <i class="fa fa-globe"></i> 简书
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/stay4it" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#一叶障目，误以为自己找到了G点"><span class="nav-number">1.</span> <span class="nav-text">一叶障目，误以为自己找到了G点</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#最可怕的自high"><span class="nav-number">2.</span> <span class="nav-text">最可怕的自high</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#坚持就能得到回报吗"><span class="nav-number">3.</span> <span class="nav-text">坚持就能得到回报吗</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#单打独斗的时代也过去了"><span class="nav-number">4.</span> <span class="nav-text">单打独斗的时代也过去了</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#既然这样，那就用玩的心态吧"><span class="nav-number">5.</span> <span class="nav-text">既然这样，那就用玩的心态吧</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2016 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  

    <script type="text/javascript">
      var disqus_shortname = 'stay4it';
      var disqus_identifier = '2016/04/17/how-i-lose-300000-in-one-year/';
      var disqus_title = '作为一个程序员，我是如何一年亏掉30w的';
      var disqus_url = 'http://notes.stay4it.com/2016/04/17/how-i-lose-300000-in-one-year/';

      function run_disqus_script(disqus_script){
        var dsq = document.createElement('script');
        dsq.type = 'text/javascript';
        dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/' + disqus_script;
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
      }

      run_disqus_script('count.js');
      
        run_disqus_script('embed.js');
      
    </script>
  



  
  

  
  


</body>
</html>
