<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="方法论," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x968F;&amp;#x7740;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x53D1;&amp;#x5C55;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x73B0;&amp;#x5728;&amp;#x6240;&amp;#x63A5;&amp;#x89E6;&amp;#x7684;&amp;#x5927;&amp;#x591A;&amp;#x5C5E;&amp;#x4E8E;&amp;#x5BF9;&amp;#x8C61;&amp;#x578B;&amp;#x8BED;&amp;#x8A00;">
<meta property="og:type" content="article">
<meta property="og:title" content="方法论-从'抽象化的OOP世界'说开去">
<meta property="og:url" content="http://notes.stay4it.com/2016/10/27/overview-of-object-oriented/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x968F;&amp;#x7740;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x53D1;&amp;#x5C55;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x73B0;&amp;#x5728;&amp;#x6240;&amp;#x63A5;&amp;#x89E6;&amp;#x7684;&amp;#x5927;&amp;#x591A;&amp;#x5C5E;&amp;#x4E8E;&amp;#x5BF9;&amp;#x8C61;&amp;#x578B;&amp;#x8BED;&amp;#x8A00;">
<meta property="og:image" content="http://upload-images.jianshu.io/upload_images/625299-222ab9b850e1b4eb.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240">
<meta property="og:updated_time" content="2017-03-11T12:55:39.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="方法论-从'抽象化的OOP世界'说开去">
<meta name="twitter:description" content="&amp;#x968F;&amp;#x7740;&amp;#x6280;&amp;#x672F;&amp;#x7684;&amp;#x53D1;&amp;#x5C55;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x73B0;&amp;#x5728;&amp;#x6240;&amp;#x63A5;&amp;#x89E6;&amp;#x7684;&amp;#x5927;&amp;#x591A;&amp;#x5C5E;&amp;#x4E8E;&amp;#x5BF9;&amp;#x8C61;&amp;#x578B;&amp;#x8BED;&amp;#x8A00;">
<meta name="twitter:image" content="http://upload-images.jianshu.io/upload_images/625299-222ab9b850e1b4eb.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: undefined,
      author: '博主'
    }
  };
</script>

  <title> 方法论-从'抽象化的OOP世界'说开去 | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                方法论-从'抽象化的OOP世界'说开去
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-10-27T20:54:46+08:00" content="2016-10-27">
              2016-10-27
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/方法论/" itemprop="url" rel="index">
                    <span itemprop="name">方法论</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x968F;&#x7740;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6240;&#x63A5;&#x89E6;&#x7684;&#x5927;&#x591A;&#x5C5E;&#x4E8E;<strong>&#x5BF9;&#x8C61;&#x578B;&#x8BED;&#x8A00;</strong>&#xFF0C;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x8F7B;&#x6613;&#x7684;&#x5C06;&#x751F;&#x6D3B;&#x5316;&#x7684;&#x9700;&#x6C42;&#x8F6C;&#x6362;&#x6210;&#x4EE3;&#x7801;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x9886;&#x57DF;&#xFF0C;&#x73B0;&#x5728;&#x6700;&#x70ED;&#x7684;&#x524D;&#x6CBF;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x201C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x4E00;&#x4E2A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;OOP&#xFF09;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x3001;&#x6A21;&#x5757;&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;OOP&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x201C;&#x788E;&#x7247;&#x201D;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x6210;&#x7ACB;&#x3001;&#x4FDD;&#x6301;&#x81EA;&#x8EAB;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x5355;&#x5143;&#xFF1B;&#x5B83;&#x53EF;&#x4EE5;&#x548C;&#x5176;&#x4ED6;&#x7684;OOP&#x201C;&#x788E;&#x7247;&#x201D;&#x6574;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x5206;&#x89E3;&#x7684;&#x6307;&#x4EE4;&#x7ED3;&#x6784;&#x3002;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#x9650;&#x5236;&#x4E86;&#x7A0B;&#x5E8F;&#x6F0F;&#x6D1E;&#x6240;&#x80FD;&#x9020;&#x6210;&#x7684;&#x635F;&#x5BB3;&#x3002;&#x548C;&#x90A3;&#x79CD;&#x4F20;&#x7EDF;&#x7A0B;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;OOP&#x6709;&#x6548;&#x5730;&#x5BF9;&#x529F;&#x80FD;&#x5B9E;&#x884C;&#x4E86;&#x9694;&#x79BB;&#xFF0C;&#x628A;&#x6BCF;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x90FD;&#x9650;&#x5236;&#x5728;&#x4E00;&#x4E2A;&#x53EF;&#x638C;&#x63A7;&#x7684;&#x5355;&#x5143;&#x5185;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x5373;&#x4F7F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5D29;&#x6E83;&#x4E86;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x4E5F;&#x80FD;&#x591F;&#x7EE7;&#x7EED;&#x8FD0;&#x8F6C;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x4F20;&#x7EDF;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x5D29;&#x6E83;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x574F;&#x6389;&#x7684;&#x5355;&#x5143;&#x6362;&#x6389;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;&#x4E00;&#x4E2A;&#x6C7D;&#x8F66;&#x6362;&#x5239;&#x8F66;&#x7247;&#x4E00;&#x6837;&#x3002;&#x8F6F;&#x4EF6;&#x7684;&#x9500;&#x552E;&#x5546;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x6216;&#x8005;&#x9500;&#x552E;&#x5404;&#x79CD;&#x4E8B;&#x5148;&#x7F16;&#x5236;&#x597D;&#x7684;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#x5E93;&#x7ED9;&#x5176;&#x4ED6;&#x7684;&#x8F6F;&#x4EF6;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x540E;&#x8005;&#x5219;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x5E93;&#x91CC;&#x7684;&#x5BF9;&#x8C61;&#x5FEB;&#x901F;&#x5730;&#x7EC4;&#x88C5;&#x8D77;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x518D;&#x50CF;&#x4EE5;&#x524D;&#x90A3;&#x6837;&#x91CD;&#x65B0;&#x4E00;&#x884C;&#x4E00;&#x884C;&#x5730;&#x7F16;&#x5199;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x800C;&#x5230;&#x4E86;&#x8981;&#x4E3A;&#x8FD9;&#x79CD;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x5347;&#x7EA7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x6240;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5347;&#x7EA7;&#x65E7;&#x7684;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x52A0;&#x5165;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x3002;                                                                                                                    - KK &#x300A;&#x5931;&#x63A7;&#x300B; </p>
</blockquote>
<p>&#x4E0D;&#x4EC5;&#x4EC5;&#x8F6F;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#xFF0C;&#x6A21;&#x5757;&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x786C;&#x4EF6;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x6A21;&#x5757;&#x5316;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x7684;iPhone&#x80A2;&#x89E3;&#x56FE;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5C0F;&#x6A21;&#x5757;&#x90FD;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x5382;&#x5546;&#x5F00;&#x53D1;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x5BCC;&#x58EB;&#x5EB7;&#x7EC4;&#x88C5;&#x7684;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/625299-222ab9b850e1b4eb.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="obj.png"></p>
<p>&#x8FD9;&#x8DDF;&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4E2A;App&#x6709;&#x533A;&#x522B;&#x5417;&#xFF1F;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x62FF;&#x79FB;&#x52A8;App&#x6765;&#x8BF4;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD8;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x5F00;&#x6E90;lib&#xFF0C;&#x90FD;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x72EC;&#x7ACB;&#x6A21;&#x5757;&#x3002;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;lib&#xFF0C;&#x6570;&#x636E;&#x5E93;orm&#xFF0C;&#x56FE;&#x7247;&#x7F13;&#x5B58;lib&#xFF0C;UI&#x7EC4;&#x4EF6;&#x7B49;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x4E30;&#x5BCC;&#x7684;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x505A;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x804C;&#x8D23;&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x50CF;&#x4E0D;&#x50CF;&#x6D41;&#x6C34;&#x7EBF;&#x4E0A;&#x7684;&#x7EC4;&#x88C5;&#x5DE5;&#xFF1F;app workflow&#x5DF2;&#x7ECF;&#x5B9A;&#x5236;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x505A;&#x597D;&#x76F8;&#x5E94;&#x7684;&#x62FC;&#x63A5;&#x5C31;&#x597D;&#x3002;&#x867D;&#x7136;&#x8BF4;&#x9700;&#x8981;&#x90A3;&#x4E48;&#x70B9;&#x6280;&#x672F;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x7B97;&#x4EC0;&#x4E48;&#x9AD8;&#x96BE;&#x5EA6;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#x3002;&#x4F60;&#x804C;&#x8D23;&#x80FD;cover&#x7684;range&#x6709;&#x591A;&#x5E7F;&#x5462;&#xFF1F;</p>
<ol>
<li>&#x53EA;&#x4F1A;&#x5B89;&#x88C5;&#x67D0;&#x4E2A;&#x5355;&#x4E00;&#x96F6;&#x4EF6;</li>
<li>&#x4F1A;&#x5B89;&#x88C5;&#x591A;&#x4E2A;&#x96F6;&#x4EF6;</li>
<li>&#x8D1F;&#x8D23;&#x4E00;&#x6761;&#x751F;&#x4EA7;&#x7EBF;</li>
<li>&#x8D1F;&#x8D23;&#x6574;&#x4E2A;&#x751F;&#x4EA7;&#x7EBF;</li>
<li>&#x8BBE;&#x8BA1;&#x751F;&#x4EA7;&#x7EBF;&#x7EC4;&#x5408;</li>
</ol>
<p>&#x8FD9;&#x4E0D;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x8D70;&#x4E0A;&#x4EBA;&#x751F;&#x5DC5;&#x5CF0;&#x7684;&#x594B;&#x6597;&#x5386;&#x7A0B;&#x5417;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x638C;&#x63E1;&#x4E86;&#x2019;&#x6700;&#x5C0F;&#x53EF;&#x884C;&#x4F53;&#x7CFB;&#x2019;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x6BD4;&#x5982;&#x5148;&#x7ED9;&#x81EA;&#x5DF1;&#x5B9A;&#x4E2A;&#x5C0F;&#x76EE;&#x6807;&#xFF0C;&#x5148;&#x6323;&#x5B83;&#x4E00;&#x4E2A;&#x4EBF;&#xFF01;&#xFF01;&#xFF01;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x4E0A;&#x505A;&#x5F00;&#x53D1;&#xFF0C;&#x4EE3;&#x7801;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x53D8;&#x6210;&#x5177;&#x6709;&#x7279;&#x6B8A;&#x529F;&#x80FD;&#x7684;&#x8F7D;&#x4F53;&#x3002;&#x5C31;&#x50CF;&#x82F1;&#x8BED;&#x662F;&#x7531;26&#x4E2A;&#x5B57;&#x6BCD;&#x7EC4;&#x5408;&#x800C;&#x6210;&#x7684;&#x3002;&#x96F6;&#x6563;&#x7684;&#x6CA1;&#x6709;&#x751F;&#x547D;&#xFF0C;&#x725B;&#x903C;&#x7684;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x5374;&#x6210;&#x4E86;&#x521B;&#x65B0;&#x3002;&#x4F46;&#x662F;26&#x4E2A;&#x5B57;&#x6BCD;&#x7684;&#x968F;&#x673A;&#x7EC4;&#x5408;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x89C4;&#x5219;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x5E38;&#x4EBA;&#x600E;&#x4E48;&#x5B66;&#x7684;&#x4F1A;&#x54C7;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x82F1;&#x8BED;&#x5C31;&#x6709;&#x4E86;&#x524D;&#x7F00;&#x540E;&#x7F00;&#x4E0E;&#x8BCD;&#x6839;&#x6765;&#x7F29;&#x5C0F;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x7684;&#x8303;&#x56F4;&#x3002;&#x6C49;&#x8BED;&#x5C31;&#x6709;&#x4E86;&#x504F;&#x65C1;&#x90E8;&#x9996;&#x6765;&#x4F5C;&#x4E3A;&#x89C4;&#x5219;&#x3002;&#x5728;&#x4F60;&#x6253;&#x7B97;&#x6323;&#x5B83;&#x4E00;&#x4E2A;&#x4EBF;&#x4E4B;&#x524D;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4E8B;&#x5148;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x6280;&#x5DE7;&#xFF0C;&#x60F3;&#x60F3;&#x4F60;&#x8981;&#x82B1;&#x591A;&#x5C11;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x7B5B;&#x9009;&#x90A3;&#x4E07;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E1C;&#x897F;&#x5462;&#x3002;</p>
<p>&#x4ECE;0&#x5230;1&#x7684;&#x9636;&#x6BB5;&#x4E0D;&#x9002;&#x5408;&#x91C7;&#x7EB3;&#x522B;&#x4EBA;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x6309;&#x81EA;&#x5DF1;&#x60F3;&#x7684;&#x6765;&#x3002;&#x4F46;&#x5F80;&#x540E;&#x7684;&#x4F18;&#x5316;&#x8C03;&#x6574;&#x9636;&#x6BB5;&#xFF0C;&#x9700;&#x8981;&#x542C;&#x53D6;&#x5916;&#x754C;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x4ECE;1&#x5230;100&#x662F;&#x975E;&#x5E38;&#x6F2B;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x60F3;&#x8981;&#x5C11;&#x8D70;&#x5F2F;&#x8DEF;&#xFF0C;&#x5FC5;&#x9700;&#x501F;&#x9274;&#x4ED6;&#x4EBA;&#x6210;&#x529F;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7AD9;&#x5728;&#x5DE8;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#x4E0A;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x80FD;&#x662F;&#x2019;&#x5DE8;&#x4EBA;&#x2019;&#x3002;</p>
<p>&#x5DE8;&#x4EBA;&#x53EF;&#x4EE5;&#x662F;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x725B;&#x903C;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x6280;&#x672F;&#x7280;&#x5229;&#x7684;&#x8001;&#x5927;&#x2026; &#x8FD9;&#x4E2A;&#x5DE8;&#x4EBA;&#x8D8A;&#x9AD8;&#xFF0C;&#x4F60;&#x80FD;&#x770B;&#x5230;&#x7684;&#x66F4;&#x8FDC;&#xFF0C;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x4E5F;&#x5C31;&#x8D8A;&#x660E;&#x786E;&#xFF0C;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x8FBE;&#x5230;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x90FD;&#x6CA1;&#x6709;&#xFF1F;&#x6CA1;&#x6709;&#x5C31;&#x60F3;&#x529E;&#x6CD5;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x554A;&#x3002;&#x6CA1;&#x6709;&#x6761;&#x4EF6;&#x4E0A;&#xFF0C;&#x5C31;&#x8981;&#x62FC;&#x547D;&#x521B;&#x9020;&#x6761;&#x4EF6;&#x53BB;&#x4E0A;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x4ECE;1&#x5230;100&#x7684;&#x6218;&#x7EBF;&#x8FC7;&#x957F;&#xFF0C;&#x6280;&#x672F;&#x66F4;&#x65B0;&#x53C8;&#x90A3;&#x4E48;&#x5FEB;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x6709;&#x8FF7;&#x832B;&#x3002;</p>
<blockquote>
<p>&#x5230;&#x5E95;&#x662F;&#x52AA;&#x529B;&#x8D70;&#x5230;100&#xFF1F;&#x8FD8;&#x662F;&#x505A;&#x4E2A;&#x659C;&#x6760;&#x9752;&#x5E74;&#x638C;&#x63E1;&#x591A;&#x4E2A;&#x4ECE;0&#x5230;10&#xFF1F;</p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x60F3;&#x6210;&#x4E3A;&#x88AB;&#x968F;&#x610F;GC&#x7684;&#x2019;&#x5BF9;&#x8C61;&#x2019;&#xFF0C;&#x800C;GC&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x662F;&#x4E0D;&#x518D;&#x6301;&#x6709;&#x8BE5;&#x2019;&#x5BF9;&#x8C61;&#x2019;&#x7684;&#x5F15;&#x7528;&#x3002;&#x90A3;&#x4E48;&#x4E3A;&#x4E86;&#x4E0D;&#x88AB;GC&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C31;&#x5F97;&#x53D8;&#x5F97;&#x91CD;&#x8026;&#x5408;&#x3002;&#x5373;&#x6BCF;&#x4E2A;&#x751F;&#x4EA7;&#x7EBF;&#xFF0C;&#x6BCF;&#x4E2A;&#x90E8;&#x95E8;&#x90FD;&#x8981;&#x6301;&#x6709;&#x8FD9;&#x4E2A;&#x2019;&#x5BF9;&#x8C61;&#x2019;&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x638C;&#x63E1;&#x591A;&#x4E2A;&#x2019;&#x6700;&#x5C0F;&#x53EF;&#x884C;&#x4F53;&#x7CFB;&#x2019;&#x3002;&#x5373;&#xFF1A;&#x4E0A;&#x4F1A;&#x4EA7;&#x54C1;&#xFF0C;&#x8FD0;&#x8425;&#x3002;&#x4E0B;&#x4F1A;&#x67B6;&#x6784;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;ps&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x7F8E;&#x597D;&#xFF0C;&#x8868;&#x9762;&#x529F;&#x592B;&#x505A;&#x5230;&#x4F4D;&#xFF0C;&#x8026;&#x5408;&#x5230;&#x6BCF;&#x4E00;&#x4E2A;&#x90E8;&#x95E8;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x67D0;&#x4E00;&#x5929;&#x5FCD;&#x75DB;&#x91CD;&#x6784;&#x4E86;&#x5462;&#x3002;&#x8FD9;&#x79CD;&#x65E0;&#x6548;&#x8026;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x8981;&#x88AB;&#x6E05;&#x9664;&#x5427;(Stay&#x6700;&#x4E0D;&#x6015;&#x7684;&#x5C31;&#x662F;&#x91CD;&#x6784;&#xFF0C;&#x5F00;&#x4EBA;&#x4E5F;&#x662F;&#x5982;&#x6B64;)&#x3002;&#x5982;&#x679C;&#x662F;&#x771F;&#x725B;&#x903C;&#xFF0C;&#x4ED6;&#x80AF;&#x5B9A;&#x4F1A;&#x806A;&#x660E;&#x7684;&#x505A;&#x4E3A;&#x2019;&#x95E8;&#x9762;&#x2019;(&#x95E8;&#x9762;&#x6A21;&#x5F0F;)&#x5BF9;&#x63A5;&#x5916;&#x90E8;&#x4E0E;&#x5185;&#x90E8;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5FC3;&#x529B;&#x4EA4;&#x7601;&#x7684;&#x76EF;&#x7740;&#x5185;&#x90E8;&#x6BCF;&#x4E00;&#x4E2A;&#x90E8;&#x95E8;&#x8FD0;&#x8F6C;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x662F;&#x600E;&#x4E48;&#x770B;&#x7684;&#x5462;&#xFF1F;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x5982;&#x4F55;&#x5B9A;&#x4F4D;&#x81EA;&#x5DF1;&#xFF0C;&#x662F;&#x5426;&#x8FD8;&#x6709;&#x4E0A;&#x5347;&#x7A7A;&#x95F4;&#xFF1F;&#x4E0D;&#x59A8;&#x60F3;&#x60F3;&#x770B;&#x5427;&#x3002;</p>
<p>&#x672C;&#x7BC7;&#x4E3A;&#x80E1;&#x601D;&#x4E71;&#x60F3;&#x7684;&#x756A;&#x5916;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x9519;&#x7684;&#x3002;&#x6B22;&#x8FCE;&#x6307;&#x6B63;&#x3002;</p>
<p>&#x200B;&#x63A8;&#x8350;&#x9605;&#x8BFB;&#xFF1A;<br><a href="http://www.jianshu.com/p/b81542987e4b" target="_blank" rel="external">&#x8FD8;&#x9700;&#x8981;&#x518D;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5417;&#xFF1F;</a><br><a href="http://www.jianshu.com/p/b8f3e98d0f6b" target="_blank" rel="external">&#x65B9;&#x6CD5;&#x8BBA;-&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;</a><br><a href="http://www.jianshu.com/p/e6aec31e681f" target="_blank" rel="external">&#x65B9;&#x6CD5;&#x8BBA;-&#x6700;&#x5C0F;&#x53EF;&#x884C;&#x4F53;&#x7CFB;</a></p>
<blockquote>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/方法论/" rel="tag">#方法论</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/10/26/learn-a-new-language-with-minimum-essence/" rel="next" title="方法论-最小可行体系">
                <i class="fa fa-chevron-left"></i> 方法论-最小可行体系
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/01/06/an-example-about-out-of-memory/" rel="prev" title="内存泄漏实例分析">
                内存泄漏实例分析 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">38</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">10</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">55</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/6e4c6553a7f9" target="_blank">
                  
                    <i class="fa fa-globe"></i> 简书
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/stay4it" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  



  
  

  
  


</body>
</html>
