<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="android,外包," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x597D;&amp;#x591A;&amp;#x5C0F;&amp;#x4F19;&amp;#x4F34;&amp;#x4EEC;&amp;#x95EE;&amp;#x6211;&amp;#xFF0C;Stay&amp;#xFF0C;&amp;#x60F3;&amp;#x63A5;&amp;#x4E2A;&amp;#x5916;&amp;#x5305;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x5982;&amp;#x4F55;&amp;#x5B9A;&amp;#x4">
<meta property="og:type" content="article">
<meta property="og:title" content="外包如何定价">
<meta property="og:url" content="http://notes.stay4it.com/2016/02/01/how-to-make-a-price-of-out-source/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x597D;&amp;#x591A;&amp;#x5C0F;&amp;#x4F19;&amp;#x4F34;&amp;#x4EEC;&amp;#x95EE;&amp;#x6211;&amp;#xFF0C;Stay&amp;#xFF0C;&amp;#x60F3;&amp;#x63A5;&amp;#x4E2A;&amp;#x5916;&amp;#x5305;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x5982;&amp;#x4F55;&amp;#x5B9A;&amp;#x4">
<meta property="og:updated_time" content="2016-03-02T02:12:01.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="外包如何定价">
<meta name="twitter:description" content="&amp;#x597D;&amp;#x591A;&amp;#x5C0F;&amp;#x4F19;&amp;#x4F34;&amp;#x4EEC;&amp;#x95EE;&amp;#x6211;&amp;#xFF0C;Stay&amp;#xFF0C;&amp;#x60F3;&amp;#x63A5;&amp;#x4E2A;&amp;#x5916;&amp;#x5305;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x5982;&amp;#x4F55;&amp;#x5B9A;&amp;#x4">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 外包如何定价 | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                外包如何定价
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-02-01T10:58:10+08:00" content="2016-02-01">
              2016-02-01
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经验之谈/" itemprop="url" rel="index">
                    <span itemprop="name">经验之谈</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/02/01/how-to-make-a-price-of-out-source/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/02/01/how-to-make-a-price-of-out-source/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/02/01/how-to-make-a-price-of-out-source/" class="leancloud_visitors" data-flag-title="外包如何定价">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x597D;&#x591A;&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x95EE;&#x6211;&#xFF0C;Stay&#xFF0C;&#x60F3;&#x63A5;&#x4E2A;&#x5916;&#x5305;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5B9A;&#x4EF7;&#x3002;&#x80FD;&#x4E0D;&#x80FD;&#x5E2E;&#x5FD9;&#x770B;&#x770B;&#x3002;</p>
<p>&#x73B0;&#x5728;Stay&#x6574;&#x7406;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x660E;&#x7EC6;&#x7ED9;&#x5927;&#x5BB6;&#x505A;&#x4E2A;&#x53C2;&#x8003;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x5206;&#x4E2A;&#x7C7B;&#xFF0C;&#x63A5;&#x5916;&#x5305;&#x7684;&#x65B9;&#x5F0F;&#x5206;&#x4E3A;&#x4E2A;&#x4EBA;&#xFF0C;&#x56E2;&#x961F;&#xFF0C;&#x516C;&#x53F8;&#x3002;&#x8BA1;&#x8D39;&#x7684;&#x65B9;&#x5F0F;&#x5206;&#x4E3A;&#x6839;&#x636E;&#x9879;&#x76EE;&#x5468;&#x671F;&#x7684;&#x4EBA;&#x5929;&#x548C;&#x6839;&#x636E;&#x9879;&#x76EE;&#x5927;&#x5C0F;&#x7684;&#x5408;&#x8BA1;&#x3002;</p>
<a id="more"></a>
<h5 id="&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;"><a href="#&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;" class="headerlink" title="&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;"></a>&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;</h5><p>&#x4F60;&#x63A5;&#x5230;&#x7684;case&#x4E00;&#x822C;&#x90FD;&#x4E0D;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x90FD;&#x662F;&#x670B;&#x53CB;&#x4ECB;&#x7ECD;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x5356;&#x4E2A;&#x53CB;&#x60C5;&#x4EF7;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8981;&#x6CE8;&#x610F;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x670B;&#x53CB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5546;&#x8A00;&#x5546;&#xFF0C;&#x4E0D;&#x7136;&#x5230;&#x65F6;&#x5019;&#x8C08;&#x94B1;&#x4F24;&#x611F;&#x60C5;&#xFF0C;&#x6211;&#x4E4B;&#x524D;&#x5C31;&#x5403;&#x8FC7;&#x4E8F;&#xFF0C;&#x9879;&#x76EE;&#x5F00;&#x59CB;&#x524D;&#x4E00;&#x5B9A;&#x8981;&#x5148;&#x8C08;&#x597D;&#xFF0C;&#x4E0D;&#x7136;&#x4EE5;&#x540E;&#x670B;&#x53CB;&#x90FD;&#x6CA1;&#x5F97;&#x505A;&#x3002;&#x5173;&#x4E8E;&#x8BAE;&#x4EF7;&#x4E0A;&#xFF0C;&#x5EFA;&#x8BAE;&#x6309;&#x4EBA;&#x5929;&#x7B97;&#xFF0C;&#x5982;&#x679C;case&#x7684;&#x9884;&#x7B97;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x7A0D;&#x5FAE;&#x9EBB;&#x70E6;&#x70B9;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x5F97;&#x4F30;&#x7B97;&#x9700;&#x6C42;&#x70B9;&#x548C;&#x9879;&#x76EE;&#x5468;&#x671F;&#xFF0C;&#x7136;&#x540E;salary <em> period </em> (120%-150%&#x7684;&#x6EA2;&#x4EF7;)&#xFF0C;&#x5982;&#x679C;&#x8DDF;&#x9884;&#x7B97;&#x5DEE;&#x4E0D;&#x591A;&#x5C31;&#x53EF;&#x4EE5;&#x63A5;&#x4E86;&#x3002;&#x5982;&#x679C;&#x5DEE;&#x5F88;&#x5927;&#x5C31;&#x7B97;&#x4E86;&#x5427;&#xFF0C;&#x5B89;&#x5B89;&#x5FC3;&#x5FC3;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4E0D;&#x7136;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x75DB;&#x82E6;&#x3002;</p>
<h5 id="&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x6765;&#x8BF4;"><a href="#&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x6765;&#x8BF4;" class="headerlink" title="&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x6765;&#x8BF4;"></a>&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x6765;&#x8BF4;</h5><p>&#x4F60;&#x63A5;&#x5230;&#x7684;case&#x4E0D;&#x5927;&#x4E0D;&#x5C0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x9700;&#x8981;&#x7A0D;&#x5FAE;&#x6B63;&#x5F0F;&#x70B9;&#xFF0C;&#x62FF;&#x5230;&#x9700;&#x6C42;&#x4E86;&#x8981;&#x5148;&#x51FA;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x901A;&#x8FC7;&#x4E86;&#x518D;&#x53BB;&#x8C08;&#x94B1;&#xFF08;&#x6CE8;&#x610F;&#x6709;&#x5F88;&#x591A;&#x9A97;&#x65B9;&#x6848;&#x7684;&#x8D31;&#x4EBA;&#xFF09;&#x901A;&#x8FC7;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5927;&#x81F4;&#x5206;&#x6790;&#x4F60;&#x6240;&#x8981;&#x505A;&#x7684;&#x529F;&#x80FD;&#x70B9;&#xFF0C;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x4F30;&#x7B97;&#x4EBA;&#x5929;&#x6216;&#x8005;&#x4EF7;&#x94B1;&#x3002;&#x603B;&#x4EF7;&#x7B97;&#x51FA;&#x6765;&#x4E86;&#x8981;&#x4E58;&#x4EE5;200%&#x7684;&#x6EA2;&#x4EF7;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8FD9;&#x91CC;&#x8003;&#x8651;&#x5230;&#x662F;&#x8981;&#x7B7E;&#x5408;&#x540C;&#x7684;&#xFF0C;20%&#x7684;&#x9884;&#x4ED8;&#x6B3E;&#xFF0C;60%&#x7684;&#x4EA4;&#x4ED8;&#x6B3E;&#x548C;20%&#x7684;&#x5C3E;&#x6B3E;&#xFF0C;&#x5C3E;&#x6B3E;&#x4E0D;&#x89C1;&#x5F97;&#x80FD;&#x62FF;&#x5230;&#xFF0C;&#x800C;&#x4E14;&#x4F5C;&#x4E3A;&#x56E2;&#x961F;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x56E2;&#x961F;&#x5EFA;&#x8BBE;&#x8D39;&#xFF0C;&#x4F60;&#x603B;&#x4E0D;&#x5E0C;&#x671B;&#x4E00;&#x8F88;&#x5B50;&#x4EE5;&#x56E2;&#x961F;&#x53BB;&#x63A5;&#x90A3;&#x4E9B;&#x843D;&#x5730;&#x5305;&#x5427;&#xFF0C;&#x8FD9;&#x4E9B;&#x592A;&#x5EC9;&#x4EF7;&#x4E86;&#x3002;&#x4F5C;&#x4E3A;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#xFF0C;&#x79EF;&#x7D2F;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x548C;&#x6210;&#x529F;&#x6848;&#x4F8B;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x524D;&#x671F;&#x7A0D;&#x5FAE;&#x4E8F;&#x70B9;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x628A;&#x5BA2;&#x6237;&#x5173;&#x7CFB;&#x5EFA;&#x7ACB;&#x8D77;&#x6765;&#xFF0C;&#x4EE5;&#x540E;&#x597D;&#x65E5;&#x5B50;&#x5C31;&#x4F1A;&#x6765;&#x7684;&#x3002;</p>
<h5 id="&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x6765;&#x8BF4;"><a href="#&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x6765;&#x8BF4;" class="headerlink" title="&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x6765;&#x8BF4;"></a>&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x6765;&#x8BF4;</h5><p>&#x5B9A;&#x4E2A;&#x94C1;&#x5F8B;&#xFF0C;&#x4F4E;&#x4E8E;20w&#x7684;&#x9879;&#x76EE;&#x522B;&#x63A5;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x653E;&#x957F;&#x7EBF;&#x9493;&#x5927;&#x9C7C;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x76C8;&#x5229;&#x800C;&#x4E0D;&#x662F;&#x6E29;&#x9971;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x4E9B;&#x9500;&#x552E;&#x548C;&#x516C;&#x5173;&#x7684;&#x7ECF;&#x8D39;&#x4F60;&#x5FC5;&#x987B;&#x5F97;&#x51FA;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x624D;&#x53EF;&#x80FD;&#x505A;&#x5927;&#xFF0C;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x54C1;&#x724C;&#x548C;&#x4FE1;&#x8A89;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5149;&#x8D5A;&#x8F9B;&#x82E6;&#x94B1;&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x516C;&#x53F8;&#x8FD0;&#x8425;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7BA1;&#x5982;&#x4F55;&#xFF0C;&#x4F4E;&#x4E8E;20w&#x7684;&#x522B;&#x63A5;&#x4E86;&#x3002;&#x7136;&#x540E;&#x518D;&#x662F;&#x6309;&#x7167;&#x56E2;&#x961F;&#x5B9A;&#x4EF7;&#xFF0A;300%&#x7684;&#x6EA2;&#x4EF7;&#x6765;&#x7B97;&#x3002;&#x5DEE;&#x4E0D;&#x591A;&#x5C31;&#x53EF;&#x4EE5;&#x63A5;&#x4E86;&#x3002;&#x8BB2;&#x5230;&#x8FD9;&#x662F;&#x4E0D;&#x662F;&#x89C9;&#x5F97;&#x5F88;&#x5938;&#x5F20;&#xFF1F;&#x4F60;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x63A5;&#x5305;&#x5230;&#x843D;&#x5730;&#x8F6C;&#x4E86;&#x591A;&#x5C11;&#x9053;&#x624B;&#xFF1F;&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x6765;&#x8BF4;&#xFF0C;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x6C89;&#x6DC0;&#x81EA;&#x5DF1;&#x7684;&#x7B2C;&#x4E00;&#x624B;&#x5BA2;&#x6237;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x6269;&#x5C55;&#x65B0;&#x5BA2;&#x6237;&#xFF0C;&#x8FD9;&#x4E2A;&#x82B1;&#x8D39;&#x5F88;&#x9AD8;&#x7684;&#x3002;&#x6240;&#x4EE5;300%&#x7684;&#x6EA2;&#x4EF7;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x90A3;&#x4E9B;&#x56E2;&#x961F;&#x6216;&#x8005;&#x4E2A;&#x4EBA;&#x63A5;&#x5305;&#x57FA;&#x672C;&#x63A5;&#x5230;&#x7684;&#x90FD;&#x662F;&#x7B2C;&#x4E09;&#x9053;&#x6216;&#x8005;&#x7B2C;&#x56DB;&#x9053;&#x4E86;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x5728;&#x63A5;&#x5916;&#x5305;&#x65F6;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x63A5;&#x5305;&#x9700;&#x8C28;&#x614E;&#xFF0C;&#x4E14;&#x505A;&#x4E14;&#x73CD;&#x60DC;&#x3002;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x8109;&#x591F;&#x5E7F;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x4E0B;&#x6765;&#x518D;&#x5206;&#x5305;&#x51FA;&#x53BB;&#xFF0C;&#x8D5A;&#x4E2A;&#x5DEE;&#x4EF7;&#x843D;&#x4E2A;&#x8F7B;&#x677E;&#x3002;</p>
<h5 id="&#x4EE5;&#x4E0B;&#x7684;&#x5751;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x522B;&#x53BB;&#x8E29;"><a href="#&#x4EE5;&#x4E0B;&#x7684;&#x5751;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x522B;&#x53BB;&#x8E29;" class="headerlink" title="&#x4EE5;&#x4E0B;&#x7684;&#x5751;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x522B;&#x53BB;&#x8E29;"></a>&#x4EE5;&#x4E0B;&#x7684;&#x5751;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x522B;&#x53BB;&#x8E29;</h5><p>&#x50CF;&#x667A;&#x57CE;&#x548C;&#x732A;&#x516B;&#x6212;&#x4E0A;&#x7684;&#x5355;&#x5B50;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x63A5;&#xFF0C;&#x4E00;&#x662F;&#x592A;&#x767D;&#x83DC;&#x4EF7;&#x4E86;&#xFF0C;&#x4E8C;&#x662F;&#x9A97;&#x65B9;&#x6848;&#x7684;&#x591A;&#x3002;</p>
<p>&#x4E24;&#x5E74;&#x4EE5;&#x4E0B;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x7684;&#x6700;&#x597D;&#x5148;&#x4E0D;&#x8981;&#x63A5;&#x5916;&#x5305;&#xFF0C;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x5B66;&#x6280;&#x672F;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4E0D;&#x7136;&#x9879;&#x76EE;&#x5403;&#x4E0D;&#x4E0B;&#x6765;&#x8FD8;&#x8981;&#x62C5;&#x8D23;&#x4EFB;&#x3002;<strong>&#x597D;&#x597D;&#x5B66;&#x6280;&#x672F;&#xFF0C;&#x4E00;&#x5E74;&#x540E;&#x6DA8;&#x4E2A;3k&#x5176;&#x5B9E;&#x8DDF;&#x63A5;&#x4E2A;&#x5916;&#x5305;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x6548;&#x679C;&#x3002;</strong></p>
<p>&#x843D;&#x5730;&#x5305;(&#x8F6C;&#x624B;&#x5F88;&#x591A;&#x6B21;)&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x63A5;&#xFF0C;&#x4F60;&#x62FF;&#x5230;&#x7684;&#x94B1;&#x53EF;&#x80FD;&#x662F;&#x6574;&#x4E2A;&#x5305;&#x7684;20%&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x8981;&#x627F;&#x62C5;&#x7684;&#x8D23;&#x4EFB;&#x8FDC;&#x4E0D;&#x6B62;&#x8FD9;20%&#xFF0C;&#x5BA2;&#x6237;&#x51FA;&#x4E86;&#x5927;&#x94B1;&#xFF0C;&#x8981;&#x6539;&#x9700;&#x6C42;&#x4E5F;&#x662F;&#x5F88;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x800C;&#x81EA;&#x5DF1;&#x53EA;&#x62FF;20%&#xFF0C;&#x8FD8;&#x662F;&#x76F8;&#x5F53;&#x4E0D;&#x5212;&#x7B97;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x63A5;&#x89E6;&#x4E0D;&#x5230;&#x771F;&#x6B63;&#x7684;&#x7532;&#x65B9;&#x5BA2;&#x6237;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x63A5;&#xFF0C;&#x6C9F;&#x901A;&#x6210;&#x672C;&#x5F80;&#x5F80;&#x662F;&#x4EBA;&#x529B;&#x6210;&#x672C;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x4E00;&#x9879;&#x3002;&#x5982;&#x679C;&#x9700;&#x6C42;&#x90FD;&#x7531;&#x4E2D;&#x95F4;&#x5206;&#x5305;&#x4EBA;&#x5458;&#x8F6C;&#x8FF0;&#xFF0C;&#x53EF;&#x662F;&#x5F88;&#x803D;&#x8BEF;&#x65F6;&#x95F4;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7532;&#x65B9;&#x5BA2;&#x6237;&#x8981;&#x6C42;&#x6D3E;&#x4EBA;&#x5458;&#x9A7B;&#x573A;&#x7684;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x5DE5;&#x671F;&#x4EBA;&#x5929;&#x6839;&#x672C;&#x6CA1;&#x6CD5;&#x591A;&#x7B97;&#xFF0C;&#x5982;&#x5B9E;&#x62A5;&#x4EBA;&#x5929;&#xFF0C;&#x5373;&#x4F7F;1500/&#x4EBA;&#xFF0F;&#x5929;&#x4E5F;&#x662F;&#x4E0D;&#x5212;&#x7B97;&#x7684;&#x54E6;&#x3002;</p>
<p>&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x90FD;&#x662F;&#x6CEA;&#x3002;</p>
<p>Stay&#x4ECE;&#x5DE5;&#x4F5C;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x516D;&#x5E74;&#x4E86;&#xFF0C;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x505A;&#x8FC7;7&#x4E2A;&#x5916;&#x5305;&#x4E86;&#xFF0C;&#x6709;&#x88AB;&#x670B;&#x53CB;&#x5751;&#x7684;&#xFF0C;&#x6709;&#x88AB;&#x5408;&#x4F5C;&#x7684;&#x5751;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x9879;&#x76EE;&#x62D6;&#x4E86;&#x4E24;&#x5E74;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x554A;&#xFF0C;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x60F3;&#x60F3;&#x600E;&#x4E48;&#x505A;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x6216;&#x8005;&#x4E13;&#x5FC3;&#x5B66;&#x6280;&#x672F;&#x5356;&#x4E2A;&#x597D;&#x4EF7;&#x94B1;&#x3002;&#x8FD9;&#x6837;&#x66F4;&#x5B9E;&#x5728;&#xFF0C;&#x8FD8;&#x6709;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x5916;&#x5305;&#x795E;&#x9A6C;&#x7684;&#x5C31;&#x662F;&#x6BC1;&#x4EBA;&#x4E0D;&#x5026;&#x3002;</p>
<blockquote>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/android/" rel="tag">#android</a>
          
            <a href="/tags/外包/" rel="tag">#外包</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/01/what-worth-to-learn/" rel="next" title="方法论-什么值得学">
                <i class="fa fa-chevron-left"></i> 方法论-什么值得学
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/02/01/stays-android-developing-experience/" rel="prev" title="stays-android-developing-experience">
                stays-android-developing-experience <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2016/02/01/how-to-make-a-price-of-out-source/"
     data-title="外包如何定价"
     data-content=""
     data-url="http://notes.stay4it.com/2016/02/01/how-to-make-a-price-of-out-source/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/02/01/how-to-make-a-price-of-out-source/"
           data-title="外包如何定价" data-url="http://notes.stay4it.com/2016/02/01/how-to-make-a-price-of-out-source/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">18</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">28</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-5"><a class="nav-link" href="#对于个人来说"><span class="nav-number">1.</span> <span class="nav-text">对于个人来说</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#对于团队来说"><span class="nav-number">2.</span> <span class="nav-text">对于团队来说</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#对于公司来说"><span class="nav-number">3.</span> <span class="nav-text">对于公司来说</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#以下的坑希望大家别去踩"><span class="nav-number">4.</span> <span class="nav-text">以下的坑希望大家别去踩</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"stay4it-note"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  

  
  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("zG8P4e1cBLLy6DhoVe68NJqR-gzGzoHsz", "8DKIsCr0wID4auEWBv3xNV9x");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>




</body>
</html>
