<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="创业," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x521B;&amp;#x4E1A;&amp;#xFF0C;&amp;#x4F46;&amp;#x51E1;&amp;#x662F;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x4ECE;&amp;#x4E1A;&amp;#x8005;&amp;#x90FD;&amp;#x4F1A;&amp;#x60F3;&amp;#x8981;&amp;#x53BB;&amp;#x505A;&amp;#x7684;&amp;#x4E00;&amp;#x4EF6;&amp;#x4E8B;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;">
<meta property="og:type" content="article">
<meta property="og:title" content="创业前先认清自己">
<meta property="og:url" content="http://notes.stay4it.com/2014/05/27/startup-before-know-yourself-clearly/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x521B;&amp;#x4E1A;&amp;#xFF0C;&amp;#x4F46;&amp;#x51E1;&amp;#x662F;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x4ECE;&amp;#x4E1A;&amp;#x8005;&amp;#x90FD;&amp;#x4F1A;&amp;#x60F3;&amp;#x8981;&amp;#x53BB;&amp;#x505A;&amp;#x7684;&amp;#x4E00;&amp;#x4EF6;&amp;#x4E8B;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;">
<meta property="og:updated_time" content="2016-03-01T07:56:44.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="创业前先认清自己">
<meta name="twitter:description" content="&amp;#x521B;&amp;#x4E1A;&amp;#xFF0C;&amp;#x4F46;&amp;#x51E1;&amp;#x662F;&amp;#x4E92;&amp;#x8054;&amp;#x7F51;&amp;#x4ECE;&amp;#x4E1A;&amp;#x8005;&amp;#x90FD;&amp;#x4F1A;&amp;#x60F3;&amp;#x8981;&amp;#x53BB;&amp;#x505A;&amp;#x7684;&amp;#x4E00;&amp;#x4EF6;&amp;#x4E8B;&amp;#xFF0C;&amp;#x751A;&amp;#x81F3;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 创业前先认清自己 | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                创业前先认清自己
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-05-27T15:45:47+08:00" content="2014-05-27">
              2014-05-27
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经验之谈/" itemprop="url" rel="index">
                    <span itemprop="name">经验之谈</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2014/05/27/startup-before-know-yourself-clearly/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2014/05/27/startup-before-know-yourself-clearly/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2014/05/27/startup-before-know-yourself-clearly/" class="leancloud_visitors" data-flag-title="创业前先认清自己">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x521B;&#x4E1A;&#xFF0C;&#x4F46;&#x51E1;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4ECE;&#x4E1A;&#x8005;&#x90FD;&#x4F1A;&#x60F3;&#x8981;&#x53BB;&#x505A;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x53BB;&#x505A;&#x90FD;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x505A;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x9003;&#x79BB;&#x4E0D;&#x4E86;&#x7684;&#x602A;&#x5708;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x521B;&#x4E1A;&#x662F;&#x4E3A;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x521B;&#x4E1A;&#x8981;&#x53BB;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x8C8C;&#x4F3C;&#x6211;&#x4EEC;&#x90FD;&#x6CA1;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x89C9;&#x609F;&#x3002;</p>
<p><strong>&#x5728;&#x5C0F;&#x7684;&#x5B9A;&#x4E49;&#x4E0A;</strong>&#xFF0C;&#x521B;&#x4E1A;&#x662F;&#x5728;&#x67D0;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x91CC;&#x94BB;&#x7A7A;&#x5B50;&#xFF0C;&#x4EE5;&#x5C0F;&#x7EC4;&#x7EC7;&#x7684;&#x5F62;&#x5F0F;&#x5FEB;&#x901F;&#x800C;&#x654F;&#x6377;&#x7684;&#x64AC;&#x8D70;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x4E00;&#x8089;&#x997C;&#x3002;</p>
<p><strong>&#x5728;&#x5927;&#x7684;&#x5B9A;&#x4E49;&#x4E0A;</strong>&#xFF0C;&#x521B;&#x4E1A;&#x662F;&#x4E00;&#x79CD;&#x521B;&#x65B0;&#xFF0C;&#x5728;&#x4F17;&#x4EBA;&#x7686;&#x7761;&#x6211;&#x72EC;&#x9192;&#x7684;&#x4F18;&#x52BF;&#x4E0B;&#xFF0C;&#x5FEB;&#x901F;&#x5360;&#x636E;&#x67D0;&#x4E00;&#x8D44;&#x6E90;&#x800C;&#x83B7;&#x5F97;&#x751F;&#x673A;&#x3002;</p>
<p>&#x901A;&#x4FD7;&#x5B9A;&#x4E49;&#x4E0B;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x5C31;&#x662F;&#x60F3;&#x4ECE;&#x82E6;&#x903C;&#x7684;&#x5C4C;&#x4E1D;&#x53D8;&#x6210;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x96C6;&#x6743;&#x8005;&#x800C;&#x5DF2;&#xFF08;&#x52FF;&#x5BF9;&#x53F7;&#x5165;&#x5EA7;&#xFF09;&#x3002;</p>
<a id="more"></a>
<p>&#x5165;&#x884C;&#x56DB;&#x5E74;&#xFF0C;&#x597D;&#x591A;&#x4EBA;&#x90FD;&#x6002;&#x607F;&#x6211;&#x53BB;&#x521B;&#x4E1A;&#xFF0C;&#x751A;&#x81F3;&#x76F4;&#x63A5;&#x95EE;&#x6211;&#xFF0C;&#x4F60;&#x8FD9;&#x4E48;&#x725B;&#x903C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x53BB;&#x521B;&#x4E1A;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x56DE;&#x7B54;&#x3002;&#x6211;&#x5728;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x5446;&#x8FC7;&#x4E00;&#x5E74;&#x534A;&#xFF0C;&#x90A3;&#x6BB5;&#x65F6;&#x5149;&#x662F;&#x5FEB;&#x4E50;&#x4E5F;&#x5F88;&#x6F2B;&#x957F;&#x7684;&#xFF0C;&#x5FEB;&#x4E50;&#x7684;&#x662F;&#x8001;&#x677F;&#x4E0D;&#x65AD;&#x7ED9;&#x4F60;&#x6253;&#x9E21;&#x8840;&#xFF0C;&#x6F2B;&#x957F;&#x662F;&#x65E0;&#x6B62;&#x5C3D;&#x7684;&#x52A0;&#x73ED;&#x3002;&#x6280;&#x672F;&#x7684;&#x5E7F;&#x5EA6;&#x662F;&#x5728;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x91CC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x72EC;&#x6321;&#x4E00;&#x9762;&#x751A;&#x81F3;&#x591A;&#x9762;&#x3002;&#x800C;&#x4E14;&#x52A0;&#x73ED;&#x7D2F;&#x79EF;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x8BA9;&#x6211;&#x66F4;&#x5FEB;&#x7684;&#x53D8;&#x6210;&#x4E86;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x4EBA;&#x8981;&#x6709;&#x81EA;&#x77E5;&#x4E4B;&#x660E;&#xFF0C;&#x81F3;&#x5C11;&#x5728;&#x5F53;&#x4E0B;&#x9009;&#x4F60;&#x6700;&#x9002;&#x5408;&#x505A;&#x7684;&#x4E8B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6CA1;&#x4E8B;&#x7B97;&#x7B97;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x4F1A;&#x6210;&#x672C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x9897;&#x521B;&#x4E1A;&#x7684;&#x5FC3;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5E94;&#x8BE5;&#x7B97;&#x540C;&#x8F88;&#x91CC;&#x7684;&#x4F7C;&#x4F7C;&#x8005;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x9009;&#x62E9;&#x53BB;&#x521B;&#x4E1A;&#xFF0C;&#x8D8A;&#x4F18;&#x79C0;&#x7684;&#x4F60;&#x8981;&#x653E;&#x5F03;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x8D8A;&#x591A;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x7528;&#x521B;&#x4E1A;&#x7684;&#x70ED;&#x60C5;&#x53BB;&#x6253;&#x5DE5;&#xFF0C;&#x4E0D;&#x51FA;&#x51E0;&#x5E74;&#x5C31;&#x53D8;&#x9AD8;&#x7BA1;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x521B;&#x4E1A;&#x51E0;&#x5E74;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x518D;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x5927;&#x7EC4;&#x7EC7;&#x5C31;&#x5404;&#x79CD;&#x4E0D;&#x9002;&#x5E94;&#x4E86;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x521B;&#x4E1A;&#x51E0;&#x5E74;&#xFF0C;&#x5F53;&#x4E0A;CEO&#xFF0C;&#x8FCE;&#x5A36;&#x767D;&#x5BCC;&#x7F8E;&#xFF0C;&#x8D70;&#x4E0A;&#x4EBA;&#x751F;&#x5DC5;&#x5CF0;&#x4E5F;&#x8BF4;&#x4E0D;&#x5B9A;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x521B;&#x4E1A;&#x7684;&#x673A;&#x4F1A;&#x6210;&#x672C;&#x592A;&#x9AD8;&#xFF0C;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x6D6A;&#x8D39;&#x3002;</p>
<p>&#x6211;&#x81EA;&#x89C9;&#x6211;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5929;&#x751F;&#x7684;&#x9886;&#x8896;&#xFF0C;&#x6211;&#x53EA;&#x9002;&#x5408;&#x505A;&#x4E00;&#x4E2A;&#x5E2E;&#x9886;&#x8896;&#x7EF4;&#x62A4;&#x79E9;&#x5E8F;&#x7684;&#x4EBA;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x6211;&#x6CA1;&#x521B;&#x4E1A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x52AA;&#x529B;&#x505A;&#x4E00;&#x4E2A;&#x79F0;&#x804C;&#x7684;&#x7BA1;&#x7406;&#x8005;&#xFF0C;&#x7B49;&#x5230;&#x6709;&#x673A;&#x4F1A;&#x4E86;&#x6211;&#x518D;&#x53BB;&#x535A;&#x4E00;&#x628A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x9000;&#x8DEF;&#x3002;&#x800C;&#x4E14;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x5EA6;&#x806A;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x505A;&#x4E0D;&#x4E86;&#x9886;&#x8896;&#x3002;&#x6211;&#x53EA;&#x80FD;&#x914D;&#x5408;&#x90A3;&#x4E9B;&#x6709;&#x7406;&#x60F3;&#x6709;&#x5929;&#x8D4B;&#x7684;&#x4EBA;&#x5B8C;&#x6210;&#x4ED6;&#x4EEC;&#x7684;&#x5FC3;&#x613F;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x81F3;&#x4ECA;&#x6211;&#x90FD;&#x8FD8;&#x6CA1;&#x6210;&#x529F;&#x5E2E;&#x4EBA;&#x5BB6;&#x5B8C;&#x6210;&#x5FC3;&#x613F;&#x3002;&#x800C;&#x90A3;&#x4E9B;&#x6709;&#x7406;&#x60F3;&#x4F46;&#x6CA1;&#x6267;&#x884C;&#x529B;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x7B97;&#x4F60;&#x8DDF;&#x6211;&#x8BF4;&#x5343;&#x4E07;&#x904D;&#x6211;&#x4E5F;&#x53EA;&#x80FD;&#x8BF4;&#x6700;&#x8FD1;&#x597D;&#x5FD9;&#x7684;&#xFF0C;&#x7B49;&#x8FC7;&#x9635;&#x5B50;&#x518D;&#x8BF4;&#x3002;</p>
<p>&#x597D;&#x591A;&#x4EBA;&#x95EE;&#x6211;&#x670B;&#x53CB;&#x627E;&#x4ED6;&#x53BB;&#x521B;&#x4E1A;&#xFF0C;&#x95EE;&#x6211;&#x5E94;&#x4E0D;&#x5E94;&#x8BE5;&#x53BB;&#xFF1F;&#x5728;&#x4F60;&#x53BB;&#x521B;&#x4E1A;&#x4E4B;&#x524D;&#x5148;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x94B1;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x7EF4;&#x6301;&#x751F;&#x6D3B;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x4E0D;&#x4E3A;&#x4E94;&#x6597;&#x7C73;&#x6298;&#x8170;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x8981;&#x8BF4;&#xFF0C;&#x201C;&#x6211;TM&#x53BB;&#x521B;&#x4E1A;&#x8FD8;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x94B1;&#x6CA1;&#x6743;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x5E72;&#x561B;&#x8981;&#x53BB;&#x521B;&#x4E1A;&#x201C;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x4F60;&#x65E2;&#x7136;&#x8FDE;&#x6709;&#x94B1;&#x6709;&#x6743;&#x7684;&#x672C;&#x4E8B;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x4F60;&#x53BB;&#x4E86;&#x521B;&#x4E1A;&#x7684;&#x5C0F;&#x7EC4;&#x7EC7;&#x4E5F;&#x4E0D;&#x80FD;&#x62C5;&#x5F53;&#x91CD;&#x4EFB;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x60F3;&#x7684;&#x53EA;&#x662F;&#x94B1;&#x6743;&#x8FD9;&#x4E48;&#x80A4;&#x6D45;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x7EC4;&#x7EC7;&#x6709;&#x4F60;&#x6CA1;&#x4F60;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5440;&#xFF08;&#x60F3;&#x60F3;&#x5982;&#x679C;&#x5F15;&#x8FDB;&#x4E86;&#x98CE;&#x6295;&#xFF0C;&#x62DB;&#x4E86;&#x7A7A;&#x964D;&#x5175;&#xFF0C;&#x54EA;&#x91CC;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7A7A;&#x95F2;&#x7684;&#x804C;&#x4F4D;&#x7ED9;&#x4F60;&#x5750;&#x5462;&#x3002;&#xFF09;&#x3002;&#x4F60;&#x81F3;&#x5C11;&#x8981;&#x5728;&#x5403;&#x9971;&#x4E86;&#x7A7F;&#x6696;&#x4E86;&#x6709;&#x70B9;&#x751F;&#x6D3B;&#x54C1;&#x5473;&#x4E86;&#x624D;&#x80FD;&#x8BF4;&#x6211;TM&#x8FD8;&#x6709;&#x66F4;&#x9AD8;&#x66F4;&#x4F1F;&#x5927;&#x7684;&#x5FD7;&#x613F;&#x5427;&#xFF01;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x53C8;&#x4F1A;&#x8BF4;&#xFF0C;&#x201C;&#x54CE;&#x5440;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x5165;&#x80A1;&#xFF0C;&#x6211;&#x53EA;&#x7BA1;&#x505A;&#x597D;&#x4EA7;&#x54C1;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x4EBA;&#x5BB6;&#x4E5F;&#x7ED9;&#x6211;&#x5F00;&#x5DE5;&#x8D44;&#x7684;&#xFF0C;&#x6BD4;&#x6211;&#x73B0;&#x5728;&#x7684;&#x8FD8;&#x8981;&#x9AD8;&#x201C;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x80FD;&#x8FD9;&#x4E48;&#x60F3;&#x95EE;&#x9898;&#x7684;&#x4F60;&#x5F88;&#x8822;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x8981;&#x4E0D;&#x8981;&#x52A0;&#x73ED;&#xFF1F;&#x52A0;&#x73ED;&#x6709;&#x6CA1;&#x6709;&#x52A0;&#x73ED;&#x8D39;&#xFF1F;&#x4F60;&#x7684;&#x85AA;&#x6C34;&#x771F;&#x7684;&#x9AD8;&#xFF1F;&#x5176;&#x6B21;&#xFF0C;&#x4F60;&#x4F5C;&#x4E3A;&#x5927;&#x7CFB;&#x7EDF;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x5175;&#x53D8;&#x6210;&#x5C0F;&#x7EC4;&#x7EC7;&#x4E0B;&#x7684;&#x5927;&#x5175;&#xFF0C;&#x53D8;&#x5316;&#x6709;&#x591A;&#x5927;&#xFF1F;&#x76F8;&#x53CD;&#x7684;&#x4F60;&#x7684;&#x7ADE;&#x4E89;&#x4E5F;&#x66F4;&#x5927;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5C0F;&#x7EC4;&#x7EC7;&#x91CC;&#x90FD;&#x662F;&#x7CBE;&#x82F1;&#x54E6;&#x3002;&#x522B;&#x4EE5;&#x4E3A;&#x4F60;&#x5728;&#x5E73;&#x51E1;&#x4EBA;&#x5806;&#x91CC;&#x5F88;&#x51FA;&#x4F17;&#xFF0C;&#x5230;&#x4E86;&#x5C0F;&#x7EC4;&#x7EC7;&#x91CC;&#x4E00;&#x6837;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x54E6;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x4E5F;&#x4E0D;&#x884C;&#x90A3;&#x4E5F;&#x4E0D;&#x884C;&#xFF0C;&#x90A3;&#x5230;&#x5E95;&#x4EC0;&#x4E48;&#x4EBA;&#x53EF;&#x4EE5;&#x53BB;&#x521B;&#x4E1A;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5DE5;&#x4F5C;&#x4E94;&#x5E74;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x63D0;&#x5347;&#x4E8B;&#x4E1A;&#x7684;&#x5E7F;&#x5EA6;&#xFF0C;&#x627E;&#x5230;&#x6700;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x521B;&#x4E1A;&#x7684;&#x5C0F;&#x7EC4;&#x7EC7;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x91CC;&#x80FD;&#x8BA9;&#x4F60;&#x72EC;&#x6321;&#x591A;&#x9762;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x53BB;&#x5927;&#x7CFB;&#x7EDF;&#xFF0C;&#x806A;&#x660E;&#x7684;&#x4F60;&#x80AF;&#x5B9A;&#x60F3;&#x5C3D;&#x529E;&#x6CD5;&#x5F80;&#x4E0A;&#x722C;&#xFF0C;&#x5982;&#x4F55;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4F18;&#x79C0;&#xFF0C;&#x53D8;&#x6210;&#x5927;&#x5BB6;&#x90FD;&#x9700;&#x8981;&#x7684;&#x4EBA;&#x3002;&#x5DE5;&#x4F5C;&#x524D;&#x4E94;&#x5E74;&#x4F60;&#x8981;&#x8D5A;&#x7684;&#x4E0D;&#x662F;&#x94B1;&#x548C;&#x6743;&#xFF0C;&#x628A;&#x57FA;&#x7840;&#x6253;&#x597D;&#xFF0C;&#x5BF9;&#x5404;&#x79CD;&#x9886;&#x57DF;&#x548C;&#x884C;&#x4E1A;&#x6709;&#x654F;&#x9510;&#x7684;&#x55C5;&#x89C9;&#xFF0C;&#x809A;&#x5B50;&#x91CC;&#x8981;&#x6709;&#x8D27;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x6709;&#x4E00;&#x95E8;&#x7CBE;&#x901A;&#x7684;&#x624B;&#x827A;&#x5728;&#x8EAB;&#x3002;&#x8FD9;&#x6837;&#x4EE5;&#x540E;&#x7684;&#x65E5;&#x5B50;&#x624D;&#x987A;&#x98CE;&#x987A;&#x6C34;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5DE5;&#x4F5C;&#x4E94;&#x5E74;&#xFF0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8003;&#x8651;&#x5DE5;&#x4F5C;&#x4E4B;&#x5916;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5229;&#x7528;&#x4F60;&#x5E9E;&#x5927;&#x7684;&#x4F18;&#x8D28;&#x4EBA;&#x8109;&#x548C;&#x4FE1;&#x606F;&#x6E20;&#x9053;&#x8BD5;&#x6C34;&#x3002;&#x4F5C;&#x4E3A;&#x9886;&#x8896;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x786E;&#x4FDD;&#x4F60;&#x8FC8;&#x51FA;&#x4E00;&#x5927;&#x6B65;&#xFF0C;&#x4F60;&#x8EAB;&#x540E;&#x6709;&#x4F17;&#x591A;&#x613F;&#x610F;&#x5E2E;&#x52A9;&#x4F60;&#x7684;&#x4EBA;&#x652F;&#x6301;&#x4F60;&#x3002;&#x4F5C;&#x4E3A;&#x7EF4;&#x62A4;&#x9886;&#x8896;&#x7684;&#x7BA1;&#x7406;&#x8005;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5728;&#x9886;&#x8896;&#x884C;&#x52A8;&#x65F6;&#x8DDF;&#x4E0A;&#x811A;&#x6B65;&#xFF0C;&#x8FD9;&#x6837;&#x9886;&#x8896;&#x6210;&#x529F;&#x4E86;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x4F60;&#x6210;&#x529F;&#x3002;</p>
<p>&#x793E;&#x4F1A;&#x4E4B;&#x6240;&#x4EE5;&#x4F1A;&#x8FDB;&#x6B65;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x660E;&#x786E;&#x7684;&#x5206;&#x5DE5;&#x534F;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x793E;&#x4F1A;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53BB;&#x521B;&#x4E1A;&#x4E86;&#xFF0C;&#x90A3;&#x793E;&#x4F1A;&#x5C31;&#x4F1A;&#x6DF7;&#x4E71;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x91CF;&#x529B;&#x800C;&#x884C;&#xFF0C;&#x505A;&#x6700;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#x505A;&#x6700;&#x5BF9;&#x7684;&#x81EA;&#x5DF1;&#x624D;&#x662F;&#x4F60;&#x7684;&#x4F7F;&#x547D;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x5927;&#x7CFB;&#x7EDF;&#x4E0B;&#x6216;&#x8005;&#x5C0F;&#x7EC4;&#x7EC7;&#xFF0C;&#x65E0;&#x975E;&#x90FD;&#x662F;&#x4EBA;&#x4E0E;&#x4EBA;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x5DE5;&#x534F;&#x4F5C;&#x8BA9;&#x81EA;&#x5DF1;&#x8BA9;&#x793E;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#x3002;&#x522B;&#x518D;&#x7EA0;&#x7ED3;&#x521B;&#x4E1A;&#x548C;&#x5927;&#x516C;&#x53F8;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/创业/" rel="tag">#创业</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/10/01/how-to-new-a-girl-friend/" rel="prev" title="Stay教你程序员泡妞攻略">
                Stay教你程序员泡妞攻略 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2014/05/27/startup-before-know-yourself-clearly/"
     data-title="创业前先认清自己"
     data-content=""
     data-url="http://notes.stay4it.com/2014/05/27/startup-before-know-yourself-clearly/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2014/05/27/startup-before-know-yourself-clearly/"
           data-title="创业前先认清自己" data-url="http://notes.stay4it.com/2014/05/27/startup-before-know-yourself-clearly/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">18</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">28</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"stay4it-note"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  

  
  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("zG8P4e1cBLLy6DhoVe68NJqR-gzGzoHsz", "8DKIsCr0wID4auEWBv3xNV9x");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>




</body>
</html>
