<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Android,招聘,简历,面试," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x8FD9;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x770B;&amp;#x4E86;&amp;#x4E0D;&amp;#x5C11;&amp;#x7B80;&amp;#x5386;&amp;#xFF0C;&amp;#x6CA1;&amp;#x51E0;&amp;#x4E2A;&amp;#x80FD;&amp;#x770B;&amp;#x4E0A;&amp;#x7684;&amp;#x3002;&amp;#x4F5C;&amp;#x5047;&amp;#x7684;&amp;#xFF0C;&amp;#x81EA;&amp;#x6EE1;">
<meta property="og:type" content="article">
<meta property="og:title" content="我希望招聘这样的developer">
<meta property="og:url" content="http://notes.stay4it.com/2016/03/17/i-want-to-hire-a-developer-like-this/index.html">
<meta property="og:site_name" content="Stay's Notes">
<meta property="og:description" content="&amp;#x8FD9;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x770B;&amp;#x4E86;&amp;#x4E0D;&amp;#x5C11;&amp;#x7B80;&amp;#x5386;&amp;#xFF0C;&amp;#x6CA1;&amp;#x51E0;&amp;#x4E2A;&amp;#x80FD;&amp;#x770B;&amp;#x4E0A;&amp;#x7684;&amp;#x3002;&amp;#x4F5C;&amp;#x5047;&amp;#x7684;&amp;#xFF0C;&amp;#x81EA;&amp;#x6EE1;">
<meta property="og:updated_time" content="2016-03-17T01:44:47.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="我希望招聘这样的developer">
<meta name="twitter:description" content="&amp;#x8FD9;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x770B;&amp;#x4E86;&amp;#x4E0D;&amp;#x5C11;&amp;#x7B80;&amp;#x5386;&amp;#xFF0C;&amp;#x6CA1;&amp;#x51E0;&amp;#x4E2A;&amp;#x80FD;&amp;#x770B;&amp;#x4E0A;&amp;#x7684;&amp;#x3002;&amp;#x4F5C;&amp;#x5047;&amp;#x7684;&amp;#xFF0C;&amp;#x81EA;&amp;#x6EE1;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 我希望招聘这样的developer | Stay's Notes </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?a9dd8e8dc041e71337d2adaedbbaea7b";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>






  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Stay's Notes</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                我希望招聘这样的developer
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-03-17T09:40:57+08:00" content="2016-03-17">
              2016-03-17
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经验之谈/" itemprop="url" rel="index">
                    <span itemprop="name">经验之谈</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/03/17/i-want-to-hire-a-developer-like-this/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/03/17/i-want-to-hire-a-developer-like-this/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/03/17/i-want-to-hire-a-developer-like-this/" class="leancloud_visitors" data-flag-title="我希望招聘这样的developer">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x770B;&#x4E86;&#x4E0D;&#x5C11;&#x7B80;&#x5386;&#xFF0C;&#x6CA1;&#x51E0;&#x4E2A;&#x80FD;&#x770B;&#x4E0A;&#x7684;&#x3002;&#x4F5C;&#x5047;&#x7684;&#xFF0C;&#x81EA;&#x6EE1;&#x7684;&#xFF0C;&#x6577;&#x884D;&#x7684;&#xFF0C;&#x592A;&#x591A;&#x7834;&#x7EFD;&#x4E86;&#x3002;&#x7F51;&#x4F20;&#x4ECA;&#x5E74;&#x4E00;&#x4E2A;android&#x804C;&#x4F4D;&#x6709;1000&#x591A;&#x4E2A;&#x4EBA;&#x6295;&#x9012;&#xFF0C;&#x6211;&#x60F3;&#x5E94;&#x8BE5;80%&#x8FDE;&#x7535;&#x8054;&#xFF0C;&#x9762;&#x8BD5;&#x7684;&#x51E0;&#x7387;&#x90FD;&#x6CA1;&#x6709;&#x5427;&#x3002;</p>
<p>&#x867D;&#x7136;&#x73B0;&#x5728;&#x627E;&#x5DE5;&#x4F5C;&#x90FD;&#x9760;&#x63A8;&#x8350;&#xFF0C;&#x4F46;&#x597D;&#x6B79;&#x8FD8;&#x662F;&#x8981;&#x770B;&#x770B;&#x7B80;&#x5386;&#x7684;&#x5427;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x7529;&#x51FA;&#x6392;&#x540D;1000&#x5185;&#x7684;csdn&#x535A;&#x5BA2;&#x6216;&#x8005;star&#x8FC7;1000&#x7684;github&#x3002;&#x7B80;&#x5386;&#x5C31;&#x597D;&#x6BD4;&#x4F60;&#x7684;&#x7740;&#x88C5;&#xFF0C;&#x770B;&#x90FD;&#x770B;&#x4E0D;&#x4E0B;&#x53BB;&#x8C01;&#x8FD8;&#x60F3;&#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x4E0B;&#x53BB;&#x5462;&#x3002;</p>
<p>&#x8BF4;&#x4E0B;Stay&#x7B5B;&#x9009;&#x7B80;&#x5386;&#x7684;&#x6807;&#x51C6;&#x3002;</p>
<a id="more"></a>
<ol>
<li>&#x8D34;&#x7684;&#x7167;&#x7247;&#x4E0D;&#x597D;&#x770B;&#x7684;&#xFF0C;&#x6263;&#x5206;&#x3002;(&#x672C;&#x6765;1&#x5BF8;&#x7167;&#x5C31;&#x4E0D;&#x4F1A;&#x597D;&#x770B;&#x554A;&#xFF0C;&#x522B;&#x7ED9;&#x4EBA;&#x6DFB;&#x5835;&#x554A;&#xFF0C;&#x770B;&#x7B80;&#x5386;&#x4E5F;&#x662F;&#x5F88;&#x7D2F;&#x7684;)</li>
<li>&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x5468;&#x671F;&#x90FD;&#x662F;4&#x4E2A;&#x6708;&#x4EE5;&#x5185;&#x7684;&#xFF0C;&#x6263;&#x5206;&#x3002;(&#x8FD9;&#x4E0D;&#x662F;&#x505A;&#x5916;&#x5305;&#x5C31;&#x662F;&#x505A;&#x5916;&#x5305;&#x554A;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x77ED;&#x7684;&#x4EA7;&#x54C1;&#x5468;&#x671F;&#xFF0C;&#x5BF9;&#x4E1A;&#x52A1;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x91CD;&#x6784;&#x7684;&#x7ECF;&#x9A8C;&#x90FD;&#x592A;&#x5C11;&#x592A;&#x5C11;&#x4E86;&#x3002;)</li>
<li>2&#x5E74;&#x7ECF;&#x9A8C;&#x4EE5;&#x4E0A;&#x7684;&#xFF0C;&#x6CA1;&#x5199;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x4F18;&#x5316;&#xFF0C;&#x91CD;&#x6784;&#x89C1;&#x89E3;&#x7684;&#xFF0C;&#x6263;&#x5206;&#x3002;(&#x5047;&#x5982;&#x4ED6;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x5E74;&#x7ECF;&#x9A8C;&#x7528;&#x5341;&#x5E74;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4ED6;&#x80AF;&#x5B9A;&#x4F1A;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x65AD;&#x6DF1;&#x5165;&#x7684;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x77E5;&#x96BE;&#x800C;&#x9000;&#xFF0C;&#x628A;&#x5751;&#x4EA4;&#x7ED9;&#x522B;&#x4EBA;&#x3002;Android&#x8FD9;&#x4E48;&#x591A;&#x5751;&#xFF0C;&#x600E;&#x4E48;&#x7740;&#x90FD;&#x8BE5;&#x6709;&#x4ED6;&#x6D89;&#x730E;&#x8FC7;&#x7684;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x5F97;&#x5199;&#x51FA;&#x6765;&#x3002;&#x5047;&#x5982;&#x6CA1;&#x6709;&#xFF0C;&#x6263;&#x5206;)</li>
<li>4&#x5E74;&#x7ECF;&#x9A8C;&#x4EE5;&#x4E0A;&#x7684;&#xFF0C;&#x6CA1;&#x5199;&#x201C;&#x72EC;&#x7ACB;&#xFF0C;&#x67B6;&#x6784;&#xFF0C;lead&#xFF0C;&#x6E90;&#x7801;&#xFF0C;&#x5F00;&#x6E90;&#xFF0C;&#x6C9F;&#x901A;&#xFF0C;&#x534F;&#x8C03;&#x201D;&#x7B49;&#x5B57;&#x773C;&#x7684;&#xFF0C;&#x6263;&#x5206;&#x3002;(&#x4ED6;&#x4E0D;&#x5E94;&#x8BE5;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x53EA;&#x662F;&#x9886;&#x4EFB;&#x52A1;&#xFF0C;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;&#x800C;&#x5E94;&#x8BE5;&#x96C6;&#x6210;&#x5230;&#x6574;&#x4E2A;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x73AF;&#xFF0C;&#x5047;&#x5982;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x592A;&#x5408;&#x683C;&#x4E86;)</li>
<li>&#x6700;&#x8FD1;&#x4E00;&#x4E2A;&#x4E0A;&#x7EBF;&#x7684;&#x4EA7;&#x54C1;&#x6CA1;&#x9644;&#x4E0A;link&#x7684;&#xFF0C;&#x6263;&#x5206;&#x3002;(&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7528;&#x4EA7;&#x54C1;&#x8BF4;&#x8BDD;&#xFF1F;&#x5047;&#x5982;&#x6CA1;&#x6709;&#xFF0C;&#x81F3;&#x5C11;&#x653E;&#x653E;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#xFF0C;github&#x7B49;)</li>
<li>&#x4E09;&#x5E74;&#x7ECF;&#x9A8C;&#x4EE5;&#x4E0B;&#xFF0C;&#x770B;&#x5230;&#x591A;&#x4E2A;&#x201C;&#x7CBE;&#x901A;&#x201D;&#xFF0C;&#x6263;&#x5206;&#x3002;(Stay&#x7684;&#x7B80;&#x5386;&#x91CC;&#x4ECE;&#x6765;&#x4E0D;&#x5199;&#x7CBE;&#x901A;&#xFF0C;&#x4E0D;&#x662F;&#x8C26;&#x865A;&#xFF0C;&#x56E0;&#x4E3A;&#x6DF1;&#x5165;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x8D8A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x61C2;&#x7684;&#x592A;&#x5C11;&#xFF0C;&#x5373;&#x4F7F;&#x53EA;&#x9488;&#x5BF9;&#x5E94;&#x7528;&#x5C42;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x7CBE;&#x901A;)</li>
<li>&#x660E;&#x663E;&#x9020;&#x5047;&#x7684;&#xFF0C;pass&#x3002;(&#x9020;&#x5047;&#x4E0D;&#x4E22;&#x4EBA;&#xFF0C;&#x4F46;&#x597D;&#x6B79;&#x4F2A;&#x9020;&#x7684;&#x771F;&#x4E00;&#x70B9;&#x554A;&#x3002;&#x6BD5;&#x4E1A;&#x4E00;&#x5E74;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E09;&#x5E74;&#x3002;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x5728;&#x505A;&#x597D;&#x51E0;&#x4E2A;&#x9879;&#x76EE;&#x7B49;&#x3002;&#x771F;&#x662F;&#x8FC7;&#x4EFD;&#x554A;&#x3002;)</li>
<li>&#x4E24;&#x5E74;&#x6362;&#x4E09;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#xFF0C;pass&#x3002;(&#x8FD9;&#x6BD4;&#x6807;&#x51C6;2&#x8FD8;&#x8FC7;&#x4EFD;&#x554A;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x6280;&#x672F;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x957F;&#x8FDB;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x9009;&#x62E9;&#x80FD;&#x529B;&#x592A;&#x5DEE;&#x4E86;&#x3002;&#x4E14;&#x4E0D;&#x8BF4;&#x4ED6;&#x6709;&#x6CA1;&#x6709;&#x5FE0;&#x8BDA;&#x5EA6;)</li>
</ol>
<p>&#x4EE5;&#x4E0A;&#x662F;Stay&#x4E2A;&#x4EBA;&#x6807;&#x51C6;&#x3002;&#x5047;&#x5982;&#x7B80;&#x5386;&#x80FD;&#x901A;&#x8FC7;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4ED6;&#x80FD;show me the code&#x3002;&#x53D1;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x5199;&#x7684;java&#x7C7B;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x901A;&#x8FC7;code&#x80FD;&#x5224;&#x65AD;&#x51FA;&#x8FD9;&#x4E2A;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#xFF0C;&#x89C4;&#x8303;&#xFF0C;&#x662F;&#x5426;&#x6CE8;&#x91CD;&#x590D;&#x7528;&#xFF0C;&#x89E3;&#x8026;&#x3002;&#x5982;&#x679C;code&#x5F88;&#x7CDF;&#x7CD5;&#xFF0C;&#x90A3;pass&#x3002;&#x5982;&#x679C;&#x5199;&#x7684;&#x6709;&#x4E9B;&#x4E0D;&#x7F3A;&#x9677;&#xFF0C;&#x6211;&#x4F1A;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x70B9;&#x53BB;&#x548C;&#x4ED6;&#x8BA8;&#x8BBA;&#xFF0C;&#x5728;&#x8BA8;&#x8BBA;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x90A3;&#x5224;&#x65AD;&#x51FA;code&#x662F;&#x5426;&#x771F;&#x7684;&#x662F;&#x4ED6;&#x5199;&#x7684;&#xFF0C;&#x662F;&#x5426;&#x7EC6;&#x5FC3;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x9003;&#x907F;&#x3002;</p>
<p>&#x5047;&#x5982;&#x4EE5;&#x4E0A;&#x8FC7;&#x7A0B;&#x5F7C;&#x6B64;&#x90FD;&#x5F88;&#x6109;&#x5FEB;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x7EA6;&#x6765;&#x9762;&#x8BD5;&#x770B;&#x770B;&#x4E86;&#x3002;&#x6211;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x8981;&#x6C42;&#x4EBA;&#x505A;&#x9898;&#xFF0C;&#x4E5F;&#x4E0D;&#x592A;&#x4F1A;&#x8003;&#x7B97;&#x6CD5;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x9762;&#x8C08;&#x6765;&#x5224;&#x65AD;&#x4ED6;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x4ED6;&#x5728;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x903B;&#x8F91;&#x611F;&#xFF0C;&#x662F;&#x5426;&#x5584;&#x4E8E;&#x6C9F;&#x901A;&#xFF0C;&#x80FD;&#x5426;&#x81EA;&#x5706;&#x5176;&#x8BF4;(&#x6709;&#x7684;&#x725B;B&#x5439;&#x5439;&#x5C31;&#x7834;&#x4E86;)&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x6280;&#x672F;&#xFF0C;&#x5F97;&#x5206;&#x5C97;&#x4F4D;&#xFF0C;&#x5206;&#x9884;&#x7B97;&#x3002;&#x8FD9;&#x4E2A;&#x5F97;&#x53E6;&#x5F00;&#x4E13;&#x9898;&#x53BB;&#x8BA8;&#x8BBA;&#x3002;Stay&#x6BD4;&#x8F83;&#x4E2D;&#x5EB8;&#xFF0C;&#x6280;&#x672F;&#x597D;&#x4E0D;&#x597D;&#x90FD;&#x4E0D;&#x4EE3;&#x8868;&#x5168;&#x90E8;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x662F;&#x627E;&#x6700;&#x9002;&#x5408;&#x7684;&#x4EBA;&#xFF0C;&#x5929;&#x4E0B;&#x4F55;&#x5904;&#x65E0;&#x7801;&#x519C;&#xFF0C;&#x5BF9;&#x5427;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x5E9F;&#x8BDD;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x662F;&#x60F3;&#x62DB;&#x4E2A;&#x4E2D;&#x7EA7;android&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;JD&#xFF1A;</p>
<p>&#x4E8C;&#x5E74;&#x5DE6;&#x53F3;Android&#x7ECF;&#x9A8C;&#xFF0C;&#x771F;&#x6B63;&#x53C2;&#x4E0E;&#x5230;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x5468;&#x671F;&#x4E2D;(&#x81F3;&#x5C11;&#x4E00;&#x5E74;&#x5DE6;&#x53F3;)&#xFF0C;&#x5BF9;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x4E0D;&#x8981;&#x592A;&#x5185;&#x5411;&#xFF0C;&#x80FD;&#x4E3B;&#x52A8;&#x6C9F;&#x901A;&#x53CD;&#x9988;&#xFF0C;&#x522B;&#x88AB;&#x52A8;&#x9A71;&#x4F7F;&#x3002;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x61C2;&#x70B9;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6700;&#x4F73;&#xFF0C;&#x559C;&#x6B22;&#x5C1D;&#x8BD5;&#x65B0;&#x6280;&#x672F;&#xFF0C;&#x719F;&#x6089;&#x5E38;&#x7528;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#x7528;&#x6CD5;&#xFF0C;&#x5E76;&#x5206;&#x6790;&#x8FC7;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x6709;&#x8FC7;&#x4E86;&#x89E3;&#x6700;&#x4F73;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x8BA4;&#x771F;&#x5B66;&#x4E60;&#x8FC7;Stay&#x7684;&#x8BFE;&#x7A0B;&#xFF0C;&#x5E76;&#x81EA;&#x5DF1;&#x4E00;&#x4E00;&#x5B9E;&#x8DF5;&#x8FC7;&#xFF0C;&#x90A3;&#x662F;&#x6700;&#x597D;&#x4E0D;&#x8FC7;&#x4E86;&#xFF0C;&#x7701;&#x5F97;&#x6211;&#x518D;&#x8BB2;&#x4E00;&#x904D;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x8981;&#x6C42;&#x4E0D;&#x662F;&#x786C;&#x6027;&#x7684;&#xFF0C;&#x4F46;&#x601D;&#x7EF4;&#x8981;&#x6D3B;&#x8DC3;&#xFF0C;&#x903B;&#x8F91;&#x8981;&#x4E25;&#x8C28;&#xFF0C;&#x80FD;&#x72EC;&#x7ACB;&#x505A;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x7684;Stay&#x8FD8;&#x80FD;&#x6162;&#x6162;&#x6559;&#xFF0C;&#x8111;&#x5B50;&#x4E0D;&#x597D;&#x4F7F;&#x90A3;&#x5C31;&#x771F;&#x6CA1;&#x8F99;&#x3002;</p>
<p>&#x4ECB;&#x7ECD;&#x4E0B;&#x516C;&#x53F8;&#x4EA7;&#x54C1;&#xFF1A;&#x5F00;&#x5F00;&#x4FDD;&#xFF0C;&#x52AA;&#x529B;&#x6253;&#x9020;&#x4E92;&#x8054;&#x7F51;&#x8F66;&#x9669;&#x5E73;&#x53F0;,&#x901A;&#x8FC7;&#x5927;&#x6570;&#x636E;&#x5B9A;&#x4EF7;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x7CBE;&#x51C6;&#x5B9A;&#x4EF7;,&#x4E3A;&#x4F18;&#x8D28;&#x8F66;&#x4E3B;&#x63D0;&#x4F9B;&#x4E2A;&#x6027;&#x5316;&#x3001;&#x9AD8;&#x6027;&#x4EF7;&#x6BD4;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x8F66;&#x9669;&#x4EA7;&#x54C1;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x7528;&#x6237;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#xFF0C;&#x7ED9;&#x90A3;&#x4E9B;&#x9A7E;&#x9A76;&#x4E60;&#x60EF;&#x826F;&#x597D;&#x7684;&#x8F66;&#x4E3B;&#x8FD4;&#x8FD8;&#x90E8;&#x5206;&#x4FDD;&#x8D39;&#x3002;</p>
<p>&#x5F85;&#x9047;&#xFF0C;&#x9884;&#x7B97;&#x662F;15k&#x4EE5;&#x5185;(&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;)&#xFF0C;&#x914D;pro&#xFF0C;&#x6709;&#x53CC;&#x4F11;&#xFF0C;&#x4E0D;&#x52A0;&#x73ED;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0D;&#x7B97;&#x96BE;&#xFF0C;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5B89;&#x6392;(&#x5F53;&#x7136;&#x6211;&#x6307;&#x7684;&#x662F;&#x7814;&#x7A76;&#x6280;&#x672F;)&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x5570;&#x55E6;&#x4E86;&#xFF0C;&#x6709;&#x610F;&#x5411;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x53D1;&#x7B80;&#x5386;&#x5230;&#x6211;&#x7684;&#x90AE;&#x7BB1;&#x6216;&#x8005;QQ&#x6211; 104816053&#x3002;</p>
<p>&#x6B64;&#x62DB;&#x8058;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x6708;&#x3002;2016.3.16</p>
<blockquote>
<p>&#x58F0;&#x660E;:&#x672C;&#x6587;&#x4E3A;Stay&#x539F;&#x521B;,&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#x8BF7;&#x52FF;&#x8F6C;&#x8F7D;  <a href="http://www.stay4it.com" target="_blank" rel="external">&#x6709;&#x5FC3;&#x8BFE;&#x5802;(stay4it.com)</a> &#x4F20;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF5E;</p>
</blockquote>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Android/" rel="tag">#Android</a>
          
            <a href="/tags/招聘/" rel="tag">#招聘</a>
          
            <a href="/tags/简历/" rel="tag">#简历</a>
          
            <a href="/tags/面试/" rel="tag">#面试</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/03/10/refactoring-recyclerview/" rel="next" title="RecyclerView再封装">
                <i class="fa fa-chevron-left"></i> RecyclerView再封装
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/24/how-to-build-cpp-with-ndk/" rel="prev" title="Android NDK编译C/C++小结">
                Android NDK编译C/C++小结 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2016/03/17/i-want-to-hire-a-developer-like-this/"
     data-title="我希望招聘这样的developer"
     data-content=""
     data-url="http://notes.stay4it.com/2016/03/17/i-want-to-hire-a-developer-like-this/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/03/17/i-want-to-hire-a-developer-like-this/"
           data-title="我希望招聘这样的developer" data-url="http://notes.stay4it.com/2016/03/17/i-want-to-hire-a-developer-like-this/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/my_avatar.jpg"
               alt="Stay" />
          <p class="site-author-name" itemprop="name">Stay</p>
          <p class="site-description motion-element" itemprop="description">select * from life</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">20</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">8</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">38</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Stay" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.stay4it.com" target="_blank">
                  
                    <i class="fa fa-globe"></i> 有心课堂
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Stay</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"stay4it-note"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  

  
  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("zG8P4e1cBLLy6DhoVe68NJqR-gzGzoHsz", "8DKIsCr0wID4auEWBv3xNV9x");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>




</body>
</html>
